{"crypto": [{"name": "Illumination", "desc": "Erreur-404 débutant - beginner\n\nVotre partenaire de chambre commence à agir de façon hérétique et à écrire une suite de nombres sur les murs de la cellule. Est-ce que ce serait sa date de sortie de prison? Le plan de la prison?? Ou mieux encore, un plan d'évasion?!\n\nYour roommate starts acting heretically and writing a sequence of numbers on the cell walls. Could it be her release date from prison? The prison layout? Or better yet, an escape plan?!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/crypto/Illumination/numbers.txt"]}, {"name": "Interception", "desc": "Ch0ufleur débutant - beginner\n\nUn de vos amis geek est venu vous visiter lors de la période de visite pour faire appel à votre expertise. Lors d'une intrusion dans un réseau interne utilisant Windows, votre ami a réussi à intercepter une séquence NTLM et il aimerait savoir ce qui se cache derrière... Vous vous dites qu'un dictionnaire connu pourrait sûrement aider.\n\n2E686C551374CC44246017CB5A1E7BFD\n\nFlag: mettre ce que vous trouvez dans polycyber{}\n\nOne of your geeky friends came to visit during the penitentiary's visitation period to call on your cyber expertise. When hacking into an internal network using Windows, your friend intercepted a NTLM sequence, and he would like to know what you could find behind it... You think for yourself that a well-known dictionary would be an ideal starting point.\n\n2E686C551374CC44246017CB5A1E7BFD\n\nFlag: put whatever you find inside polycyber{}\n"}], "misc": [{"name": "Perl meets Brain", "desc": "Ch0ufleur débutant - beginner\n\nTu as entendu dire que deux personnes dans la prison étaient des spécialistes en communication secrète. Leurs noms: Amélie Perl et Remy Brain. Avant de t'aider dans ton évasion, ils ont décidé de tester tes capacités. Ils te donnent un mystérieux bout de texte qui semble n'avoir aucun sens.\n\nSauras-tu prouver à ce couple de prisonniers que tu mérites leur aide?\n\nYou've heard that two people in the prison are specialists in secret communication. Their names: Amélie Perl and Remy Brain. Before helping you in your escape, they've decided to test your skills. They give you a mysterious piece of text that doesn't seem to make any sense.\n\nCan you prove to this couple of prisoners that you deserve their help?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/misc/Perl_meets_Brain/perl-meets-brain.txt"]}], "mobile": [{"name": "HiveHex Solitary Timer", "desc": "Ch0ufleur\n\nDans sa générosité incroyable, la prison t'a prêté un téléphone pendant ton temps en confinement pour mauvaise conduite. Le hic: la seule application disponible est un chronomètre pour compter le temps restant... Pas super intéressant.\n\nCoup de théâtre! Les responsables ont oublié de t'enlever le cellulaire une fois ton temps en confinement terminé. Tu montes aux ordinateurs de la bibliothèque et, cyber-curieux de nature, tu tentes de voir si le cellulaire permet à la prison de récolter certaines informations sur son utilisateur...\n\nAprès quelques minutes à inspecter le contenu du téléphone, tu trouves un fichier .dart abandonné dans le dossier des téléchargements. Probablement un artéfact qui s'est retrouvé au mauvais endroit!\n\nCeci n'est pas un défi web. Le site web ch0ufleur.dev ne doit pas être attaqué, il agit comme centre de commande et contrôle tampon. Ne pas essayer d'obtenir une réponse HTTP utile de ce site web. Toute tentative d'attaque sur le site conduira à une disqualification.\n\nThanks to their incredible generosity, HiveHex Penitentiary staff have lent you a cellphone for your time in solitary. The thing is, the only available app is a timer to measure the time you have left to stay in solitary. Not fun.\n\nAmazing! The staff have forgotten to take back the cellphone once you got out of solitary. You go up to the library's computer room and, because you are cyber-curious, you try and see if the cellphone is gathering information about its user through the timer app...\n\nAfter a few minutes of searching around the cellphone's hard drive, you find an abandoned .dart file in the Downloads folder. Most likely, it was misplaced by accident.\n\nThis is NOT a web exploitation challenge. The ch0ufleur.dev website must not be attacked directly: it acts as a placeholder Command-And-Control server. Do not try to obtain any sort of useful HTTP response. Any attack attempt on the website will be grounds for disqualification.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/mobile/HiveHex_Solitary_Timer/TheTimer.apk", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/mobile/HiveHex_Solitary_Timer/the_retrieved_file.dart"]}, {"name": "Ungoing Cafeteria Development", "desc": "Ch0ufleur\n\nLa cafétéria de la prison a entendu parlé des prouesses que vous avez faites pour l'application web des repas (ou que vous allez bientôt faire). Elle vous a donc confié la revue des pratiques de sécurité de sa nouvelle application mobile de commande de plats. Elle insiste que vous vous concentriez sur l'interface affichée, la partie administrative ne vous concerne pas. De toute façon, vous ne seriez pas capable d'y accéder, n'est-ce pas?\n\nLa madame de la cafétéria a mentionné quelque chose à propos d'Android 29...\n\nFlag: mettre le code trouvé dans polycyber{}\n\nThe penitentiary's cafeteria has heard of the wonders you worked for the web application Cafeteria Meals (or the ones you are soon going to work. Because of that, they gave you the task of reviewing the security practices of their new mobile app to order meals. They insist that you stay on the displayed interface, the administrative side should not be touched by a felon like you. Anyways, there is no way you'd be able to access it, right?\n\nThe cafeteria lady mentionned something about using Android 29...\n\nFlag: put the code that you find inside polycyber{}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/mobile/Ungoing_Cafeteria_Development/cafeteria_dev.apk"]}], "net": [{"name": "Doorman 1", "desc": "Un de mes chums a eu accès aux communications internes entre un opérateur et le système de gestion de la prison. Je me demande si on pourrait aider nos amis en dedans avec ces requêtes bizarres.\n\nJe ne connais pas trop ça, mais mon contact, \"Le Shark\", m'a dit que ça a quelque chose à voir avec la serialization de Google ou un truc du genre.\n\nNote: Ce défi contient plusieurs flags\n\nA buddy of mine got access to the internal communications between an operator and the jail's management system. I wonder if we could help our friends in the clink with those fiddly requests.\n\nI don't know much of this stuff, but my source The Shark tells me it has something to do with Google's serialization or something like that.\n\nNote: This challenge contains multiple flags\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/net/Doorman_1/leaked.pcap.xz"]}, {"name": "Doorman 2", "desc": "Un de mes chums a eu accès aux communications internes entre un opérateur et le système de gestion de la prison. Je me demande si on pourrait aider nos amis en dedans avec ces requêtes bizarres.\n\nJe ne connais pas trop ça, mais mon contact, \"Le Shark\", m'a dit que ça a quelque chose à voir avec la serialization de Google ou un truc du genre.\n\nNote: Ce défi contient plusieurs flags\n\nA buddy of mine got access to the internal communications between an operator and the jail's management system. I wonder if we could help our friends in the clink with those fiddly requests.\n\nI don't know much of this stuff, but my source The Shark tells me it has something to do with Google's serialization or something like that.\n\nNote: This challenge contains multiple flags\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/net/Doorman_2/leaked.pcap.xz"]}, {"name": "Doorman 3", "desc": "Un de mes chums a eu accès aux communications internes entre un opérateur et le système de gestion de la prison. Je me demande si on pourrait aider nos amis en dedans avec ces requêtes bizarres.\n\nJe ne connais pas trop ça, mais mon contact, \"Le Shark\", m'a dit que ça a quelque chose à voir avec la serialization de Google ou un truc du genre.\n\nNote: Ceci est le dernier défi de la série Doorman\n\nA buddy of mine got access to the internal communications between an operator and the jail's management system. I wonder if we could help our friends in the clink with those fiddly requests.\n\nI don't know much of this stuff, but my source The Shark tells me it has something to do with Google's serialization or something like that.\n\nNote: This is Doorman track's last challenge\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/net/Doorman_3/leaked.pcap.xz"]}], "osint": [{"name": "SteganOsint 1", "desc": "Yxène\n\nPour échapper à la surveillance du HiveHex Penitentiary qui vérifie toutes les communications, un de vos informateurs à l'extérieur de la prison vous envoie des messages en les dissimulant dans des images.\n\nCette fois il indique l'emplacement d'une planque où vous pourrez le retrouver si vous réussissez à sortir de HiveHex.\n\nVous recevez donc une image accompagnée des mots \"La maison du bonheur ?\". Trouvez à qui appartient cette maison.\n\nLe flag est à fournir sous la forme polycyber{prenom_nom} tout en minuscule et les différents mots doivent être séparés par des tirets du bas. Exemple pour \"Abedi Pelé\": polycyber{abedi_pelé}\n\nTo escape the surveillance of the HiveHex Penitentiary which checks all communications, one of your informants outside the prison sends you messages by hiding them in images.\n\nThis time he indicates the location of a hideout where you can find him if you manage to get out of HiveHex.\n\nSo you receive an image accompanied by the words \"La maison du bonheur ?\". Find out who owns this house.\n\nThe flag must be provided in the form polycyber{first_name_last_name} all in lower case and the different words must be separated by underscores. Example for \"Abedi Pelé\": polycyber{abedi_pelé}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/osint/SteganOsint_1/Tableau.webp"]}], "rev": [{"name": "Keypad", "desc": "Niftic\n\nVous êtes certain.e que le bureau du directeur de la prison cache quelque chose. Malheureusement, l'entrée est barrée par un clavier numérique. Saurez-vous retrouver le NIP?\n\nLe flag a le format suivante: polycyber{NIP}. Par exemple, si le NIP est 1234, alors le flag serait polycyber{1234}.\n\nYou are convinced that the warden's office is hiding something. Unfortunately, it is locked with a keypad. Will you be able to recover the PIN?\n\nThe flag has the following format: polycyber{NIP}. For example, if the NIP is 1234, then the flag would be polycyber{1234}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/rev/Keypad/keypad"]}, {"name": "Prison Cells", "desc": "Erreur-404\n\nIl y a quelques années, des criminels ont réussi à pénétrer le système de la prison afin de libérer Davey, un ancien prisonnier. Ils n'ont pas effacé leurs traces du système de gestion des cellules, auquel tu as gagné accès. Suis-les pour t'aider à t'échapper!\n\nA few years ago, criminals managed to penetrate the prison system in order to free Davey, a former inmate. They did not erase their traces from the cell management system, to which you have gained access. Follow them to help you escape!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/rev/Prison_Cells/prison_cell_management"]}], "steg": [{"name": "Inkblot", "desc": "Octomany\n\nDans les ombres de la prison, un prisonnier vous approche et vous présente une image. Il dit que si vous parvenez à extraire l'information qu'elle contient, il pourra peut-être vous aider à vous échapper...\n\nIn the shadows of the prison, a prisoner approaches you and presents you with an image. He says that if you manage to extract the information it contains, he could help you escape...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/24hCTF/2024/steg/Inkblot/paper.png"]}]}