{"crypto": [{"name": "Block construction", "desc": "\"Sir, sir! This is a construction site.\" You look up at what you thought was a building being constructed, but you realize it is a construction bot. \"Sir please move aside. I had to have these blocks in order since last week, but some newbie construction bot shuffled them.\" \"I can move aside, \" you tell the bot, \"but I might be able to help you out.\"\n\nCan you help the bot get the blocks in order?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/crypto/Block_construction/block_construction.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/crypto/Block_construction/ciphertext"]}, {"name": "Flag based key expansion", "desc": "Through the trees you see a singing robot, rocking it on its keyboard. \"Some day!\" it sings, \"Soome day, we'll expand all our keys, no one needs to see, except you and me. Can this pixel be us? Can it be cracked? Well if we hack it, we'll hack it togetheeer\". The robot suddenly stops singing, making a sound that can only be described as a robot sighing. \"What's wrong?\" you ask. \"I hashed the last four words of my lyrics to keep them safe, \" the robot explains. \"But I accidentally pixelized the image and now I can't read them!\"\n\nCan you help the robot recover its lyrics?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/crypto/Flag_based_key_expansion/challenge.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/crypto/Flag_based_key_expansion/key_expansion.py"]}, {"name": "Messengesus", "desc": "You encounter a bot meditating in the park. He opens his cameras and begins to speak.\n\n\"Hear the word of RNGesus. Complexity is the enemy of security. Let your encryption be as simple as possible, as to secure it, thusly\". He hands you a flyer with a snippet of code. \"Secure every message you have with it. Only those who see can enter.\"\n\nWhat do you think? Is it simple enough to be secure?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/crypto/Messengesus/messengesus.c"]}, {"name": "Thus spoke machine", "desc": "\"One of our bots loves to read. We don't get it. Why would you stare at paper when all proper knowledge is shared by bots on the internet? Lately she even started talking in ciphers. I think the poor bot is possessed!\"\n\nCan you figure out what she was trying to say?\n\nbrck{1746200913432170593.11_1740398198542172490.3_789837700517945346.13}\n"}], "misc": [{"name": "Eye doctor", "desc": "A creaky old bot is zooming in and out of an eye chart. \"Can you read the bottom line?\" the doctor asks. \"No way, \" the bot replies. \"At a certain distance my view becomes convoluted. Here, I'll make a screenshot.\"\n\nYou and the doctor look at the screenshot. Can you tell what's wrong with the bot's visual processor?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/misc/Eye_doctor/approach.png"]}, {"name": "Microservices", "desc": "\"Oops I dropped the flag! Better not let the other bots know. I'll send it to you OOB so they won't see the traffic.\"\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/misc/Microservices/microservices.py"]}, {"name": "e", "desc": "\"Grrrrr\". This robot just growls. The other bots tell you that it is angry because it can't count very high. Can you teach it how?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/misc/e/e.cpp"]}], "rev": [{"name": "Binary shrink", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/rev/Binary_shrink/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/rev/Binary_shrink/binary_shrink"], "desc": "After hearing about young computer problems, you have decided to become a computer shrink. Your first patient is a robot elf.\n\n\"A little machine dream I keep having, \" she says. \"But when it is over, I always forget the end. I've captured the dream's program, but I don't dare look\".\n\nCan you run the program for her? Are you able to figure out what's in her memory right before execution stops?\n"}, {"name": "Computer says beep", "desc": "A confused PE binary has a bad case of the beeps. \"It's hard being a beeping binary. Lately I've been beeping and I don't even know where the beeps are coming from. It's like I'm unconsciously beeping before my beeps even beep.\"\n\nCan you figure out where the beeps are coming from?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/rev/Computer_says_beep/tinypebees.exe.xz"]}, {"name": "Embryobot", "desc": "\"This part will be the head, \" the nurse explains. The proud android mother looks at her newborn for the first time. \"However, \" the nurse continues, \"we noticed a slight growing problem in its code. Don't worry, we have a standard procedure for this. A human just needs to do a quick hack and it should continue to grow in no time.\"\n\nThe hospital hired you to perform the procedure. Do you think you can manage?\n\nThe embryo is:\nf0VMRgEBAbADWTDJshLNgAIAAwABAAAAI4AECCwAAAAAAADo3////zQAIAABAAAAAAAAAACABAgAgAQITAAAAEwAAAAHAAAAABAAAA==\n"}, {"name": "Fetusbot", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/rev/Fetusbot/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/rev/Fetusbot/fetusbot"], "desc": "Our android mother has reached her third trimester, where she started to experience some pain in the right lower back. Before the doctor advises pelvic tilt exercises, you get called on the job for a procedural check on the fetus's programming.\n\nIn the code, you see that the fetus is indeed requesting input, but it also seems to have developed a protective mechanism to prevent execution of your data!\nCan you hack the fetus and her mother back to health?\n"}, {"name": "Injecting commands", "desc": "Another bot needs your help! This time a Macho robot started giving itself commands, lots of them! What's going on in its head?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/rev/Injecting_commands/command_injection"]}, {"name": "The mainframe speaks", "desc": "\"Oh ancient robeth! All throughout the land they talk of you becoming obsolete. How is you? Are you in need of assistance?\"\n\n\"Obsolete? These bots must be abending. I'm working just fine you see. Young bots are the ones having all sorts of troubles, not us. We're maintained and properly managed. However, I do have this old code lying around, and I lost the documentation. Can you find it for me?\"\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/rev/The_mainframe_speaks/chall.rexx"]}], "web": [{"name": "Empty execution", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Empty_execution/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Empty_execution/empty_execution.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Empty_execution/flag.txt"], "desc": "A REST service was created to execute commands from the leaderbot. It doesn't need addtional security because there are no commands to execute yet. \"This bot doesn't have any commands to execute, which is good, because it is secure, and security is all that matters.\"\n\nBut what the other bots didn't realize was that this didn't make the bot happy at all. \"I don't want to be secure!, \" it says. \"Executing commands is my life! I'd rather be insecure than not explore the potential of my computing power\".\n\nCan you help this poor bot execute commands to find direction?\n"}, {"name": "Node Calculator", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Node_Calculator/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Node_Calculator/NodeCalculator.war", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Node_Calculator/flag.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Node_Calculator/location.txt"], "desc": "It's a busy day in class. The teacher bot explains that the students need to use the nodecalculator service to calculate their binary distance to the closest leaderbot. The young bots complain to you, \"This doesn't make any sense to me, although to be honest, I didn't make any notes. You're a human, can't you figure out how this service works?\"\n\nCan you figure out how to use this service?\n\nSample request:\n(POST request, Content-Type is application/xml)\n<Node><location>testing</location></Node>\n"}, {"name": "Stuffy", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Stuffy/Dockerfile", null, null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BraekerCTF/2024/web/Stuffy/supervisord.conf"], "desc": "A screen shows a document labeled Optimal_human_interaction_design.ppt. \"What's that design about?\" you ask.\nThe bot replies \"It is called 'social media': We'll have everyone send messages to each other on a public forum, with messages no longer than 200 characters. This will force them to think deep and write convincing arguments with as little words as possible, to prevent humans from acting pompous, egoistic or conceited.\"\n\nDo you see any way this can go wrong?\n"}]}