{"crypto": [{"name": "Big Stuff", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/crypto/Big_Stuff/Big_Stuff.tar.gz"], "desc": "Studies show that 80% of adults face anxiety on seeing big and complicated matrices. So I have used big and complicated matrices to encrypt my flag!\n\nNote: Wrap your answer in Breach{<message>}\n\n    author: DarthVishnu\n"}, {"name": "GoGo Power Rangers", "desc": "My friend Alice thinks AES is secure. but you can't hide from physics. I painstakingly traced the first two rounds for many encryptions over the course of weeks. Can you use this knowledge to prove Alice Wrong?\n\n    author: Sayandeep Saha\n    contact: Aayush\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/crypto/GoGo_Power_Rangers/dist.zip"]}, {"name": "Taaffeite Encryption", "desc": "I heard that post-quantum cryptosystems are secure. So even your quantum computer can't break this one.\n\n    author: Nilabha Saha\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/crypto/Taaffeite_Encryption/Taaffeite_Encryption.tar.gz"]}, {"name": "Transfer into Oblivion", "desc": "I recently read of some secure methods to transfer data. Last time someone implemented them, they took small numbers; but I ensured I take large ones so my system is not vulnerable! My oblivious trasfer implementation is actually secure!\n\n    author: Nilabha Saha\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/crypto/Transfer_into_Oblivion/source.py"]}], "misc": [{"name": "Catering The Food", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/misc/Catering_The_Food/CTF-Cater_the_food.pdf"], "desc": "Embark on an extraordinary journey to etch your name in history as the most legendary caterer the world has ever known.\n\ninput: 99999 99999 99999\noutput: 173977761\n\n    author: DustOfSnow\n"}, {"name": "Mining Mania", "desc": "They said there needed to be a blockchain challenge in this CTF so we have created our own cryptocurrency. We call it THE ROOOOOOKK!!! (We just stole bitcoin's implementation, doesn't every coin do that?)\n\n    author: 4kk1\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/misc/Mining_Mania/bitcoin_sim_public.py"]}, {"name": "Mr Bean", "desc": "The artists of this masterpiece includes 2 CTF players who participated in a CTF competition 2 years back. Can you find the name of their team?\n\nFlag Format: Breach{teamnamewithoutspaces}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/misc/Mr_Bean/masterpiece.jpeg"]}, {"name": "On the Clock", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/misc/On_the_Clock/On_The_Clock.jpeg"], "desc": "A traveler named Alex paused to snap this photo during sunrise while en route to the airport. Known for always being on time, he was heading to catch a flight scheduled to arrive on 3rd April. Oddly, he always speaks fondly of October. Can you trace his journey from this one clue?\n\nFlag Format: Breach{originAirportCodeDestinationAirportCodeOperatorFlightNumber} (All uppercase airport codes, no spaces. Example: Breach{LAXJFKAA100})\n\n    author: Ratan\n"}, {"name": "Onions Make Me Cry", "desc": "I am sick of these onions. They taste horrible and also make you cry like wtf 😭😭😭 Then I started searching about onions and came across the onion router. Then I used the onion router to hire hitmen to kill all onions in the world. Now all onions that you eat are dead! I wanted to show my friends that I used the onion router but they don't believe me. Thankfully I was running wireshark while surfing tor. Can you help me pinpoint the ip addresses related to tor traffic? My source IP address was 10.53.6.158. So you don't have to include that.\n\nflag format: Breach{IP1 IP2 .... IPn} That is, space separated IPs in ascending lexicographic order wrt the fullstop. x1.x2.x3.x4 < y1.y2.y3.y4 iff x1 < y1 or (x1==y1 and x2 < y2) and so on.\n\n    author: 4kk1\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/misc/Onions_Make_Me_Cry/onion.pcapng.xz"]}, {"name": "Pyshell", "desc": "I have made a shell which runs completely in python. It is soo secure that the files created disappear the moment I exit it. Try to read the VERY SECURE flag in the shell.\n\n    author: rennaMAhcuS\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/misc/Pyshell/shell.py"]}], "pwn": [{"name": "FSWn3d", "desc": "Just a simple name checker... or is it? Enter your first and last name — and maybe a little more than that.\n\n    author: Aayush\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/pwn/FSWn3d/fswn3d.tar.gz"]}, {"name": "MagicVault", "desc": "A magical allocator guards the vault. Can you twist its spells and seize the hidden flag?\n\n    author: Aayush\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/pwn/MagicVault/magicvault.tar.gz"]}, {"name": "Vaultability", "desc": "A high-security vault system with a complex control interface… but is it truly secure?\nExplore its inner workings and see if you can break into the vault!\n\n    author: Aayush\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/pwn/Vaultability/vaultability.tar.gz"]}], "rev": [{"name": "Fraction Fun", "desc": "My friend has created a fun game to play with fractions. He wants a particular output from the game. Can you find the correct input and crack the puzzle!\n\n    author: Niral\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/rev/Fraction_Fun/fraction_fun.zip"]}, {"name": "NFT", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/rev/NFT/NFT.tar.gz"], "desc": "Kevin McCoy created the first NFT in 2014. The NFT was called \"Quantum\" and was created on the Namecoin blockchain. The NFT was a digital art piece that was sold for 1 BTC. The creation of \"Quantum\" marked the beginning of the NFT craze that has exploded in popularity in recent years. KevinMcCoy's creation of the first NFT has paved the way for artists, creators, and collectors to explore the possibilities of blockchain technology and digital art.\n\nKevin also created a secret vault to store his NFTs. The vault is a secure digital storage space that allows Kevin to store his NFTs safely and securely. The vault is protected by advanced encryption and security measures to ensure that Kevin's NFTs are safe from hackers and other threats. Kevin's vault is a testament to the importance of security and privacy in the world of NFTs.\n\nFlag format: Breach{.*}\n\n    author: DarthVishnu\n"}, {"name": "Snaeky", "desc": "Goddamn it!! I almost got to the GODLEVEL-HIGHSCORE in the game but collided with the stupid wall sticking out of the corner. There's a rumour that whoever gets to the highscore will be gifted with a special apple ... and also a test.\n\nFlag Format: Wrap your flag in Breach{<FLAG>}. FLAG must be all in uppercase\n\n    author: DarthVishnu\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/rev/Snaeky/snake.gb"]}, {"name": "Timothy", "desc": "In a land far far away there lived timothy. Dumb he may be, but he worked hard and quite nicely. Wanted to make create sommething unique and new. As he kept working on what was given to him, the complexity grew.\n\nTired, he never was. For you see... He did many a great things just from simplicity.\n\nBut all of the kings horses, and all of the king's men. Wanted to know what how Timothy's work began. And though I may be running out out words to make a rhyme... I hope you can undo his work with his friend Anthony's help and reveal what was lost to time.\n\n    author: Samanth\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/rev/Timothy/timothy.tar.gz"]}], "web": [{"name": "Framework Follies", "desc": "Modern full-stack frameworks are safe, right?\n\n    author: Geet\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/web/Framework_Follies/dist.zip"]}, {"name": "Snak ASM", "desc": "Sometimes, the real challenge is what’s hidden beneath the surface\n\n    author: Geet\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BreachCTF/2025/web/Snak_ASM/dist.zip"]}]}