{"boot2root": [{"name": "Cake Architect User", "desc": "Author: Quack\n\nWe've exhausted all possible ideas regarding baking recipes. Please help us design a new cake!\n\nThe user flag is in a file called user.txt.\n\nNote: The challenge may take a few minutes to start. Please be patient...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/boot2root/Cake_Architect_User/boot2root_cake-architect-user.zip"]}], "crypto": [{"name": "Cheesecake", "desc": "Difficulty: 🧀\nAuthor: Bond\n\nWhoever thought 💡 of mixing 👀 cheese 🧀 with cake 🧁 it sure is easy on the palate 😋\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Cheesecake/crypto_cheesecake.zip"]}, {"name": "Encrypted and Desperate", "desc": "Author: H4N5\n\nBrunnerne's Royal Court Baker is in a desperate situation. His computer was hit by a ransomware attack that encrypted all his professional brunsviger photos and secret recipes.\n\nThe attackers left behind a suspicious ransomware file - it might hold the key to unlock everything, but he doesn't dare touch it without your expert help!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Encrypted_and_Desperate/crypto_encrypted-and-desperate.zip"]}, {"name": "Half Baked", "desc": "Author: Nissen\n\nBoss wanted our cake webshop secured with RSA and said I should remember to use some good primes.\nNot sure what that means, but he specifically asked for 2, I guess to save money.\nSounded easy enough, but now the whole system feels a bit half-baked 😕\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Half_Baked/crypto_half-baked.zip"]}, {"name": "Peppernuts", "desc": "Difficulty: Easy-Medium\nAuthor: Bond\n\nNew to baking? 🥣🤷 Then start small!💡And it doesn't get much smaller than the traditional Danish Christmas cookie: The peppernut 🌰 🎅\n\nI know what you're thinking: Pepper? In a cookie?! Do they actually do that?!? Yes, yes we do - but just a small bit 😉 And that little kick is what makes them so good 😋\n\nSo give them a try, you might just find your new favorite recipe! 🥇\n\n(PS: Your favourite recipe is of course Brunner's recipe 😉)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Peppernuts/crypto_peppernuts.zip"]}, {"name": "Pretzel", "desc": "Difficulty: Very Hard\nAuthor: Bond\n\nWhat is a pretzel 🥨 but intersecting elliptic curves with salt 🧂?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Pretzel/crypto_pretzel.zip"]}, {"name": "Secret Brunner Recipe", "desc": "Difficulty: Medium-Hard\nAuthor: OddNorseman\n\nOur secret brunner recipe has been in the family for ages, but due to increased demand, we need to scale up our production. This means new supplies and larger batches, which requires tweaking the recipe. We don't have time ourselves, so we need your help.\n\nThere is just one thing... We don't want to share the secret recipe... Instead we have allowed you make tweaks without having to see the recipe itself - it's genius!\n\nWe also provided a way to ensure you don't accidentally add \"flødeskum\" (whipped cream) to the brunner - a despicable practice, no matter how many enjoy it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Secret_Brunner_Recipe/crypto_secret-brunner-recipe.zip"]}, {"name": "Shaken Not Stirred", "desc": "Difficulty: Beginner\nAuthor: Nissen\n\nAfter all that cake, I think it's time to sit back, relax, and have a drink 🍸 One vodka martini, please - shaken, not stirred of course!\n\n...Aw man, I just saw the bartender add something strange, I just wanted a good old classic. Wonder if I can demix it and get it out 🤔\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Shaken_Not_Stirred/crypto_shaken-not-stirred.zip"]}, {"name": "The Complicated Recipe", "desc": "Author: H4N5\n\nI am not very good with numbers, but when it comes to baking, there is no limit. However, I found this recipe, but I cannot read it. One of my colleagues (Master Baker Feistel) told me this was one of his, but he would not help me decipher it. He just laughed and said, \"DES is not for you to bake.\" I think he is foreign.\n\nI have heard him say that DES and even \"trois\" DES are no longer safe enough, but he mentioned that his recipe was S-DES encrypted, which I assume means Super-DES. This should be impossible to decrypt without the key - right?\n\nD1D74C5F5FDDD7ECD8B29ED8019DD801B7F2AB0128573FB2019D1C018FF2E001E7B7F2870128F28701ABF20112E0D8AB015957E79EA2\n"}, {"name": "The Cryptographic Kitcheni", "desc": "Author: H4N5\n\nOur brand new baker, ElGamal, has whipped up the most wonderful cheesecake you could ever imagine. Seriously, it's so good it might encrypt your taste buds.\n\nBut... there's a problem. One mysterious ingredient is missing from the recipe!\nCan you crack the code and figure out what ElGamal forgot to mix in?\n\nThe suspiciously scrambled recipe says this:\n\np  = 14912432766367177751\ng  = 2784687438861268863\nh  = 8201777436716393968\nc1 = 12279519522290406516\nc2 = 10734305369677133991\nThe flag is the recovered plaintext, wrapped in brunner{}.\nExample: If you found c4rr0t5, the flag should be submitted as brunner{c4rr0t5}.\n"}, {"name": "Whisk", "desc": "Difficulty: Beginner\nAuthor: rvsms\n\nSomeone tried sabotaging our operation by \"whisking” away the secret ingredient for the perfect brunsviger. All that's left on the workbench is this sticky note full of pastry-themed symbols and random letters.\n\nCan you help us recover the secret ingredient?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/Whisk/crypto_whisk.zip"]}, {"name": "pi crypt", "desc": "Author: Bond\n\nRecipe for 👨‍🍳 home made 😋 pie cipher:\n\n100 char printable base 🥞\n1k digits of pie 🥧\n2-3k of blueberry plain-texture 🫐\nAnd finally the key ingredient:\n\n1 flagon of secret sauce 🏺\nRecipe tip: For the best result, use English blueberry plain-texture with standard punctuation.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/crypto/pi_crypt/Unconfirmed%20984750.crdownload"]}], "forensic": [{"name": "Digging For Treasure", "desc": "Difficulty: Beginner\nAuthor: Emil8250\n\nLast night I was out in the darkest of forests, located on Funen, digging for treasure. Lo and behold, I found this mysterious envelope with a note attached: \"If you've found this by accident, please leave it where you found it. This is the best brunner recipe to ever be made, and the local baking-cartels have been looking for it, you'll be in great danger for possessing it.\"\n\nThe envelope contained a USB-drive. Naturally, I needed to do an autopsy on this incredible find and plugged it straight into my PC, but it seems like all the good stuff's missing?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/forensic/Digging_For_Treasure/forensics_digging-for-treasure.zip"]}, {"name": "DoughBot", "desc": "Difficulty: Beginner\nAuthor: rvsmvs\n\nOur state-of-the-art smart mixer, DoughBot, crashed during a routine kneading cycle. Luckily, a technician was monitoring the device over UART and captured the memory output just before the reboot.\n\nAnalyze the captured dump and see what the DoughBot was trying to say before it rebooted.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/forensic/DoughBot/forensics_doughbot.zip"]}, {"name": "Memory Loss", "desc": "Author: ha1fdan\n\nI had just finished baking a brunsviger when I suddenly remembered something important... but now I simply can't recall what it was! I'm pretty sure I took a picture of it, but where did I put it?\n\nhttps://shared-brunnerctf-2025.nbg1.your-objectstorage.com/files/forensics_memory-loss.7z\n\nPassword: VerySecurePasswordForMemoryLoss_BrunnerCTF2025\n"}, {"name": "New Order", "desc": "Author: OddNorseman\n\nI got this new order for my bakery, but now my computer is behaving a bit weird. Can you take a look?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/forensic/New_Order/forensics_new-order.zip"]}, {"name": "The Cinnamon Packet", "desc": "Author: H4N5\n\nThe SecOps team at 221B Baker Street detected strange traffic, someone was tunneling through the backup VLAN.\nThe packets had a weird rhythm, almost... alive.\nThen the realization hit: something had awakened the AI on the network.\nThey tossed their coffee and cinnamon rolls aside and began investigating.\n\nCan you find what the AI was piggybacking on the packets?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/forensic/The_Cinnamon_Packet/forensics_the-cinnamon-packet.zip"]}, {"name": "The Real Windows Experience", "desc": "Difficulty: Very Hard\nAuthor: OddNorseman\n\nI was trying to migrate away from all of that Microsoft stuff to try and regain independence for my bakery, and after our latest ransomware issues it seemed like the perfect opportunity - and Linux doesn't get malware!\n\nOnly problem is that I'm a bit too used to Windows - but my IT guy helped me out with something suuuuper similar. Unfortunately it seems a bit too similar and I've been ransomwared again... Can you help me?\n\nHint: If this challenge turned into very hard rev and you feel like everything was stripped away from you, you might have fallen short and relied too much on automatic tools in one of the forensics steps.\n\nPassword: VerySecurePasswordForTheRealWindowsExperience_BrunnerCTF2025\n\nhttps://shared-brunnerctf-2025.nbg1.your-objectstorage.com/files/forensics_the-real-windows-experience.7z\n\n"}, {"name": "The Secret Brunsviger", "desc": "Difficulty: Beginner\nAuthor: Ha1fdan\n\nI have intercepted encrypted HTTPS traffic from the secret brunsviger baking forum, but I need help decrypting it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/forensic/The_Secret_Brunsviger/forensics_the-secret-brunsviger.zip"]}, {"name": "VeryCheap", "desc": "Author: Nissen\n\nIn 2025, a new bakery chain called VeryCheap has taken Denmark by storm, selling their brunsviger at suspiciously low prices and driving independent bakeries out of business. But behind the sugary facade, something doesn't add up. They must be losing money with such low prices - and why are so many of their customers in suits?\n\nA recent police raid seized one of their office PCs. Your task: perform a full forensic analysis of the disk and find what VeryCheap is really hiding!\n\nhttps://shared-brunnerctf-2025.nbg1.your-objectstorage.com/files/forensics_VeryCheap.7z\n\nPassword: VerySecurePasswordForVeryCheap_BrunnerCTF2025\n"}], "misc": [{"name": "Bakerman", "desc": "Difficulty: Easy-Medium\nAuthor: H4N5\n\nOh no, the baker has been going around in his new sports car to deliver brunnere, but he has lost the recipe in the sports car somewhere, can you help find it? I think it's because he has been listening to music on the way\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Bakerman/misc_bakerman.zip"]}, {"name": "Based Brunner", "desc": "Difficulty: Beginner\nAuthor: Nissen\n\nBrunsviger is just so based, I think I could eat it in any form - from binary to decimal!\n\nTip: This might require a bit of programming, I would recommend looking into the int() function in Python.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Based_Brunner/misc_based-brunner.zip"]}, {"name": "Cake Constellation", "desc": "Author: DanishWizard\n\n\"High up in the skies\nwhere the truth lies\n\nLet your eyes seek past the clouds\nto discover what your heaven shrouds\n\nSeek the constellation, on 2025-08-24 12:26:3X UTC\"\n\nThis message along with a file was found mysteriously planted in our patent-pending Brunner-Radio-UHF-Node-Network-Extending-Rotor, or BRUNNER for short.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Cake_Constellation/misc_cake-constellation.zip"]}, {"name": "Cake Vault", "desc": "Author: OddNorseman\n\nI lost the password to my cake vault!!! I use that password to everything, so I need it back. I even use it for my flags! Can you help?\n\nAs a reward you can submit it with brunner{<password>} as format. Please decode the password from binary before submitting.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Cake_Vault/misc_cake-vault.zip"]}, {"name": "Im lost", "desc": "Author: H4N5\n\nIt started as Baking 101 - just a simple recipe. But then I heard the Bell and got distracted...\n\nOne slip in the kitchen and chaos followed. I spilled milk and flour all over the old terminal. It lit up like it hadn't in decades and started screaming in tones that haven't been heard since dial-up ruled the earth.\n\nNow the bits are everywhere, the terminal's rambling, and I've completely lost my direction.\n\nCan you help me clean up this digital mess and find the right path?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Im_lost/misc_i-m-lost.zip"]}, {"name": "Lua Tax Calculator", "desc": "Author: HLVM\n\nDOGER (Department of Gigantic Economic Regrets) has recently been busy trying to save money on the expensive tax calculations.\n\nTheir recently hired 14 year olds have found a platform with unlimited free compute and scalability. What's not to like? The tax calculations are now done in Lua, including access to the powerful math library.\n\nAnd don't worry, the 14 year olds are supervised by a 15 year old, who sandboxed the Lua environment.\n\nClick \"Start Challenge\" and calculate your taxes today:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Lua_Tax_Calculator/misc_lua-tax-calculator.zip"]}, {"name": "No Calls", "desc": "Author: Migsej\n\nThe chef's special cake needs to be delivered soon. He already showed you where it's stashed, but maybe you weren't paying attention.\n\nHis phone is dead, so no calls are going through. Can you find another way to reach him before it's too late? Tick-tock...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/No_Calls/misc_no-calls.zip"]}, {"name": "Pair Baking", "desc": "Difficulty: Medium-Hard\nAuthor: Victor4X\n\nThe master chefs have instructed you to once again bake for them, but there's a twist!\nOnly one of you will get to see the secret recipe, while the other delivers the finished product for judging!\n\nReady, Set, Bake!\n\nPlease note that the server won't have the same hardware specs as your local machine. Plan accordingly.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Pair_Baking/misc_pair-baking.zip"]}, {"name": "Pie Recipe", "desc": "Author: H4N5\n\nI found this pie recipe. It is simply named \"The Recipe of the Golden Phi\" by baker Zeckendorf. Can you help me figure out who made it?\n\n89|89.21|55.13.5.1|34.13.2|89.8.1|89.13.5.2|34.13.5.1|89.13.5.1|89.8.2|89.21|89.21.5|34.13.3.1|89.8|55.13|55.21.2|89.13|89.1|89.21.8.3.1|55.8.2|89.21.8.2|89.1|55.13|55.21.2|89.21.5.2|55.21.8.3.1|34.13.3.1|55.8.3|89.21.1|55.21.1|55.21.8.2|55.1|89.21.8.1|89.1|89.13.5.1|55.2|34.13.5.2|89.1|55.21.8.3|55.21.2|89.21.3.1|89.1|55.21.8.3|34.13.5.1|89.13.5|89.8.1|34.13.3.1|55.13.5.1|89.13.5.2|89.13|55.21.5|55.5.1|55.5.1\n"}, {"name": "Planesi", "desc": "Author: Quack\n\nMan I love planes! Everything is always in order!\nI just hope they don't byte...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/misc/Planesi/misc_planes.zip"]}, {"name": "The Great Mainframe Bake Off", "desc": "Difficulty: Beginner\nAuthor: H4N5\n\nIt's 1974. Deep inside the crusty vaults of CrumbTrust Bank, a covert team of COBOL developers and pastry chefs created a failsafe for their most prized possession: The Marzipan Reverse Recipe.\n\nThis sacred document was too valuable to be stored on paper. So, they did the unthinkable - they encoded it and buried it in the production mainframe under a fake batch job titled IEBCAKED. Only those with knowledge of both banking ops and baking science could ever retrieve it.\n\nYears later, the IEBCAKED job has mysteriously reappeared in the job output spool of an IBM z/OS LPAR. But what's left is a string of mysterious byte codes. It's clearly not hex, not ASCII... maybe something older... something only the graybeards of computing would recognize.\n\nCan you decipher the original recipe and unlock the secret to the perfect butterbyte tart?\n\nd0-85-97-89-83-85-d9-6d-85-a2-99-85-a5-85-d9-6d-95-81-97-89-a9-99-81-d4-6d-85-88-e3-6d-a2-c9-6d-a2-89-88-e3-6d-84-95-c1-6d-a2-85-94-81-99-c6-95-89-81-d4-6d-95-d6-6d-f0-f7-f9-f1-6d-85-88-e3-6d-95-c9-6d-84-85-a2-e4-6d-a2-81-e6-6d-c3-c9-c4-c3-c2-c5-c0-99-85-95-95-a4-99-82\n"}, {"name": "The Yeast Key", "desc": "Author: H4N5\n\nMany years ago, the legendary baker Lionel Poilâne entrusted us with his original sourdough recipe. It's been locked away in the Vault ever since.\n\nOnly Poilâne knew the passphrase, and now he's gone. The only clue left behind? A strand of synthetic DNA extracted from his prized baker's yeast.\n\nCan you decode the DNA and recover the vault key? The DNA is:\n\nCGAGCTAGCTCCCGTGCGTGCGCCCTAGCTGTATACCGGCATAACGTGATATCGTACCTTCTAAATAACGGCATACATCACGTGATATCCTTCGTCATCAATCCATCTATATCTAGCCTTATAACGCGCCTTATCCATAACTCCCTAGCGCAATAACTCCATCGCGGACCTTCTAAATCAATCCATCCCTAACGGACTAGATCAATCCATATCCTTATACATCCCCTTCGATCTAGATAAATACATCCATCCATCACGTGATCTCCCGATCACTCCATACATCTAGACATGCATATCTTC\n"}], "mobile": [{"name": "BakeDown", "desc": "Mobile\nDifficulty: Beginner\nAuthor: KyootyBella\n\nI just shipped the very first build of my BakeDown app. I haven't done much with it yet, but I did pack it with a few nice resources already.\n\nTry loading it onto your phone or an emulator to try it out!\n\nOh and btw, did you know an APK is just a ZIP file with assembled Java code and resources like strings, fonts, and images? I heard apktool might be a good tool for decoding the contents!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/mobile/BakeDown/mobile_bakedown.zip"]}, {"name": "Brod and Co.", "desc": "Author: KyootyBella\n\nBrød & Co. just released their new ordering app, but their prices are a bit high. If only I had a coupon code...\n\nNote: The app sometimes crashes when clicking \"Place Order\". If this happens, try again or try another approach.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/mobile/Brod_and_Co./mobile_brod-and-co.zip"]}, {"name": "FridayCake", "desc": "Author: KyootyBella\n\nIt's Friday - your family cake night! 🍰 But when you try to order your favorite cake, you find that someone has changed the app and locked the ordering screen!\n\nRecover the Secret Access Code and save the family's cake tradition.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/mobile/FridayCake/mobile_fridaycake.zip"]}, {"name": "RivalCakes", "desc": "Author: KyootyBella\n\nThe secret Brunner and Othello cults are waging their battles in the streets of Denmark.\n\nOne day, you see a member of the Othello cult drop their phone out of their pocket. You grab it, but it seems to be a burner phone. You find only two custom apps, but when opening one, it instantly deletes itself - maybe there is still some data left?\n\nIn the cake cults, preferences matter - so keep an eye out and mind what you say.\n\nYour Othello rivals are planning a secret meetup, find out where and find the password to infiltrate them!\n\nFlag format: The flag is formatted as brunner{<w3w_code>_<password>}, where <w3w_code> is the what3words code of the location, without leading slashes. Make sure your \"3 word address language\" is set to English.\n\nExample: brunner{candy.magnetic.label_hunter2}\n\nPassword: VerySecurePasswordForRivalCakes_BrunnerCTF2025\n\nhttps://shared-brunnerctf-2025.nbg1.your-objectstorage.com/files/mobile_rivalcakes.7z\n\n"}], "osint": [{"name": "Scandinavia and the World", "desc": "Author: Nissen\n\nEverybody in Denmark agrees that the rest of Scandinavia are basically just sillier-sounding Danes - and we're definitely not just still salty about Sweden ditching the Kalmar Union in 1523 and Norway in 1814 (shoutout Kalmarunionen), leaving us with no oil and no mountains.\n\nSo this summer we went north, behind enemy lines, to take it all back. But distracted by all our delicious Danish pastries and snacks (okay, maybe it was Kvikk Lunsj), we forgot to follow the red markings on our trail. We can still see our cabin but have no clue how to get there - can you help us find our way?\n\nThe flag is the cabin's Google Plus Code when clicked on in Google Maps (without city and country), wrapped in brunner{}.\n\nExample: brunner{9C8J+R75}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/osint/Scandinavia_and_the_World/osint_scandinavia-and-the-world.zip"]}, {"name": "There Is a Lovely Land", "desc": "Author: Toxicd\n\nThe Danish national anthem is called \"Der er et yndigt land\" (\"There Is a Lovely Land\"), and I fully agree.\n\nA friend of mine took this picture, but I don't know the name of the bridge! Please help me find it so I can go see it!\n\nFlag format: brunner{<bridge name in Danish in lowercase>}\n\nExample: brunner{storebæltsbroen}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/osint/There_Is_a_Lovely_Land/osint_there-is-a-lovely-land.zip"]}, {"name": "Traditional Cake", "desc": "Author: OddNorseman\n\nI tried this amazing traditional cake at this amazing place I visited... but now I don't remember what it was called and where I was. All I have is this picture I took some time before.\n\nCan you help me find the exact spot I took the image from, so I can try to retrace my steps?\n\nFlag format: Use what3words to find the 3-word code for the location (without leading slashes) and wrap in brunner{}.\nSo, if the location found has code apricot.surfer.uses, the flag would be brunner{apricot.surfer.uses}.\n\nNote: Make sure \"3 word address language\" is set to English in your what3words settings to get the right code.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/osint/Traditional_Cake/osint_traditional-cake.zip"]}, {"name": "Train Mania", "desc": "Author: Quack\n\nI recently stumpled upon this cool train! But I'd like to know a bit more about it... Can you please tell me the operating company, model number and its maximum service speed (km/h in regular traffic)?\n\nThe flag format is brunner{OPERATOR-MODELNUMBER-SERVICESPEED}.\nSo if the operator you have found is DSB, the model number RB1, and the maximum service speed is 173 km/h, the flag would be brunner{DSB-RB1-173}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/osint/Train_Mania/osint_train-mania.zip"]}], "pwn": [{"name": "Dat Overflow Dough", "desc": "Difficulty: Beginner\nAuthor: 0xjeppe\n\nOur new intern has only coded in memory safe languages, but we're trying to optimize, so he has been tasked with re-writing our dough recipe-application in C!\n\nHe sent his code to our senior dev for review who added some comments in the code. Upon receiving the reviewed code, the intern accidentally pushed it to production instead of fixing anything.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/Dat_Overflow_Dough/Unconfirmed%20153310.crdownload"]}, {"name": "Obligatory Heap Pwn", "desc": "Author: Anakin\n\nAAAaaaahhh - another CTF, another heap pwn! You know the drill: malloc, free and the usual tricks. But this node editor is acting kinda sus.... - wait where's the heap tho?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/Obligatory_Heap_Pwn/pwn_obligatory-heap-pwn.zip"]}, {"name": "Online Cake Flavour Shop", "desc": "Difficulty: Beginner\nAuthor: olexmeister\n\nBrunnerne made an online flavour shop! Your wildest dreams can be fulfilled, it's actually hard to WRAP your head AROUND how amazing this software is!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/Online_Cake_Flavour_Shop/pwn_online-cake-flavour-shop.zip"]}, {"name": "Othello Villains", "desc": "Author: olexmeister\n\nThe Othello villains stole our sacred Brunner recipe! Luckily, they are unable to write secure code, please retrieve the recipe from their (in)secure vault!\n\nThis challenge is a good next step after solving beginner challenge Dat Overflow Dough!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/Othello_Villains/pwn_othello-villains.zip"]}, {"name": "Recipe Storage", "desc": "Author: Zopazz\n\nWe at Brunnerne take our recipes very seriously. We have therefore developed this cutting edge piece of software, called the brunner recipe storage system. It is totally safe, because we only store your things in memory! We can therefore not save them between reboots, and our recipes are forever safe!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/Recipe_Storage/pwn_recipe-storage.zip"]}, {"name": "Shortcake QL", "desc": "Difficulty: Insane\nAuthor: Zopazz\n\nThe query language with the brand new chemically created fts3_tokenizer frosting. The main formula is pretty old and well tested, so I think baking it should be pretty lite work.\n\nI've put up an instance for you to test the recipe, hopefully it won't take forever to test as I need it in 1 day.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/Shortcake_QL/pwn_shortcake-ql.zip"]}, {"name": "The Ingredient Shop", "desc": "Author: Migsej\n\nBrunnerne buys their ingredients from a very sketchy shop. I think they may have included an extra function by mistake.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/The_Ingredient_Shop/pwn_the-ingredient-shop.zip"]}, {"name": "The Ingredient Shops Revenge", "desc": "Author: Zopazz & Migsej\n\nThe ingredient shop figured out their mistake with the extra function and have removed it.\n\nBut isn't it still hackable?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/pwn/The_Ingredient_Shops_Revenge/pwn_the-ingredient-shop-s-revenge.zip"]}], "rev": [{"name": "Bake and Forth", "desc": "Author: Nissen\n\nI always sing my favourite Nik & Jay song \"Hot\" while baking, it definitely makes the oven heat up faster 🔥 🧑‍🍳\n\nLet me see you bake back and forth\nFrom side to side\nLet me see you bake up and down\nCome on, don't stop...\n\nWait, but I forgot to add my secret ingredient! 🍞 Hmm, what was it again...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Bake_and_Forth/rev_bake-and-forth.zip"]}, {"name": "Bake to the Future", "desc": "Difficulty: Very Hard\nAuthor: Nissen\n\nMarty! Great Scott! I finally managed to reverse the encryption for the secret brunner recipe, but I forgot it in the future when I came back to tell you about it!\nYou HAVE to retrace my steps and go back to the future - it's life or death, Marty! Take the DeLorean and the encrypted recipe!\n\n⚠️ BEWARE: Here be dragons crypto ⚠️\n\nNOTE: This is part 2 in the series. Start by solving Bake and Forth, it is based on the same principles, but significantly easier.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Bake_to_the_Future/rev_bake-to-the-future.zip"]}, {"name": "Baker Brian", "desc": "Difficulty: Beginner\nAuthor: Nissen\n\nBaker Brian says he has a plan to make him super rich, but he refuses to share any details 😠 Can you access his Cake Vault where he keeps all his business secrets?\n\nInfo: The challenge has both a file download and a server to connect to. Please click \"Start Challenge\" below and wait a minute for your team's challenge instance to start, then connect to the server from a terminal with the command that appears.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Baker_Brian/rev_baker-brian.zip"]}, {"name": "Bakeware", "desc": "Difficulty: Medium-Hard\nAuthor: Quack\n\nGrandma had her secret family recipe stolen! All she has left now is a weird and rusty file. Please figure out what happened to the recipe, so we can get back to baking!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Bakeware/rev_bakeware.zip"]}, {"name": "Grandmas Predictable Cookies", "desc": "Difficulty: Easy-Medium\nAuthor: H4N5\n\nGrandma encrypted her secret cookie recipe using her \"special ingredient\" a random number generator seeded with the exact time she baked it.\n\nShe thought it was uncrackable. But little did she know: Using the same oven clock every time makes your cookies easy to reverse-engineer.\n\nCan you recover her delicious secret?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Grandmas_Predictable_Cookies/rev_grandma-s-predictable-cookies.zip"]}, {"name": "Rolling Pin", "desc": "Difficulty: Beginner\nAuthor: rvsmvs\n\nThe head baker's gone rogue and locked up the recipe for the perfect pastry swirl inside a secret code. Can you knead your way through layers of fluffy obfuscation and figure out the exact mix of bytes to make it rise just right?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Rolling_Pin/rev_rolling-pin.zip"]}, {"name": "Textopolis", "desc": "Difficulty: Beginner\nAuthor: Quack\n\nI just heard of this brand new city! 🏙️\nTextopolis? 🤔\nIt sounds quite cool 😎\nI want to move there! ✈️\n\nIt might be useful to send a spy before attempting to enter the city!\n\nThis challenge may not work fully with WSL, if you choose to run it, please use Powershell.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Textopolis/rev_textopolis.zip"]}, {"name": "Timing is Everything", "desc": "Author: ha1fdan\n\nThe local Brunner baker is famous for his perfectly baked cakes - not too soft, not too crispy. But ever since his timer broke, he's been relying on an ancient encrypted recipe vault that only unlocks when the correct timing is entered.\n\nUnfortunately, the baker forgot how the vault works. All he remembers is that \"time is the key\" and that it once revealed the secret ingredient for the ultimate cake.\n\nCan you figure out how long his cakes need to bake... and recover the secret?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Timing_is_Everything/rev_timing-is-everything.zip"]}, {"name": "Trippi Troppa Chaos", "desc": "Author: ha1fdan\n\nThe baker got infected with Italian brainrot and obfuscated our flag encoder with memes and nested functions. Can you help us find our flag?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Trippi_Troppa_Chaos/rev_trippi-troppa-chaos.zip"]}, {"name": "Un Pirateable Baking Game", "desc": "Author: OddNorseman\n\nI made a new video game inspired by my favorite YouTuber! It's amazing! But you need a license key to play it, and I haven't set up the webshop yet...\nSomething with Steam isn't working quite right yet either, so I've removed it for now. But at least the DRM is Un-piratable, so you have to wait to try it 😄\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Un_Pirateable_Baking_Game/rev_un-pirateable-baking-game.zip"]}, {"name": "Un Pirateable Baking Game 2", "desc": "Author: OddNorseman\n\nWhat! That shouldn't be possible!!!! But I have an idea to make it much harder to pirate - same game, but good luck using your tricks now!\n\nOh, I also got the Steam part working btw... Ish...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/rev/Un_Pirateable_Baking_Game_2/rev_un-pirateable-baking-game-2.zip"]}], "steg": [{"name": "TheBakingCase", "desc": "Misc Steganography\nDifficulty: Beginner\nAuthor: H4N5\n\nI hid a message for you here, see if you can find it! Take it slow, little by little, bit by bit.\n\ni UseD to coDE liKe A sLEEp-dEprIVed SqUirRel smasHInG keYs HOPinG BugS would dISApPear THrOugh fEAr tHeN i sPilled cOFfeE On mY LaPTop sCReameD iNTerNALly And bakeD BanaNa bREAd oUt oF PAnIc TuRNs OUT doUGh IS EasIEr tO dEbUG ThaN jaVASCrIPt Now I whIsPeR SWEEt NOtHIngs TO sOurDoUGh StARtERs aNd ThReATEN CrOissaNts IF they DoN'T rIsE My OVeN haS fEWeR CRasHEs tHAN mY oLD DEV sErvER aNd WHeN THInGS BurN i jUSt cAlL iT cARAMElIzEd FeatUReS no moRE meetInGS ThAt coUlD HAVE bEeN emailS JUst MufFInS THAt COulD HAvE BEen CupCAkes i OnCE tRIeD tO GiT PuSh MY cInnAmON rOLLs aND paNICkED WHEn I coUldn't reVErt ThEm NOw i liVe IN PeaCE uNLESs tHe yEast getS IDeas abOVe iTs StATion oR a COOkiE TrIES To sEgfAult my toOTH FILlings\n"}], "web": [{"name": "ArrayVM", "desc": "Author: Victor4X\n\nOne of our intern chefs is working on their own programming language based on array indexing and has decided to implement it in JavaScript.\nPlease figure out whether or not that was a good idea.\n\nHint: No matter how sane the implementation, JavaScript always finds a way to mess you up.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/web/ArrayVM/web_arrayvm.zip"]}, {"name": "CakeChat", "desc": "Difficulty: Very Hard\nAuthor: OddNorseman\n\nI made this new chat app to talk about cake! Hope it's secure enough that you don't get my flag :D\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/web/CakeChat/web_cakechat.zip"]}, {"name": "EPIC CAKE BATTLES OF HISTORY", "desc": "Author: Emil8250\n\nAfter all this time, it's finally time to figure out which cake is best: BRUNSVIGER VS. OTHELLO! BEGIN!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/web/EPIC_CAKE_BATTLES_OF_HISTORY/web_epic-cake-battles.zip"]}, {"name": "Recipe for Disaster", "desc": "Difficulty: Medium-Hard\nAuthor: Toxicd\n\nThe small town of Bruncity is famous for its sweet, sticky Brunsviger. At the local bakery, a brand new system has been set up to keep track of recipes and export them for the hungry townsfolk. But the oven seems to behave strangely.\n\nThe head baker swears something isn't quite right with the way it works. If you poke around long enough, perhaps you'll discover the bakery's secret ingredient...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/web/Recipe_for_Disaster/web_recipe-for-disaster.zip"]}, {"name": "Single Slice Of CakeNews", "desc": "Difficulty: Medium-Hard\nAuthor: 0xjeppe\n\n\"Brunnerne\" has recently acquired the hugely popular website CakeNews.ctf in an effort to expand their empire. Brunnerne has multiple companies and websites under its umbrella, and they all utilize the same single sign on-portal for authentication: BrunnerneLogin.ctf.\n\nIn connection with the acquisition, CakeNews.ctf had to overhaul its login and registration flow to hook into Brunnernelogin.ctf. Authentication is now handled entirely by the SSO, but CakeNews keeps its own user table for site-specific data like usernames.\n\nThe developers of CakeNews had to implement this new registration system in a rush!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/web/Single_Slice_Of_CakeNews/web_single-slice-of-cakenews.zip"]}, {"name": "The Cake Warehouse", "desc": "Author: Quack\n\nWe've recently been having issues with some deliveries in our delivery system. Can you get to the bottom of this?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/web/The_Cake_Warehouse/web_the-cake-warehouse.zip"]}, {"name": "Waffles", "desc": "Difficulty: Very hard\nAuthor: OddNorseman\n\nI have vibecoded a nice webshop for my electronics shop, but someone told me that vibecoding is not safe. Instead I asked ChatGPT to help me. It said something about some WAFF? WAF? Idk, but now I'm hungry for waffles.\n\nAnyway, now it should be so safe that I can even share the source for my app!\n\nNote: The app loads quite slowly. Avoid reloading the page too often as it is rate limited and slow.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BrunnerCTF/2025/web/Waffles/web_waffles.zip"]}]}