{"cloud": [{"name": "AMI Not Worthy A story of Baburao", "desc": "Baburao was an AWS Administrator who spent most of his time staring outside the office window in downtown Frankfurt and wondering \"am i not worthy?\". He hated his job. His only way out was to quit and move on to a different organization that would perhaps let him spread his wings and fly into the clouds.\n\nSo, one day he moved all his sensitive information to an AMI, changed the permission to public and left, so that he could extract the contents later, from his new office across the city. He thought this would not raise any red flags, oh but he thought wrong, didn't he?\n\nCan you find the AMI and check what was the data Hoffman was planning to steal?\n\nNote: The flag format for this challenge is BMCTF{flag}\n\nAuthor: @0xCriminal\n"}, {"name": "A bucket load of Samosa", "desc": "NaughtyDev is launching a new product called ‘Naughtyide’.\n\nThe admins of 'Naughtyide' like to use a lot of AWS services, their favorite being Amazon S3.\n\nHowever, they are very bad at security. There is news in the underground that someone has leaked some sensitive files into an S3 bucket but have poorly configured it making it available to the public.\n\nJust some additional info, last week two buckets were discovered called 'admin.naughtyide' and 'hr.naughtyide'.\n\nNote: Use this custom dictionary stolen from their servers to find the bucket and the flag file. You may have to edit the dictionary to align with the company's naming convention as shown above! Also the flag format for this challenge is BMCTF{flag}\n\nhttps://naughtydev-company-files.s3.eu-central-1.amazonaws.com/naughtydev-bucketnames.txt\n\nAuthor: @0xcriminal\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/cloud/A_bucket_load_of_Samosa/naughtydev-bucketnames.txt"]}], "forensic": [{"name": "Find Me", "desc": "DNS Queries FTW!!!\n\nAuthor: @wh1t3r0se\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/forensic/Find_Me/fiNd_mE.pcapng.xz"]}, {"name": "ManyDoc", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/forensic/ManyDoc/ManyDoc.zip"], "desc": "On the hacker forum, people were just sharing random documents but it does not make any sense. Can you analyse those files to figure out what they were talking about.\n\nNote: Flag format for this challenge will be BSidesMumbai{flag}\n\nAuthor: @warl0ck_wraith\n"}, {"name": "Rabbit Holes", "desc": "Just rabbit holes sticked everywhere!\n\nhttps://drive.google.com/file/d/1RRHkednweRirJg319hKVjc64eRF1YUVC/view\n\nNote: Flag format for this challenge will be BSidesMumbai{flag}\n\nAuthor: @warl0ck_wraith\n"}, {"name": "Simply Foxed", "desc": "From the files in the last challenge, law enforcement agencies captured a criminal named “hacker” on the forum. Now you are tasked with exploring his computer for evidences.\n\nThere are rumors that he was a fox lover.\n\nhttps://drive.google.com/file/d/16rfmYxMgwjd98ttkMlWKpoWhUX-u5UIp/view?usp=sharing\n\nNote: Flag format for this challenge will be BSidesMumbai{flag}\n\nAuthor: @warl0ck_wraith\n"}], "misc": [{"name": "Data Breach", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/misc/Data_Breach/Data_Breach_Files.zip"], "desc": "ABC Pvt. Ltd. recently conducted an investigation against one of its employees and discovered that the individual was an insider threat, stealing classified company data. Now, the organization seeks assistance in recovering this stolen classified data.\n\nAuthor: @TheLittleMermaid\n"}, {"name": "Locked Out", "desc": "Some 86 ransomeware encrypted my bash cant open my terminal :(\n\nAuthor: @wh1t3r0se\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/misc/Locked_Out/bash.enc"]}, {"name": "Potential APT", "desc": "Recently, the Threat Intelligence (Threat Intel) team detected a security breach in our network. The initial investigation revealed that a malicious actor had gained unauthorized access to our systems and exfiltrated sensitive data. Prompt action by another team led to the recovery of some of the stolen data. However, it is crucial to assess the full impact of this breach on our organization. Your task is to conduct a comprehensive impact assessment of the data breach to identify what data has been compromised\n\nAuthor:@TheLittleMermaid\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/misc/Potential_APT/infiltrated_data.zip"]}, {"name": "Shadow Realm", "desc": "Recently, the Security Operations Center (SOC) team detected a security breach in our network. The initial investigation revealed that a malicious actor had gained unauthorized access to our systems and exfiltrated sensitive data. Prompt action by another team led to the recovery of some of the stolen data. However, it is crucial to assess the full impact of this breach on our organization. Your task is to conduct a comprehensive impact assessment of the data breach to identify what data has been stolen\n\nAuthor:@TheLittleMermaid\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/misc/Shadow_Realm/shadow_realm.zip"]}, {"name": "Vadapaooo", "desc": "Mumbaikars!!!! Vada pao has hidden message for you!!!\n\nAuthor: @TheLittleMermaid\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/misc/Vadapaooo/vadapaoooo.zip"]}], "mobile": [{"name": "Conundrum", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/mobile/Conundrum/Login_Bypass.zip"], "desc": "As per your preference navigate the application to bypass the login.\n\nAuthor: @amateur_2light\n"}, {"name": "Modded Game with Backdoor", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/mobile/Modded_Game_with_Backdoor/Flappy_Bird_Mod.zip"], "desc": "A modded world where darkness seeks to take its flight. Within the code, a secret whispers without sound, A backdoor lurking, sending data far beyond.\n\nAuthor:@amateur_2light\n"}], "pwn": [{"name": "Jail Shell", "desc": "May the code be with you!!!\n\nAuthor: @wh1t3r0se\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/BSidesMumbai/2024/pwn/Jail_Shell/jail.py"]}]}