{"challenges": [{"name": "ASIv2", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/ASIv2/ASIv2.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/ASIv2/output.txt"], "desc": "Billionaire corporations like ASIv2 are constantly testing the limits by employing seemingly simple cryptosystems to safeguard their secret financial transactions, demonstrating that even in a world of advanced technology, sometimes simplicity can be the key to security.\n"}, {"name": "Barak", "desc": "In a display of uncanny brilliance, Barak effortlessly unraveled the perplexing web of a bizarre elliptic curve cryptography system, leaving even the most seasoned cryptographers in awe of his formidable talent.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Barak/barak.sage", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Barak/output.txt"]}, {"name": "Bertrand", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Bertrand/Bertrand.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Bertrand/enc.png"], "desc": "Bertrand stands tall as the epitome of security, safeguarding images with an impenetrable fortress of encryption that leaves no room for compromise.\n"}, {"name": "Big", "desc": "Finding identity in cryptographic schemas involves deciphering the big complex web of encoded information, unveiling the unique digital signatures and verifiable credentials that authenticate individuals, ensuring privacy, security, and trust in the interconnected world of digital interactions.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Big/big.sage", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Big/output.txt"]}, {"name": "Blobfish", "desc": "Hidden within the depths, where darkness prevails, the enigmatic blobfish guards a secret deep within its womb—an elusive and mysterious material that intrigues the curious minds of scientists and explorers alike.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Blobfish/blobfish.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Blobfish/flag.zip"]}, {"name": "Blue Office", "desc": "The Blue Office's ingenious cipher, meticulously crafted for the prestigious CCTF, became an impenetrable enigma that left even the most seasoned cryptanalysts baffled.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Blue_Office/blue_office.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Blue_Office/output.txt"]}, {"name": "Derik", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Derik/Derik.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Derik/output.txt"], "desc": "Detective Derik possessed an uncanny ability to unravel complex puzzles, his razor-sharp mind weaving through the intricate threads of mystery with effortless precision.\n"}, {"name": "Did it", "desc": "Finding the intersection among subsets can sometimes be a challenging endeavor, as it requires meticulous comparison and analysis of overlapping elements within each set. But she did it! Try doing it yourself too.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Did_it/did.py"]}, {"name": "Insights", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Insights/Insights.sage", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Insights/output.txt"], "desc": "Boundary attacks on RSA involve manipulating the input values at specific boundaries to exploit vulnerabilities in the encryption system's implementation. As one of the most widely used encryption systems, RSA provides insights into secure communications through its reliance on the difficulty of factoring large prime numbers. However, it is crucial to implement RSA correctly with robust key management and secure implementations to ensure its effectiveness in protecting sensitive information.\n"}, {"name": "Keymoted", "desc": "Combining RSA and ECC in a cryptographic system does not necessarily guarantee security equivalent to that of the individual RSA or ECC systems. What about keymoted\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Keymoted/keymoted.sage", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Keymoted/output.txt"]}, {"name": "Marjan", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Marjan/Marjan.sage"], "desc": "Marjan in the Persian Gulf shines as a mesmerizing enigma, an aquatic symphony of colors and movements, dancing with grace and elegance, encapsulating the essence of nature's most sophisticated cryptographic marvels.\n"}, {"name": "Resuction", "desc": "Handmade and artificial resuction cryptosystems represent contrasting approaches to encryption: while handmade systems emphasize the meticulous craftsmanship and personalization of cryptographic algorithms, artificial resuction systems rely on machine-generated algorithms that are optimized through computational techniques.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Resuction/output.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Resuction/resuction.py"]}, {"name": "Risk", "desc": "Despite its widespread usage, the RSA encryption system may not be deemed secure enough for high potential risk situations due to emerging advancements in quantum computing that could potentially break its underlying mathematical principles.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Risk/output.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Risk/risk.py"]}, {"name": "Roldy", "desc": "Roldy, once regarded as a reliable cryptosystem library, has unfortunately emerged as one of the most vulnerable and compromised systems in recent times, leaving users exposed to significant security risks.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Roldy/Roldy.py"]}, {"name": "Shevid", "desc": "Cryptographers, affectionately known as Shevids, have a profound fascination for CTFs, fueled by their insatiable appetite for tasks that feature small, optimized, and non-redundant code. These Shevids relish the opportunity to showcase their prowess in crafting elegant and efficient cryptographic solutions, making them invaluable assets in the world of cybersecurity challenges.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Shevid/output.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Shevid/shevid.sage"]}, {"name": "Slowsum", "desc": "Slowsum stands as the pinnacle of sophistication within the prover and verifier ecosystem, its intricate protocols meticulously designed to ensure accuracy and security while prioritizing efficiency and reliability.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Slowsum/slowsum.sage"]}, {"name": "Suction", "desc": "The easy suction cryptosystem is designed with a primary focus on simplicity and user-friendliness, employing streamlined algorithms that make encryption straightforward and accessible even for individuals without extensive technical knowledge.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Suction/output.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Suction/suction.py"]}, {"name": "Trex", "desc": "The study of Diophantine equations over trex can be significantly more challenging than over the real numbers.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Trex/trex.py"]}, {"name": "Vinefruit", "desc": "As I immersed myself in solving intricate cryptographic puzzles, the delightful crunch of vinefruit provided a perfect balance to the mental challenge, its juicy sweetness enhancing my focus and turning each bite into a flavorful reward.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Crypto/2023/Vinefruit/vinefruit.py"]}]}