{"crypto": [{"name": "Flag Service", "desc": "Kerberos is a widely used authentication protocol, especially in corporate networks. While theoretically secure, many weaknesses have been found in its implementations.\n\nThis challenge implements a simple authentication protocol that is inspired by Kerberos. Good luck breaking it!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/crypto/Flag_Service/flag-service.zip"]}, {"name": "Intro Crypto 1", "desc": "What is this non(c/s)ence everyonce is taking about?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/crypto/Intro_Crypto_1/intro-crypto-1.zip"]}, {"name": "Intro Crypto 2", "desc": "If you give a user some data and read it from the user later (e.g. when using cookies), you have to ensure the user has not tampered with it.\n\nThis challenge implements a simple, but insecure MAC scheme.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/crypto/Intro_Crypto_2/intro-crypto-2.zip"]}, {"name": "Intro Crypto 3", "desc": "Just guess the flag. If you don't, it makes me sat.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/crypto/Intro_Crypto_3/intro-crypto-3.zip"]}, {"name": "zero anonymity", "desc": "If only you had seen this coming...\n\nAfter all, you were one of the pioneers that built cutting edge cryptography... made zero knowledge proofs practical!\n\nBut then the government turned those beautiful proofs against you. They built this horrendous system where every person first needs to authenticate themselves before they can connect to the Internet. And of course the government sits conveniently in the middle and watches everyone's traffic.\n\nThe worst of it all is that they're using your zk-SNARKs: every user authentication is a zero knowledge proof of the user's identity. Of course, they claim their system is super privacy preserving because nobody ever sends their secrets in network requests. But of course the government, which issues identities to people, knows exactly which hash maps to which user...\n\nBut there's one sliver of hope! Your buddy Mike built was the poor soul that the government forced to build this system. Your almost certain that he sneaked in a backdoor.\n\nUnfortunately, Mike vanished before you could talk with him. Maybe he's in one of the labor camps to produce LLM training data. Or worse, he might not be producing any data at all anymore...\n\nAll the more important that you recover his backdoor and break free from this Orwellian surveillance!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/crypto/zero_anonymity/zero-anonymity.zip"]}], "forensic": [{"name": "Intro Forensics 1", "desc": "First we will learn a little bit about Wireshark. For the beginning just start play around with Wireshark and their filters, look into the protocols and getting familar with the tool. Besides Reverse Engineering skills, recording the network traffic is an important part in the analysis of malware.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/forensic/Intro_Forensics_1/intro-forensics-1.zip"]}, {"name": "Intro Forensics 2", "desc": "We were able to capture a hidden service. Could you recover the secret order?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/forensic/Intro_Forensics_2/intro-forensics-2.zip"]}, {"name": "Intro Forensics 3", "desc": "There is a new variant of a ransomware, messing up my image files. Somebody told me a vital part of forensics is to understand files. Could you help me to recover my image file?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/forensic/Intro_Forensics_3/intro-forensics-3.zip"]}], "misc": [{"name": "Nokia is calling", "desc": "So you have a very security-concerned friend who does not like any smartphones and only uses his original Nokia phone. He constantly receives some secret SMS, but you've never figured out what he got, as when he showed you his messages, no new texts were there. One day, you decide to whip out our old HackRF and sniff all GSM traffic until your friend receives another SMS. After some fiddling with the signals, you recover three SMS messages, which you'll find attached. Can you extract the secret message sent to your friend?\n\nFlagformat: string which has to be put in dach2025{<string>}\nCompetition\n\nAuthors\nexplo1t\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/misc/Nokia_is_calling/nokia.zip"]}], "pwn": [{"name": "Intro to PWN 1", "desc": "This used to be a simple pwn challenge. But someone patched it and the win function doesn't print the flag anymore, can you still get it? If this is the first time doing binary exploitation, this challenge might feel a bit overwhelming. But don't worry, I have attached the first challenge from last year and a README for it. If you solve that one, you should be able to solve this one as well with a bit of tinkering. If you feel stuck, feel free to ask for help in the discord server.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/pwn/Intro_to_PWN_1/intro-pwn-1.zip"]}, {"name": "Intro to PWN 2", "desc": "Format strings are a powerful tool in the hands of a hacker. They can be used to read and write memory, and even execute code. This challenge is a simple demonstration of how format strings can be used to write memory. Can you use it to get the flag?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/pwn/Intro_to_PWN_2/intro-pwn-2.zip"]}, {"name": "Intro to PWN 3", "desc": "You like puzzles? Great, we do as well! Puzzle the ROP chain to spawn a shell!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/pwn/Intro_to_PWN_3/intro-pwn-3.zip"]}, {"name": "TUNichtgut", "desc": "TUNichtgut, das erste VPN mit Vollbitverschlüsselung.\n\nYou managed to get into a position to intercept traffic from this shady VPN service. Can you grab the flag from the user's computer?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/pwn/TUNichtgut/tunichtgut.zip"]}], "rev": [{"name": "GRID WAVE", "desc": "Word’s been going around about an old piece of anti-system tech. No one's laid a hand on it in decades, but I got the specs.\n\n    the flag format is dach2025{...}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/rev/GRID_WAVE/grid-wave.zip"]}, {"name": "Intro Reverse Engineering 1", "desc": "Let's have a gentle introduction to reverse engineering x86_64 binaries on Linux. You can find a detailed writeup with many basics and solutions to this challenge attached :)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/rev/Intro_Reverse_Engineering_1/intro-rev-1.zip"]}, {"name": "Intro Reverse Engineering 2", "desc": "Somehow the password was encoded and can't be found in plaintext in the binary. Can you still figure out the right password?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/rev/Intro_Reverse_Engineering_2/intro-rev-2.zip"]}, {"name": "Intro Reverse Engineering 3", "desc": "Again, the password was encoded. But this time your input is transformed dynamically! Is it still possible to find the password?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/rev/Intro_Reverse_Engineering_3/intro-rev-3.zip"]}, {"name": "Skullcode", "desc": "Skullcode used to be a hex editor that allowed you to edit itself. And now it is a flag checker. Can you figure it out?\n\nThe flag is the solution surrounded by dach2025{...}.\n\nNote: the challenge can be solved locally (spawning a session is not required).\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/rev/Skullcode/skullcode.zip"]}, {"name": "crackme.nix", "desc": "Welcome to pure functional madness! This challenge may be a bit different from what you're used to. But don't worry, it's just a simple crackme ;) Oh, did I mention that it's written in Nix? Good luck!\n\nThe challenge needs more stack than some distros provide and more than Nix allows by default, it should work with the following command!\n\ndocker run --rm -it --ulimit stack=2147483648:2147483648 -v \"$(pwd)/crackme.nix:/crackme.nix\" nixos/nix:2.26.1 \\\n  bash -c \"nix-instantiate --option max-call-depth 1000000000 --eval /crackme.nix --argstr flag '<flag_here>'\"\n\n    the flag format is dach2025{...}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/rev/crackme.nix/crackme-nix.zip"]}], "web": [{"name": "Air Smeller", "desc": "I found this website were you can rate the smell of the air, after purification. Do you know a good purifier, maybe you can recommend some purifier to the people.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/web/Air_Smeller/air-smeller.zip"]}, {"name": "Everyone loves canteen food", "desc": "Welcome to the canteen's online menu, where you can check out the daily specials and their prices. But is everything as appetizing as it seems?\n\nFlagformat: string which has to be put in dach2025{<string>}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/web/Everyone_loves_canteen_food/canteenfood.zip"]}, {"name": "vidplow", "desc": "We recently stumbled upon an exposed SVN server of a large multimedia corporation, containing some of their backend application and internal tooling code. However, the access keys seem to not be the ones used in production - the real ones should fetch us quite a high price though, if we manage to get our hands on them that is. Just one problem - the tech stack seems to be really obscure, and no one on our team seems to have any clue what the heck is going on. Can you take a look, and maybe find some vulnerabilities in this thing?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CSCG/2025/web/vidplow/vidplow.zip"]}]}