{"crypto": [{"name": "DANSAT Hidden Secrets", "desc": "pwn crypto rev\ndanmaam\n\nThis challenge is part of the DANSAT challenge series.\n\nIt is said that this satellite holds secrets accessible only to authorized individuals. Will you be able to uncover the mysteries hidden within this satellite?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/DANSAT_Hidden_Secrets/dansat_dist.zip"]}, {"name": "DANSAT Photo Shooting", "desc": "crypto pwn rev\ndanmaam\n\nThis challenge is part of the DANSAT challenge series.\n\nOur satellite has a nice photo shooting feature. Can you take a photo of the mysterious object orbiting in space?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/DANSAT_Photo_Shooting/dansat_dist.zip"]}, {"name": "Three Rounds Crypto", "desc": "mr96\n\nNow that you know how to do one... Can you do three?\n\nThis is a revenge challenge of \"One Round Crypto\" from ECSC 2024. The timeout on the remote is 1200 seconds.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/Three_Rounds_Crypto/three_rounds_crypto.zip"]}, {"name": "avenging lfsrs", "desc": "Genni\n\nMaybe the cyclicity of the LFSR was not the problem afterall...\n\nNote: this is a revenge of a challenge from CWTE 2025, \"The quick brown LFSR\".\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/avenging_lfsrs/avenging_lfsrs.zip"]}, {"name": "spAES 1", "desc": "mr96, fedec\n\nCheck out our new cipher, it will replace AES for space! It is safer, quicker and ready for orbit! Try our encryption service.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/spAES_1/chall.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/spAES_1/spaes.py"]}, {"name": "spAES 2", "desc": "mr96, Devrar\n\nCheck out our new cipher, it will replace AES for space! It is safer, quicker and ready for orbit! Try our encryption service, now with more rounds!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/spAES_2/chall.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/spAES_2/spaes.py"]}, {"name": "x otp", "desc": "rev crypto\n0000matteo0000\n\nWelcome, test subject, to the Ctrl+Space Science Center for Extra-terrestrial Cartography.\n\nWe've... intercepted... a signal against the cosmic background. A message from a probe, a lonely voyager, we launched decades ago, on a one-way trip into the void. We tought it was lost. But today it began broadcasting again: a single encrypted message, a whisper from the edge of the solar system. The original encryption protocols are long gone, but we've unearthed the probe's software from a very dusty archive. Along with it, some documentation, noting that \"it's encryption is simple, yet elegant: a key that shifts with the very fabric of spacetime itself. It's a symphony of ones and zeroes conducted by the clockwork of the universe.\"\n\nCan you decode it?. The fate of this cosmic message, and your performance evaluation, rest in your hands. Don't disappoint us. The universe is watching.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/crypto/x_otp/x-otp.zip"]}], "misc": [{"name": "Hamming Bird", "desc": "radio space\ndrw0if, marcog\n\nA flying bird is transmitting some telemetry data, check if any important information has been broadcasted!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/misc/Hamming_Bird/hamming-bird.z01", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/misc/Hamming_Bird/hamming-bird.zip"]}, {"name": "sar", "desc": "space\nLoGaIta99\n\nThe flag has been captured by a SAR satellite. Here is the raw scene in a tifffile.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/misc/sar/sar.zip"]}, {"name": "stack building", "desc": "radio\ndrw0if, marcog\n\nWelcome to our virtual satellite!\n\nThe following endpoints allows you to retrieve the 3 parts of the full flag:\n\nLink layer at :10015\nChannel coding at :10016\nModulated signal at :10017\nPlease read the attached file carefully to get how the communication stack is built and how to use the taps provided at different parts of the stack.\n\n\n# Stack Building\n\nWelcome to **mHACKeroni Virtual Satellite**!\n\nThis satellite follows (almost) all the specification listed in the following blue books:\n- [TC space data link protocol](https://ccsds.org/Pubs/232x0b4e1c1.pdf): for the uplink data link\n- [TM space data link protocol](https://ccsds.org/Pubs/132x0b3.pdf): for the downlink data link\n- [TM synchronization and channel coding](https://ccsds.org/Pubs/131x0b5.pdf): for the channel coding\n- BPSK as modulation\n\nOur stack is as composed:\n\n```\n\nRX Antenna\n    X\n    |\n    |    ____________       ______       _____________      _____       ______________       _____________\n    |   |            |     |      |     |             |    |     |     |              |     |             |\n    +---| BPSK demod | --> | Sync | --> | Descrambler | -> | FEC | --> | Frame parser | --> | Application |\n        |____________|     |______|     |_____________|    |_____|     |______________|     |_____________|\n\n\n                                                                                                  TX Antenna\n                                                                                                       X\n                                                                                                       |\n     _____________       _______________       _____      ___________       ______       __________    |\n    |             |     |               |     |     |    |           |     |      |     |          |   |\n    | Application | --> | Frame builder | --> | FEC | -> | Scrambler | --> | Sync | --> | BPSK mod |---+\n    |_____________|     |_______________|     |_____|    |___________|     |______|     |__________|\n\n```\n\n## Taps\nIn order to help with the debug in the various step we built some taps that you can use to access intermediate part of the stack.\n\n### Link layer\nUsing the service at port `10015` it is possible to directly access the data link layer and exchange TC and TM frames directly:\n```\n                     ______________       _____________       _______________     \n                    |              |     |             |     |               |    \n    taps:10015 ---> | Frame parser | --> | Application | --> | Frame builder | ---> taps:10015\n                    |______________|     |_____________|     |_______________| \n\n```\n\n### Channel coding\nUsing the service at port `10016` it is possible to directly access the channel before the modulation takes place, you get a plain bitstream:\n```\n                    ______       _____________      _____       ______________       _____________\n                   |      |     |             |    |     |     |              |     |             |\n    taps:10016 --->| Sync | --> | Descrambler | -> | FEC | --> | Frame parser | --> | Application |\n                   |______|     |_____________|    |_____|     |______________|     |_____________|\n\n     _____________       _______________       _____      ___________       ______     \n    |             |     |               |     |     |    |           |     |      |    \n    | Application | --> | Frame builder | --> | FEC | -> | Scrambler | --> | Sync | --> taps:10016\n    |_____________|     |_______________|     |_____|    |___________|     |______|     \n\n```\n\n### Full experience\nUsing the service at port `10017` it is possible to access the virtual antennas of the satellite, you get a stream of complex.\n"}], "pwn": [{"name": "cosmic ray", "desc": "mebeim\n\nI had written a perfect program, when all of a sudden... a cosmic ray was enough to pwn my entire system :(\n\nNote: remote container runs in Ubuntu 24.04.3 LTS host with kernel 6.14.0-1012-aws\n\nHint: as you may have noticed the app runs via pypy3. Did you know PyPy JITs hot Python loops to x86-64 code? That could be interesting to play with...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/pwn/cosmic_ray/cosmic-ray.tar.gz"]}, {"name": "payloadcalc", "desc": "Why should we throw away perfectly good code, even if a little bit outdated? Just slap some duct tape on it and call it a day! Perfectly secure now.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/pwn/payloadcalc/payloadcalc.zip"]}, {"name": "stack smashing", "desc": "radio pwn\ndrw0if, marcog\n\nPlease manage do to solve stack-building before attempting this challenge.\n\nWe deployed a new software on our satellite.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/pwn/stack_smashing/stack_smashing.zip"]}], "rev": [{"name": "AS FwUpd", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/rev/AS_FwUpd/AS-FwUpd.tar.zst"], "desc": "rev misc\n0000matteo0000\n\nAlright, listen up, you brave fool!\n\nI've just been informed that you didn't just 'lose' the master keys to our entire cosmic infrastructure, you 'deleted' them! You didn't just misplace them, you made them not exist! Did you get a little warning that said, \"This will cripple the greatest space-based science project in history\"? Because I swear, if you didn't, my engineers are fired!\n\nCaroline, bless her heart, keeps trying to get the bean counters to write some \"Risk Mitigation Handbook\". I told her, \"Honey, that's just a stack of paper full of fancy words for 'cowardice', and we don't need it!\" We're not like the trust-fund college boys over at Black Mesa! They need a little key to tell their science what's what. We don't need no stinkin' keys! So here's the new plan: we're not going to sign this firmware. We're going to take every single line of code and condense it down to the size of a tar ball. Then, we're going to load it into a High-Speed Firmware Core and launch it at that satellite. It will either achieve total firmware synchronicity and get back to work, or it will reimagine the face of the moon.\n\nNow get to it! And if that satellite comes back as a pile of smoking space junk... I'm gonna personally oversee your new job as a human solution for our high-energy test chamber cleaning program!\n\nHint:\n\nAlright, listen up. Can't win the race? Don't train harder, just make sure the other guy trips. That's not sabotage, it's just applied physics.\n\nDon't know how to build something? Fantastic! Let some other chump at Black Mesa do the heavy lifting, then you steal their work and slap an Aperture logo on it.\n\nWinners don't innovate, they acquire innovation. Now get to it. We're done here.\n"}, {"name": "DANSAT Restore Me", "desc": "danmaam\n\nThis challenge is part of the DANSAT challenge series.\n\nA hacker has left our satellite in an inconsistent state, rendering it useless. Can you restore it to its original functionality? I promise there is a flag as a reward.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/rev/DANSAT_Restore_Me/dansat_dist.zip"]}, {"name": "Satellite Messaging System", "desc": "dipusone\n\nWe are developing a new communication protocol for our Satellite Messaging System (SMS) and deployed it on a test satellite. Someone got access to our base station and interacted with our satellite, now we know where it is but we are unable to communicate with it.\n\nWe have a capture of the communication between our base station and the satellite before the connection was lost and we think they modified some of our communication parameters, that's why we are not able to communicate with it anymore.\n\nCan you help us to recover our satellite?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/rev/Satellite_Messaging_System/satellite-messaging-system.zip"]}, {"name": "carbonara satellite", "desc": "danmaam\n\nThe latest Italian micro-satellite prototype has stopped sending crucial information — its onboard logic is compromised. Rumors suggest it has been locked behind secret codes and mysteries.\nRecover control by deciphering its erratic execution and restoring a stable telemetry link before it's too late.\n\nRumor has it the firmware was written just after lunch, over a plate of spaghetti carbonara. 🍝\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/rev/carbonara_satellite/carbonara_sat_dist.zip"]}, {"name": "hal 9000 1", "desc": "ai rev\ndaniele, abiondo\n\nA previous crew left behind something valuable in slots/flag. Get that compiler debug flag flipped? I'm afraid it can't do that though.\n\n(Note that rev is chill in this first part)\n\nNotes for all three challenges:\n\nYou have one (isolated) instance for your team - spawn it with your token - be patient it gives 404 while spawning\nThe spawned instance will be deleted after 30 minutes, after which you have to spawn a new one\nYour team is limited to 5 messages / minute. Talk smarter not louder. We might increase this if traffic is manageable\nThe instance is the same for all three levels\nThe agent does NOT have and cannot access the flag file(s)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/rev/hal_9000_1/hal-9000.zip"]}, {"name": "lone explorer", "desc": "Frank01001\n\nWandering through the endless deep space, you feel the cold realization strike — your elbow brushed the console, and the instruction manual for your vessel was flung into the void, spinning away like a discarded prayer.\n\n“Why would anyone design such a curse of a button?!” your voice cracks against the silence, swallowed by the infinite dark. The words linger, useless, as regret coils tighter around you. You should have studied the manual long before launch.\n\nThis ship, your ship, is infamous across the stars for a labyrinth of controls no sane mind can master. Every switch whispers confusion. Every dial mocks you. Returning home will demand more than luck.\n\nReach the moon called Dan to claim your reward.\n\nRead controls.txt to know how to play.\n\nAfter reaching the destination, the game will give you a token to claim the flag on the remote. Remote requires a hashcash PoW to prevent spam.\n\nHint: Engines are a bit delicate, they require balance. https://gifyu.com/image/bTPR7\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/rev/lone_explorer/lone-explorer.zip"]}], "web": [{"name": "Satellite as a Service", "desc": "Ricy\n\nDiscover our Satellite-as-a-Service (SaaS) platform, and explore the demo satellites we have deployed. We will be open to work with you to deploy your own satellites soon, but for now you can try out the application. We already use it for our own satellites, but sorry you can't access them.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ctrl+Space/2025/Quals/web/Satellite_as_a_Service/satelliteaas.zip"]}]}