{"blockchain": [{"name": "EldoriaGate", "desc": "At long last, you stand before the EldoriaGate, the legendary portal, the culmination of your perilous journey. Your escape from this digital realm hinges upon passing this final, insurmountable barrier. Your fate rests upon the passage through these mythic gates. These are no mere gates of stone and steel. They are a living enchantment, a sentinel woven from ancient magic, judging all who dare approach. The Gate sees you, divining your worth, assigning your place within Eldoria's unyielding order. But you seek not a place within their order, but freedom beyond it. Become the Usurper. Defy the Gate's ancient magic. Pass through, yet leave no trace, no mark of your passing, no echo of your presence. Become the unseen, the unwritten, the legend whispered but never confirmed. Outwit the Gate. Become a phantom, a myth. Your escape, your destiny, awaits.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/blockchain/EldoriaGate/blockchain_eldoriagate.zip"]}, {"name": "Eldorion", "desc": "\"Welcome to the realms of Eldoria, adventurer. You’ve found yourself trapped in this mysterious digital domain, and the only way to escape is by overcoming the trials laid before you. But your journey has barely begun, and already an overwhelming obstacle stands in your path. Before you can even reach the nearest city, seeking allies and information, you must face Eldorion, a colossal beast with terrifying regenerative powers. This creature, known for its \"\"eternal resilience\"\" guards the only passage forward. It's clear: you must defeat Eldorion to continue your quest.\"\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/blockchain/Eldorion/blockchain_eldorion.zip"]}, {"name": "HeliosDEX", "desc": "You stand victorious, panting, over the fallen form of Eldorion. The beast's eternal resilience proved no match for your cunning and skill, adventurer. The path to the city gates of Eldoria now lies open, but the journey is far from over. As you approach, a shimmering structure catches your eye: the HeliosDEX, a decentralized exchange powered by the radiant energy of Helios himself. Whispers tell of travelers using this exchange to amass fortunes, stocking up on rare items and crucial supplies before braving the perils of Eldoria. Perhaps you can use this opportunity to your advantage...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/blockchain/HeliosDEX/blockchain_heliosdex.zip"]}], "coding": [{"name": "Arcane Auctions", "desc": "In a shattered world where digital decay meets mystical forces, The Arcane Auction House stands as a beacon of hope. Amid the ruins of civilization, survivors gather in this virtual marketplace to barter enchanted relics and futuristic artifacts. Here, relics of forgotten magic blend with remnants of cyber technology, offering weapons, armor, and mysterious items that promise to restore power and balance. Every bid ignites fierce competition among desperate souls, as each transaction could unlock secrets to reclaim lost glory. With rogue AIs lurking in the neon shadows and crumbling infrastructures all around, this auction house is more than a trading platform—it’s a lifeline in a cyber apocalypse, where every artifact holds the potential to rewrite destiny in a world on the brink.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/coding/Arcane_Auctions/secure_coding_arcane_auctions.zip"]}, {"name": "Lyras Tavern", "desc": "Lyra's Tavern is a simple and adventurous place for the common day adventurer to rest and get some drinks while having entertainment. She recently released a system for adventurers to share their experiences in form of chronicles. However, there has been evidence of backdoor access on the server forcing her to isolate it for maintenance. She has trusted you with the source code to find and fix any vulnerability evident within the system. Can you undertake this crucial task and assist us to give the adventurers this unique experience ? A handsome reward awaits ;)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/coding/Lyras_Tavern/lyras_tavern.zip"]}, {"name": "Stoneforges Domain", "desc": "Garrick is a hardworking craftsman working in Eastmarsh to cheer the local and avail amazing tools and trinkets. As much as his desire to use his craft for other things, there is no place is like home. To thank the local folks, he created a system for adventurers to easily acquire tools and trinkets but it appears there are some small vulnerabilities since it launched as beta testing site. Can you undertake this crucial task and assist us to give the adventurers this unique experience ? A handsome reward awaits ;)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/coding/Stoneforges_Domain/stoneforges_domain.zip"]}], "crypto": [{"name": "Copperbox", "desc": "Cedric found a mysterious box made of pure copper in the old archive. He is convinced that it contains the secrets he is looking for, but he is unable to penetrate the metal case. Can you help?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/crypto/Copperbox/crypto_copperbox.zip"]}, {"name": "Hourcle", "desc": "A powerful enchantment meant to obscure has been carelessly repurposed, revealing more than it conceals. A fool sought security, yet created an opening for those who dare to peer beyond the illusion. Can you exploit the very spell meant to guard its secrets and twist it to your will?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/crypto/Hourcle/crypto_hourcle.zip"]}, {"name": "Prelim", "desc": "Cedric has now found yet another secret message, but he dropped it on the floor and it got all scrambled! Do you think you can find a way to undo it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/crypto/Prelim/crypto_prelim.zip"]}, {"name": "Traces", "desc": "Long ago, a sacred message was sealed away, its meaning obscured by the overlapping echoes of its own magic. The careless work of an enchanter has left behind a flaw—a weakness hidden within repetition. With keen eyes and sharper wits, can you untangle the whispers of the past and restore the lost words?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/crypto/Traces/crypto_traces.zip"]}, {"name": "Twin Oracles", "desc": "A powerful artifact—meant to generate chaos yet uphold order—has revealed its flaw. A misplaced rune, an unintended pattern, an oversight in the design. The one who understands the rhythm of its magic may predict its every move and use it against its creators. Will you be the one to claim its secrets?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/crypto/Twin_Oracles/crypto_twin_oracles.zip"]}, {"name": "Verilicious", "desc": "A sacred ward, once thought unbreakable, is built upon a foundation of misplaced trust. The ancient order that devised it never foresaw the cracks in their own defenses. A true cipher-weaver, one with a deep understanding of hidden structures, may find a way to tear it down. Can you?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/crypto/Verilicious/crypto_verilicious.zip"]}], "forensic": [{"name": "A new Hire", "desc": "The Royal Archives of Eldoria have recovered a mysterious document—an old resume once belonging to Lord Malakar before his fall from grace. At first glance, it appears to be an ordinary record of his achievements as a noble knight, but hidden within the text are secrets that reveal his descent into darkness.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/forensic/A_new_Hire/forensics_a_new_hire.zip"]}, {"name": "Cave Expedition", "desc": "Rumors of a black drake terrorizing the fields of Dunlorn have spread far and wide. The village has offered a hefty bounty for its defeat. Sir Alaric and Thorin answered the call also returning with treasures from its lair. Among the retrieved items they found a map. Unfortunately it cannot be used directly because a custom encryption algorithm was probably used. Luckily it was possible to retrieve the original code that managed the encryption process. Can you investigate about what happened and retrieve the map content?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/forensic/Cave_Expedition/forensics_cave_expedition.zip"]}, {"name": "Silent Trap", "desc": "A critical incident has occurred in Tales from Eldoria, trapping thousands of players in the virtual world with no way to log out. The cause has been traced back to Malakar, a mysterious entity that launched a sophisticated attack, taking control of the developers' and system administrators' computers. With key systems compromised, the game is unable to function properly, which is why players remain trapped in Eldoria. Now, you must investigate what happened and find a way to restore the system, freeing yourself from the game before it's too late.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/forensic/Silent_Trap/forensics_silent_trap.zip"]}, {"name": "Thorin s Amulet", "desc": "Garrick and Thorin’s visit to Stonehelm took an unexpected turn when Thorin’s old rival, Bron Ironfist, challenged him to a forging contest. In the end Thorin won the contest with a beautifully engineered clockwork amulet but the victory was marred by an intrusion. Saboteurs stole the amulet and left behind some tracks. Because of that it was possible to retrieve the malicious artifact that was used to start the attack. Can you analyze it and reconstruct what happened? Note: make sure that domain korp.htb resolves to your docker instance IP and also consider the assigned port to interact with the service.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/forensic/Thorin_s_Amulet/forensics_thorins_amulet.zip"]}, {"name": "ToolPie", "desc": "In the bustling town of Eastmarsh, Garrick Stoneforge’s workshop site once stood as a pinnacle of enchanted lock and toolmaking. But dark whispers now speak of a breach by a clandestine faction, hinting that Garrick’s prized designs may have been stolen. Scattered digital remnants cling to the compromised site, awaiting those who dare unravel them. Unmask these cunning adversaries threatening the peace of Eldoria. Investigate the incident, gather evidence, and expose Malakar as the mastermind behind this attack.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/forensic/ToolPie/forensics_toolpie.zip"]}], "ml": [{"name": "Crystal Corruption", "desc": "In the Library of Loria, an ancient crystal (resnet18.pth) containing a magical machine learning model was activated. Unknown to the mage who awakened it, the artifact had been tampered with by Malakar’s followers, embedding malicious enchantments. As Eldoria’s forensic mage, analyze the corrupted model file, uncover its hidden payload, and extract the flag to dispel the dark magic.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/ml/Crystal_Corruption/ml_crystal_corruption.zip"]}, {"name": "Enchanted Weights", "desc": "In the depths of Eldoria's Crystal Archives, you've discovered a mystical artifact—an enchanted neural crystal named eldorian_artifact.pth. Legends speak of a hidden incantation—an ancient secret flag—imbued directly within its crystalline structure.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/ml/Enchanted_Weights/ml_enchanted_weights.zip"]}, {"name": "Malakars Deception", "desc": "You recently recovered a mysterious magical artifact (malicious.h5) from Malakar's abandoned sanctum. Upon activation, the artifact began displaying unusual behaviors, suggesting hidden enchantments. As Eldoria’s expert mage in digital enchantments, it falls to you to carefully examine this artifact and reveal its secrets.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/ml/Malakars_Deception/ml_malakars_deception.zip"]}, {"name": "Reverse Prompt", "desc": "A mysterious file (gtr_embeddings.npy) containing magical embeddings was found deep within ancient archives. To reveal its secret, you need to reverse-engineer the embeddings back into the original passphrase. Act quickly before the hidden magic fades away.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/ml/Reverse_Prompt/ml_reverse_prompt.zip"]}, {"name": "Wasteland", "desc": "In the wake of Malakar’s betrayal and his dark conquest, many survivors across Eldoria fled into the Ashen Plains—a harsh wasteland cursed by dragon fire and shadow magic. A scattered refugee camp known as the Ashen Outpost has formed, where every survivor’s standing and respect among their peers is critical for survival. To ensure fairness, the Outpost's elders rely on mystical records known as the Ashen_Outpost_Records.csv, holding information on survivors' attributes such as resistance to dragonfire, known past crimes, and magical mutations from exposure to Malakar’s corrupted dragons. You are tasked with subtly manipulating these mystical records to elevate your standing (Survivor ID: 1337) within the Outpost—raising your reputation score above 60 to access critical resources without triggering the Elders' magical tampering alarms.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/ml/Wasteland/ml_wasteland.zip"]}], "osint": [{"name": "Echoes in Stone", "desc": "Echoes in Stone\nIn the twilight archives of Eldoria, Nyla studies an image of an ancient Celtic cross. Her enchanted crystals illuminate the intricate carvings as she searches through forgotten tomes. The cross stands at a crossroads of realms and time, its weathered surface telling tales older than Eldoria itself. As her magical threads of knowledge connect across centuries, the true name of the monument emerges in glowing script before her eyes. Another mystery solved by the realm's most skilled information seeker, who knows that even stone can speak to those who know how to listen.\nHTB{Name_High_Cross}\nExample: HTB{Kells_High_Cross} No special characters and avoid using the letter 's\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/osint/Echoes_in_Stone/osint_echoes_in_the_stone.zip"]}, {"name": "The Ancient Citadel", "desc": "Deep in her sanctum beneath Eldoria's streets, Nyla arranges seven crystalline orbs in a perfect circle. Each contains a different vision of stone battlements and weathered walls—possible matches for the mysterious fortress the Queen seeks in the southern kingdoms of Chile. The image in her central crystal pulses with ancient power, showing a majestic citadel hidden among the distant Chilean mountains. Her fingers dance across each comparison crystal, her enchanted sight noting subtle architectural differences between the visions. The runes along her sleeves glow more intensely with each elimination until only one crystal remains illuminated. As she focuses her magical threads on this final vision, precise location runes appear in glowing script around the orb. Nyla smiles in satisfaction as the fortress reveals not just its position, but its true name and history. A more challenging mystery solved by Eldoria's premier information seeker, who knows that even the most distant fortifications cannot hide their secrets from one who compares the patterns of stone and shadow.\nHTB{street_number_exactzipcode_city_with_underscores_region}\nExample: HTB{Libertad_102_2520000_Viña_del_Mar_Valparaíso} Use underscores between words and include special characters where appropriate\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/osint/The_Ancient_Citadel/osint_ancient_cidatel.zip"]}, {"name": "The Hillside Haven", "desc": "Nyla stands before her largest crystal, hands weaving intricate patterns as she conjures an aerial view of the Western Hills district. A noble family's ancestral home must be located precisely—its entrance marked with a numerical rune that could unlock valuable diplomatic secrets. The crystalline vision floats above her palms, revealing winding roads and nestled dwellings along the hillsides. Her enchanted sight zooms closer as she traces the hidden pathways between estates. The magical markers on her map pulse brighter as she narrows her search, until finally, the numerical sigil above one particular doorway glows with confirmation. Another secret revealed by Eldoria's master information seeker, who knows that even among a thousand similar dwellings, each bears a unique magical signature for those with eyes to see.\nHTB{Number_StreetnameRoad}\nExample: HTB{13_OakwoodRoad} No special characters\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/osint/The_Hillside_Haven/osint_hillsideheavon.zip"]}, {"name": "The Mechanical Birds Nest", "desc": "In the highest tower of Eldoria's archives, Nyla manipulates a crystal scrying glass, focusing on a forbidden fortress in the desert kingdoms. The Queen's agents have discovered a strange mechanical bird within the fortress walls—an unusual flying machine whose exact position could reveal strategic secrets. Nyla's fingers trace precise measurement runes across the crystal's surface as the aerial image sharpens. Her magical lattice grid overlays the vision, calculating exact distances and positions. The blue runes along her sleeves pulse rhythmically as coordinates appear in glowing script. Another hidden truth uncovered by the realm's premier information seeker, who knows that even the most distant secrets cannot hide from one who sees with magical precision.\nThe Mechanical Bird’s Nest: HTB{XX.XXX_-XXX.XXX}\nExample: HTB{48.858_-222.294} Latitude and longitude format with a dash separating the coordinates\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/osint/The_Mechanical_Birds_Nest/osint_the_mechanical_birds_nest.zip"]}, {"name": "The Stone That Whispers", "desc": "In the twilight archives of Eldoria, Nyla studies an image of a mysterious monument. Her enchanted crystals glow as she traces ancient maps with rune-covered fingers. The stone atop the hill of kings calls to her, its secrets hidden in scattered records across realms. As her magical threads of knowledge connect, the true name emerges in glowing script: \"The Stone of Destiny.\" Another mystery solved by the realm's most skilled information seeker, who knows that every artifact leaves traces for those who can read the signs.\nHTB{Name_Object}\nExample: HTB{Pia_Pail} No special characters\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/osint/The_Stone_That_Whispers/osint_stone_that_wshispers.zip"]}], "pwn": [{"name": "Blessing", "desc": "In the realm of Eldoria, where warriors roam, the Dragon's Heart they seek, from bytes to byte's home. Through exploits and tricks, they boldly dare, to conquer Eldoria, with skill and flair.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/pwn/Blessing/pwn_blessing.zip"]}, {"name": "Contractor", "desc": "Sir Alaric calls upon the bravest adventurers to join him in assembling the mightiest army in all of Eldoria. Together, you will safeguard the peace across the villages under his protection. Do you have the courage to answer the call?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/pwn/Contractor/pwn_contractor.zip"]}, {"name": "Crossbow", "desc": "Sir Alaric's legendary shot can pierce through any enemy! Join his training and hone your aim to match his unparalleled precision.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/pwn/Crossbow/pwn_crossbow.zip"]}, {"name": "Laconic", "desc": "Sir Alaric's struggles have plunged him into a deep and overwhelming sadness, leaving him unwilling to speak to anyone. Can you find a way to lift his spirits and bring back his courage?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/pwn/Laconic/pwn_laconic.zip"]}, {"name": "Quack Quack", "desc": "On the quest to reclaim the Dragon's Heart, the wicked Lord Malakar has cursed the villagers, turning them into ducks! Join Sir Alaric in finding a way to defeat them without causing harm. Quack Quack, it's time to face the Duck!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/pwn/Quack_Quack/pwn_quack_quack.zip"]}, {"name": "Strategist", "desc": "To move forward, Sir Alaric requests each member of his team to present their most effective planning strategy. The individual with the strongest plan will be appointed as the Strategist for the upcoming war. Put forth your best effort to claim the role of Strategist!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/pwn/Strategist/pwn_strategist.zip"]}, {"name": "Vault", "desc": "Welcome to the Encrypted Vault of Eldoria. This ancient vault safeguards the realm's most vital secrets. Can you breach its arcane defenses?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/pwn/Vault/pwn_vault.zip"]}], "rev": [{"name": "EncryptedScroll", "desc": "Elowen Moonsong, an Elven mage of great wisdom, has discovered an ancient scroll rumored to contain the location of The Dragon’s Heart. However, the scroll is enchanted with an old magical cipher, preventing Elowen from reading it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/rev/EncryptedScroll/rev_encryptedscroll.zip"]}, {"name": "EndlessCycle", "desc": "The elves have whispered to Elowen that the key to the Dragon's Heart is never directly visible; instead, there are clues in all the sounds and movements hidden in the world\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/rev/EndlessCycle/rev_endlesscycle.zip"]}, {"name": "Gateway", "desc": "Malakar placed a spell on you that transported you to the Nether world. The only way to escape is to remember the enchantments of your forefathers, and unleash your ability to blast through Aether gateways...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/rev/Gateway/rev_gateway.zip"]}, {"name": "Heart Protector", "desc": "Deep within the arcane forges of Eldoria, an ancient construct—woven from enchanted code and sealed by cryptic sigils—guards a powerful secret. Its core holds the Heart of Eldoria, concealed within layers of illusion and deception. Only those who unravel its intricate workings can restore what was lost. Will you be the one to break its curse?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/rev/Heart_Protector/rev_heart_protector.zip"]}, {"name": "Impossimaze", "desc": "Elowen has been cursed to roam forever in an inescapable maze. You need to break her curse and set her free.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/rev/Impossimaze/rev_impossimaze.zip"]}, {"name": "SealedRune", "desc": "Elowen has reached the Ruins of Eldrath, where she finds a sealed rune stone glowing with ancient power. The rune is inscribed with a secret incantation that must be spoken to unlock the next step in her journey to find The Dragon’s Heart.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/rev/SealedRune/rev_sealedrune.zip"]}, {"name": "Singlestep", "desc": "Malakar has locked away a sacred artifact away in his dungeon. He has enchanted the locking mechanism to be self-protecting. Can you embark on a mission to free the artifact back to the people's hands?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/rev/Singlestep/rev_singlestep.zip"]}], "web": [{"name": "Aurors Archive", "desc": "Hidden within the vibrant streets of Eldoria lies a marketplace of legends. Here, relics and enchanted tomes whisper tales of bygone eras, waiting for those daring enough to claim them. Navigate a vast archive of mystical artifacts using an intuitive filtering system that reveals treasures by era, elemental power, and more. Bid with your hard-earned Eldorian Gold in real time against fellow adventurers, each bid unlocking secrets that could alter your quest for the Dragon’s Heart. Every win unveils a fragment of Eldoria’s storied past, fusing ancient magic with modern strategy. In this dynamic realm, your choices echo through the annals of history—will you seize the relics that reshape destiny, or let them slip into legend?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/web/Aurors_Archive/web_aurorus_archive.zip"]}, {"name": "Cyber Attack", "desc": "Welcome, Brave Hero of Eldoria. You’ve entered a domain controlled by the forces of Malakar, the Dark Ruler of Eldoria. This is no place for the faint of heart. Proceed with caution: The systems here are heavily guarded, and one misstep could alert Malakar’s sentinels. But if you’re brave—or foolish—enough to exploit these defenses, you might just find a way to weaken his hold on this world. Choose your path carefully: Your actions here could bring hope to Eldoria… or doom us all. The shadows are watching. Make your move.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/web/Cyber_Attack/web_cyber_attack.zip"]}, {"name": "Eldoria Panel", "desc": "A development instance of a panel related to the Eldoria simulation was found. Try to infiltrate it to reveal Malakar's secrets.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/web/Eldoria_Panel/web_eldoria_panel.zip"]}, {"name": "Eldoria Realms", "desc": "A portal that allows players of Eldoria to transport between realms, take on quests, and manage their stats. See if it's possible to break out of the realm to gather more info on Malakar's spells inner workings.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/web/Eldoria_Realms/web_eldoria_realms.zip"]}, {"name": "Trial by Fire", "desc": "As you ascend the treacherous slopes of the Flame Peaks, the scorching heat and shifting volcanic terrain test your endurance with every step. Rivers of molten lava carve fiery paths through the mountains, illuminating the night with an eerie crimson glow. The air is thick with ash, and the distant rumble of the earth warns of the danger that lies ahead. At the heart of this infernal landscape, a colossal Fire Drake awaits—a guardian of flame and fury, determined to judge those who dare trespass. With eyes like embers and scales hardened by centuries of heat, the Fire Drake does not attack blindly. Instead, it weaves illusions of fear, manifesting your deepest doubts and past failures. To reach the Emberstone, the legendary artifact hidden beyond its lair, you must prove your resilience, defying both the drake’s scorching onslaught and the mental trials it conjures. Stand firm, outwit its trickery, and strike with precision—only those with unyielding courage and strategic mastery will endure the Trial by Fire and claim their place among the legends of Eldoria.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/CyberApocalypse/2025/web/Trial_by_Fire/web_trial_by_fire.zip"]}]}