{"blockchain": [{"name": "Layer 2", "desc": "One of the thief sold an artwork for cryptocurrencies, then transferred the funds to 2 crytpo wallets. You need to track the funds.\n\nWhat we know :\n\nPrice he sold the artwork for: 0.05 Ethereum Source Address of the funds: 0x30Fe1Ba69F69675be76B5b7eA2da6F88A7087203 Network used: Ethereum Sepolia Testnet Objective: Identify the two addresses of the wallets where the thief transferred the funds.\n\nFlag Format: Your answer should be the MD5 hash of the two wallet addresses, concatenated without any spaces or extra characters, inside DVCTF{}: DVCTF{md5hash({Wallet1}{Wallet2})}\n\nNote : This challenged has been made on the Ethereum Sepolia Testnet.\n"}, {"name": "PrivateKey", "desc": "A thief sold a stolen artwork for cryptocurrencies, you are trying to track him. You need to find the private key of the wallet he used for the sale.\n\nHis phone was retrieved, here is what we found inside : The first wallet he created has this address 0xBB936f91EB631f6d1a376dBE203D22BA70337F7F, but he didn't use this one for the sale. He had created 2 wallets before the one he was using for the sale, using the same seedphrase. He took this picture named \"Backup\"\n\nThe solution is the private key hashed in md5 inside DVCTF{}\n\nFor example, if the private key is 0xdcae2f39a2e09978519003cf7a4cf5524d4d4486b1bef9e2bc5ebbcfbe394a26, the flag would be DVCTF{67bbecf3d7da21e86010576f912e62c6}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/blockchain/PrivateKey/image.jpg"]}], "crypto": [{"name": "0neC00K1e", "desc": "Cookie-encrypter shoud be more secure than just signing my cookie, right ?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/crypto/0neC00K1e/source.zip"]}, {"name": "Counterfeit Arts", "desc": "I've made my best encryption code and tried it. Now your art is encrypted, you'll never get it back without my key !\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/crypto/Counterfeit_Arts/source.zip"]}, {"name": "IndestructibleVault", "desc": "Each night, the vault’s access code is encrypted and sent to security—but never stored. If you can decrypt the message, the museum’s most valuable treasures will be within your grasp. Can you crack the encryption before security catches on ?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/crypto/IndestructibleVault/source.py"]}, {"name": "SCAred Generator", "desc": "I finally got my prime generator to work ! But something feels off... Can you test it ? I'll even provide its logs.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/crypto/SCAred_Generator/challenge.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/crypto/SCAred_Generator/output.txt"]}], "forensic": [{"name": "Disk Analysis", "desc": "Given this file, you need to recover two hidden flags, good look.\n\ndrive/evidence.ad1\n\nThe falg DVCTF{Y0u_F1nd_m3} is not the real one.\n\nhttps://drive.google.com/file/d/1H80HrBk3SHTULnxpE0suLvu8ugmKzPpu/view\n"}, {"name": "Noted", "desc": "Windows 11 remembers everything, even when it's not saved.\n\n    Noted.zip SHA256: 41BFC0D7DD7F0EA0AA532A7EB340C975FF7210BFD9AD12DA01123DC9CF582287\n    Noted.img SHA256: BA109AADAACF3C9852E43BFE980DC317B36168B9D11CB3BF423FDAE491A3D466\n    File: https://drive.google.com/file/d/1SQ9qv-hXO4jfzWovmw83qauh4vnFrSKd/view Password: N0t3dFor3ns1CDVCTF!\n\nhttps://drive.google.com/file/d/1SQ9qv-hXO4jfzWovmw83qauh4vnFrSKd/view\n"}, {"name": "The Breakage", "desc": "Two young thugs have robbed the Louvre Museum.\nThe police have managed to arrest them as they left the museum, but they need your help.\nThey have seized the phones of the two thieves but have been unable to unlock them.\nThey are counting on you to help them unlock these phones by providing them with the PIN code and the password.\n\n    Format: DVCTF{PIN:PASSWORD}\n    TheBreakage.zip SHA256: 939ebda2376a5a51d8f344b6bcc4a2b3ba2474f4f29876c083b9fb545c9bd349\n    File: https://drive.google.com/file/d/1N_fwg99Eph7984-buFW54bbFQ4_ETtk0/view Password: Th3Br34K4g3For3ns1CDVCTF!\n\nhttps://drive.google.com/file/d/1N_fwg99Eph7984-buFW54bbFQ4_ETtk0/view\n"}, {"name": "Volinux", "desc": "Volinux is a great tool :)\n\nQuestions:\n\n    What is the Linux kernel version of this memory dump?\n\n    What was the command used to run website on the machine?\n\n    From which path the php command was executed?\n\n    What is the IP address of the machine?\n\n    What is the MAC address of enp0s8 interface?\n\n    When was the linux session started?\n\n    An attacker has uploaded a file to the machine. What is the inode address of the file?\n\n    What's the name of parent process of php process?\n\nFlag format: DVCTF{md5(Part1:Part2:Part3...Part8)}\nFlag example: DVCTF{md5(7.6.0–154-generic:docker compose up -d:/home/user/Downloads:192.0.0.1:0b:05:52:a5:6c:d6:2025-04-17 15:59:27.834698 UTC:0x9f350c940048:chromium)} > DVCTF{74bd73e4de5cf5e7803b73a9a73308a4}\n\n    File: https://drive.google.com/file/d/1LEti66LkCzfVCnS7NRBQZZF0YWZiuPfT/view Password: V0l1nuxFor3ns1CDVCTF!\n    Volinux.raw SHA256: FA3F1E0CD2404F3616E9A639F05C274AAEFF8EB4BE6F29DEB9B9E53C2879F577\n\n🚨Give feedback here: Framaforms\nhttps://drive.google.com/file/d/1LEti66LkCzfVCnS7NRBQZZF0YWZiuPfT/view\n\nhttps://github.com/mattft0/volinux/tree/main\n\n"}], "misc": [{"name": "Conways Pattern", "desc": "By searching the incoming virtual expositions of the Louvre museum I found a strange file but it seems I got it one generation too late. Can you manage to retrieve information from it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/misc/Conways_Pattern/chall.rle"]}], "osint": [{"name": "1 Research", "desc": "You have been found by the OCBC (Office central de lutte contre le trafic des biens culturels - Central Office for Combating Trafficking in Cultural Property). To guarantee your freedom, you must cooperate : if you manage to provide all the information relating to the investigation, no charges will be brought against you.\n\nLast week, there was a burglary at the Musée du Louvre. The main objective of OCBC is to find stolen works before they are found on the black market.\n\nWe know from our sources that it would be a certain Willow Wool who will put the works for sale. He is one of the largest dealers in stolen art, and he does not act alone.\n\nYour investigation will start by finding in which country he is located, in which town is the head office of his workplace, as well as the monument closest to his current place of \"work\".\n\nFlag format : DVCTF{Country_Town_Monument}\n\n    Hint: He has a very strong opinion about his enterprise\n\nSpaces are replaced by \"-\".\n"}, {"name": "A Reconnaissance", "desc": "You have been found by the OCBC (Office central de lutte contre le trafic des biens culturels - Central Office for Combating Trafficking in Cultural Property). To guarantee your freedom, you must cooperate : if you manage to provide all the information relating to the investigation, no charges will be brought against you.\n\nInitially, you will be asked to scout the Louvre in order to understand how the museum is structured and to obtain crucial information. Your mission is to collect the following data :\n\n    Number of glass panels that make up the Louvre pyramid\n    Month the Louvre was inaugurated\n    Total surface area of the Louvre (in m2)\n    Name of the oldest work exhibited in the Louvre\n\nThis information is essential for the current survey. Once you have collected this data, you will need to compile it into a flag in the following format : DVCTF{number-of-panels_month_total-area_piece-name}\n\nFor example, if you found : 100 panels, july, 1000 m2, and La Joconde, the flag would be : DVCTF{100_july_1000_la-joconde}.\n"}, {"name": "B Prevent", "desc": "You have been found by the OCBC (Office central de lutte contre le trafic des biens culturels - Central Office for Combating Trafficking in Cultural Property). To guarantee your freedom, you must cooperate : if you manage to provide all the information relating to the investigation, no charges will be brought against you.\n\nWe have identified that the following works will be attempting to be stolen shortly :\n\n    Les trois dames de Gand\n    Dame à sa toilette (Pieter Jacobsz Codde)\n    Le Lion de Florence (Nicolas André Monsiau)\n\nYour mission is to find the name of the AILE in which the items are stored, as well as their main inventory number.\n\nThe flag is in the form : DVCTF{AILE1-RF1_AILE2-RF2_AILE3-RF3}.\n\nExample:\n\n    Artwork 1 in the DaVinci AILE with RF number 123\n    Artwork 2 in the Leonardo AILE with an RF number 456 789\n    Artwork 3 in the Mona Lisa AILE with an RF number of 1011\n\n=> DVCTF{DAVINCI-123_LEONARDO-456789_MONA-1011}\n"}, {"name": "C Coordinates", "desc": "You have been found by the OCBC (Office central de lutte contre le trafic des biens culturels - Central Office for Combating Trafficking in Cultural Property). To guarantee your freedom, you must cooperate : if you manage to provide all the information relating to the investigation, no charges will be brought against you.\n\nWhile one of the security guards was doing his rounds, he noticed a strange inscription on one of the walls of the Sully wing on level 1.\n\n\"E 3023; N2290\"\n\nFind the place of origin to which the inscription refers.\n\nThe flag is in the form: DVCTF{Place-Of-Origin}.\n"}, {"name": "D Hidden", "desc": "You have been found by the OCBC (Office central de lutte contre le trafic des biens culturels - Central Office for Combating Trafficking in Cultural Property). To guarantee your freedom, you must cooperate: if you manage to provide all the information relating to the investigation, no charges will be brought against you.\n\nThanks to the information you have provided, our in-house teams have been able to identify a member of the organisation. His name is Victor Leclair and we know that he and his team operate on an online platform. Your mission is to find the organisation's website.\n\nThe flag is in the form: DVCTF{google.com}.\n"}], "pwn": [{"name": "Monalishack", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/pwn/Monalishack/Monalishack"], "desc": "It seems that the thief exploited a vulnerability in one of the Louvre's internal programs to access sensitive information.\n\nCould it be possible to identify the path taken by the attacker?\n\n    Flag format : DVCTF{}\n"}], "radio": [{"name": "Text the Waves", "desc": "Peu de temps après le vol, l’affaire explose dans les médias. Télévision, journaux, radio... tout le monde en parle. Mais dans ce tumulte médiatique, un détail est passé inaperçu : les voleurs ont trouvé un moyen de dissimuler leurs communications à travers les ondes. Votre mission : analyser cette capture provenant d’une chaîne radio bien connue. Une transmission en apparence anodine pourrait bien cacher une communication codée... https://drive.google.com/file/d/1YlT4KlOaC_I-rJH8_t5L5rKj_d0fujRD/view\n\nPassword: wPeGMyDc2UjL\nhttps://drive.google.com/file/d/1YlT4KlOaC_I-rJH8_t5L5rKj_d0fujRD/view\n"}, {"name": "Traque en haute altitude", "desc": "Nous pensons que le voleur s’est enfui à bord d’un aéronef. Heureusement, la tour de contrôle a réussi à capturer un signal entre 1030 et 1090 MHz provenant de cet engin.\n\n    Format du flag : DVCTF{INDICATIF_ALTITUDE_VILLE-SURVOLEE}\n\nTraque.zip Password: wPeGMyDc2UjL\nhttps://drive.google.com/file/d/1MoZ68coTQ3Nsyj8aDdgmbUg2qgvCzDtX/view\n"}], "rev": [{"name": "Davinci Click", "desc": "My friend created a cookie clicker style game with a twist, at 10 million clicks something happens.\n\nFile: https://drive.google.com/file/d/1_MUOAf2uNO1xbo-YsMJZCOQTZfEEjw7u/view\n"}, {"name": "Infected Brick", "desc": "Un des gardiens du musée a téléchargé une application suspecte peu de temps avant le vol. Nous suspectons qu’il s’agit d’une application malveillante utilisée par les voleurs pour étudier la sécurité du musée. Pouvez-vous étudier cette application et identifier les données dérobées ?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/rev/Infected_Brick/tetris.apk"]}, {"name": "Synthesize me", "desc": "Les voleurs ont obfusqué un secret dans le binaire. A vous de le retrouver.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/rev/Synthesize_me/synthesize_me"]}, {"name": "VinciVault", "desc": "Une application oubliée a refait surface. Elle renfermerait un secret... Saurez-vous le percer ?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/rev/VinciVault/VinciVault.ipa"]}], "steg": [{"name": "ERR0R a4", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/steg/ERR0R_a4/Corrupted_NFT.png"], "desc": "With your team, you successfully stole the latest database from the Louvre, which is digitizing its artworks as NFTs! Unfortunately, when you connected the NFT database to your computer, it got infected with a virus, destroying all your data and the loot you thought you had stolen. Someone else must have gotten there before you, and unfortunately, you were only able to recover this corrupted image. An amateur like him must have left traces! Flag format: DVCTF{Michel_The_Hacker}\n"}, {"name": "In the Shadow of the Mona Lisa", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/steg/In_the_Shadow_of_the_Mona_Lisa/Baltimore.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/steg/In_the_Shadow_of_the_Mona_Lisa/Isleworth.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/steg/In_the_Shadow_of_the_Mona_Lisa/Prado.jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/steg/In_the_Shadow_of_the_Mona_Lisa/Torlonia.png"], "desc": "I intercepted all these copies of Mona Lisa but what I want is the real one...\nThe flag is the MD5 hash of the picture\n\n    DVCTF{MD5Hash}\n"}, {"name": "Packet s Portrait", "desc": "Mona has been stolen! But stealers have let a small pcap file behind\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/steg/Packet_s_Portrait/finalchall.pcap.xz"]}], "web": [{"name": "LouvreArchives", "desc": "Deep beneath the Louvre Museum, a restricted archive holds the portraits of 650 historical figures, each stored away from public eyes. Only those with the right credentials may view them. Your credentials grant you access to only one portrait, but the rest remain hidden.\n\nObjective : View the flag.webp image.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/web/LouvreArchives/app.py"]}, {"name": "Tar boom", "desc": "Within the Louvre Museum's intranet, there is a service that allows trusted users to upload .tar files and view their content. However, this service has been exploited by a hacker. He was able to retrieve crucial information about the Louvre's security, hidden within the file flag.txt.\n\n    there's no debug run on the server app\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DaVinciCTF/2025/web/Tar_boom/tarboom.zip"]}]}