{"crypto": [{"name": "0ff Again On Aga1n", "desc": "Shamel crypto\n\nCreated by: Shamel\n\nThis note was left after a recent DEADFACE attack; they know how much we love puzzles. The rest of the team is still dealing with the fallout but maybe you can figure out what is says. Who knows, there might even be a clue in there.\n\nSubmit the flag as flag{H1DD3NM355@G3}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/0ff_Again_On_Aga1n/image.png"]}, {"name": "B1Tz and B0tZ", "desc": "Shamel crypto\nCreated by: Shamel\n\nYet another message was left at the scene. Perhaps they think they are giving us a lesson…either way report back to us what this says but dont give us guesses! Make sure you check your work!\n\nSubmit Flag as flag{hiddenmessage}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/B1Tz_and_B0tZ/bitsandbots.txt"]}, {"name": "Coin Code", "desc": "syyntax crypto\nCreated By: syyntax\n\nWe found this image of a coin that belongs to a member of DEADFACE. The image has something to do with the encoded message. We believe the message indicates who this DEADFACE actor wants to target next. Figure out who the target is.\n\nSubmit the flag as flag{Target Name} (e.g., flag{Bob's Auto})\n\nThe encoded message reads: Fwpl lsjywl xgj ew oadd tw Smjgjs Hzsjes.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/Coin_Code/coin.jpg"]}, {"name": "HAM JAM", "desc": "Shamel crypto\nCreated by: Shamel\n\nIt seems as if there is an upcoming hack that the rest of DEADFACE is planning, but someone didn't seem to get the memo. So, instead of risking meeting up to share the date, one of them has used a ham radio to send a message we managed to intercept.\n\nWe also identified some chatter associated with the coded message, but we have not been able to figure it out. It’s possible there might be clues left on their message board?\n\nSubmit the flag as flag{Month-Day#}. Example: flag{DECEMBER-10}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/HAM_JAM/hamjam.wav"]}, {"name": "Halloween +1", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/Halloween_+1/Crypto9.mp4"], "desc": "RP-01? bonus\n\nCreated by: RP-01?\n\nIt is halloween time and I am ready for parties! However, my good friend Jack is stuck in this jail cell. Can you help me break him out? I snagged this weird video clip from their confidential folders, maybe it will help us.\n"}, {"name": "Letter Soup", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/Letter_Soup/Deadface_Word_Search.png"], "desc": "twilight_sparkle crypto\nCreated by: twilight_sparkle\n\nWe believe we have ran into one of the newest members of DEADFACE while they were waiting for the train. The member seemed to have gotten spooked and stood up suddenly to jump on the train right before the doors shut. They seemed to have gotten away, but dropped this innocent looking word search. I believe this member might be actually a courier for DEADFACE. Let’s solve the word search to decode the mystery message. We believe the message might tell us their next move.\n\nSubmit the flag as flag{TARGETNAME} (e.g., flag{THISISTHEANSWER})\n"}, {"name": "Off the Rails", "desc": "Shamel bonus crypto\nCreated by: Shamel\n\nPlayers will have to figure out the hidden message left from one of the staff of DEADFACE CTF. This is one of Shamel's favorite ciphers Enjoy!\n\nIOBTSHIASKLENJOCMEUAGTGLTNTUYUIIOTEALHVAPOYALWEADNOSMSAYOISORLGSHSADHUSSRBTNRSEOHONEYERVYFIONO\n\nSubmit the flag as: flag{thisandthat}.\n"}, {"name": "Reflections", "desc": "syyntax crypto\nCreated by: syyntax\n\nApparently one of the DEADFACE members disclosed their public key in some fashion on GhostTown. We tried to decipher the contents but we can’t seem to figure it out. If you can figure out how to decode this public key, it might come in handy later!\n\nSubmit the flag as flag{flag text}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/Reflections/reflections2.txt"]}, {"name": "Slothy", "desc": "syyntax crypto\nCreated by: syyntax\n\nDEADFACE left an encoded message as a calling card after their latest attack. According to Ghost Town, d34th left a hint on social media.\n\ngnen\\x86\\x83\\x82N\\x88a`{4|}o\\x8d~\\x9e\\x8dUqcwtCu\\x8dX\\xa0ggg[<\\x7fd>¢\n\nSubmit the flag as: flag{plaintext}.\n\nNote: 25-pt hint is d34th's X account. 50-pt hint is cipher-related.\n"}, {"name": "Up in the Air", "desc": "Shamel crypto\nCreated by: Shamel\n\nWe found this unencrypted file that was shared between two members of DEADFACE, We haven't been able to understand what it means just yet but perhaps you can? Its supposed to be some sort of message or password to something but it just looks like nonsense.\n\nSubmit Flag as flag{H1DD3NM355@G3}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/crypto/Up_in_the_Air/password.txt"]}], "forensic": [{"name": "Tin Balloon", "desc": "Shamel for\nCreated by: Shamel\n\nWe've discovered that DEADFACE was somehow able to extract a fair amount of data from Techno Global Research Industries. We are still working out the details, but we believe they crafted custom malware to gain access to one of TGRI's systems. We intercepted a Word document that we believe mentions the name of the malware, in addition to an audio file that was part of the same conversation. We're not sure what the link is between the two files, but I'm sure you can figure it out!\n\nSubmit the flag as: flag{executable_name}. Example: flag{malware.exe}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/forensic/Tin_Balloon/Sequence%2001.mp3", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/forensic/Tin_Balloon/Untitlednosubject.docx"]}, {"name": "Whats the Wallet", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/forensic/Whats_the_Wallet/Bitcoin.txt"], "desc": "hotstovehove for\n\nCreated by: hotstovehove\n\nRansomware was recently discovered on a system within De Monne’s network courtesy of a DEADFACE member. Luckily, they were able to restore from backups. You have been tasked with finding the Bitcoin wallet address from the provided sample so that it can be reported to the authorities. Locate the wallet address in the code sample and submit the flag as flag{wallet_address}.\n"}], "network": [{"name": "Creepy Crawling", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/network/Creepy_Crawling/PCAP02.pcapng.xz"], "desc": "RP-01? pcap\nCreated by: RP-01?\n\nOne of our clients, TGRI, had an SSH server compromised at one of their smaller remote locations. Their only security analyst was fired and “accidentally” deleted information specific to the attack. Thankfully, TGRI still has the PCAP that captured the SSH brute force attack. What SSH protocol did TGRI run that was eventually compromised by DEADFACE?\n\nSubmit the SSH protocol as the flag: flag{SSH-1.1.1: Simple SSH Server}\n"}, {"name": "Git Rekt", "desc": "syyntax pcap\nCreated by: syyntax\n\nOne of our teammates at Turbo Tactical ran a phishing campaign on spookyboi and thinks spookyboi may have submitted credentials. We need you to take a look at the PCAP and see if you can find the credentials.\n\nSubmit the password as the flag: flag{password}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/network/Git_Rekt/pcap-20231010.pcap.xz"]}, {"name": "Have a Cup of Coffee", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/network/Have_a_Cup_of_Coffee/PCAP05.pcapng.xz"], "desc": "RP-01? pcap\n\nCreated by: RP-01?\n\nLytton Labs hired a company to do a pentest on a portion of their internal environment. Long story short, they weren’t satisfied with the service, so they’ve turned to Turbo Tactical to figure out what happened during the pentest. All they know is that the pentesters leveraged a security protocol used to authenticate service requests between trusted hosts across the internet.\n\nTurbo Tactical wants to replicate this during their pentest, but we want to know what kind of attack the pentesters leveraged.\n\nSubmit the attack type and the frame number of the attack as the flag: flag{syn scan 1234}.\n\nFree Hint: It will not be something as generic as “Brute Force”.\n"}, {"name": "Keys to the Kingdom", "desc": "Chuggs pcap steg\nCreated by: Chuggs\n\nAn image was sent across De Monne Financial’s network. They’re still paranoid after being the primary target of DEADFACE last year, and they suspect this is DEADFACE activity. We’re not sure what to make of the PCAP they sent us, but we found a file on the anomalous De Monne machine named keytothekingdom.txt. We suspect that contents of the file have undergone some form of encoding or encryption. See if you can piece these two things together to find the flag in the pcap.\n\nSubmit the answer as flag{here-is-the-answer}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/network/Keys_to_the_Kingdom/Thekeytothekingdom.pcap.xz"]}, {"name": "Sometimes IT Lets You Down", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/network/Sometimes_IT_Lets_You_Down/ITletsyoudown.pcapng.xz"], "desc": "RP-01? pcap\n\nCreated by: RP-01?\n\nLytton Labs has been having a slew of weird activity in the network lately. This recent PCAP capture we know contains a user account who compromised our domain controller. Can you figure out what user account was compromised?\n\nSubmit the flag as: flag{username}.\n"}], "prog": [{"name": "Dead Drop", "desc": "Wackoe100 prog\nCreated by: Wackoe100\n\nThe Incident Response Team at Aurora Pharmaceuticals recently recovered this file from a user’s computer. The artifacts indicate it was accessed by what they believe to be multiple DEADFACE members. The program appears to have set up the user’s workstation as a dead drop for DEADFACE members to convert a secret numerical code into a password string for further target access. Our decoding attempts have been unsuccessful, but the script appears to contain a recovery code that may be a good starting point.\n\nSubmit the flag as flag{the password} exactly how print_password() returns it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/prog/Dead_Drop/deaddrop.py"]}, {"name": "The CDR of the CAR RAH RAH RAH", "desc": "TheZeal0t prog\n\nCreated by: TheZeal0t\n\nThe LISP programming language (which stands for “Lots of Insane and Stupid Parentheses”) was used as an early form of list processing. There was even a “LISP COMPUTER” where the assembly language was LISP!\n\nLISP was famous (infamous?) for its numerous parentheses. Miss one, and the whole program fails!\n\nLISP had among its data types “atoms” (single items) and “lists” (multiple items), formatted like this:\n\n(apple tomato (grape bear (banana)) ((President Trump),(President Obama)))\n\nTwo of LISP’s most famous functions were car (which returns the first item in a list), and cdr (which returns all but the first item in a list). They could be used, together with recursion, to perform loops. In fact, early LISP had no native looping structure other than recursion.\n\nAttached to this challenge is a flat list of words. To obtain the flag, create a program in Python that calls emulated car and cdr functions (already provided for you) to produce the correct list. The list has to be grouped into a list of atoms and lists such that the program, as described by the Lytton, IN High School Basketball Cheerleaders, produces the correct list. Use their cheer to lay out the function calls in a series of nested calls…\n\nThe cheer goes like this:\n\nThe CDR (1) of the CAR!\nThe CDR of the CAR!\nThe CAR of the CDR of the CDR  of the CAR!\nThe CAR of the CDR of the CDR of the CAR (12)!\n\nHence, the first CDR (1) is the outermost call, and the CAR (12) is the innermost call. The single parameter is the complete list of words in the wordlist, grouped appropriately to produce the output list.\n\n(1)                 (12)\ncdr(car(cdr(car...  car(('fish', ('vermin','blatant',('ascent'...))))\n\nHere is the input wordlist as a flat list, without grouping, as well as the expected output and instructions for submitting your answer to obtain the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/prog/The_CDR_of_the_CAR_RAH_RAH_RAH/answer.txt"]}], "rev": [{"name": "Cereal Killer 01", "desc": "TheZeal0t re\nCreated by: TheZeal0t\n\nHow well do you know your DEADFACE hackers? Test your trivia knowledge of our beloved friends at our favorite hactivist collective! We’ll start with bumpyhassan. Even though he grates on TheZeal0t a bit, we find him to be absolutely ADORKABLE!!!\n\nChoose one of the binaries below to test your BH trivia knowlege.\n\nEnter the flag in the format: flag{Ch33ri0z_R_his_FAV}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_01/re01.dms", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_01/re01.exe.xz"]}, {"name": "Cereal Killer 02", "desc": "TheZeal0t re\nCreated by: TheZeal0t\n\nluciafer can be a bit of trouble sometimes, but she can put away the sugary monster cereals with the best of them! She has a favorite, too, and it is based on her favorite monster. See if you can figure it out! Select the binary for your preferred platform.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_02/re02.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_02/re02.exe.xz"]}, {"name": "Cereal Killer 03", "desc": "TheZeal0t re\nCreated by: TheZeal0t\n\ndeephax is rather paranoid about sharing personal information. He has a favorite cereal, but he doesn’t want to share that information with the government. You’re going to have to work at this one a little bit.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_03/re03.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_03/re03.exe.xz"]}, {"name": "Cereal Killer 04", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_04/CenoBytes.jar"], "desc": "TheZeal0t re\nCreated by: TheZeal0t\n\nlilith is not too old to have a favorite monster / ghoul / daemon / phantasm / poltergeist / creature / extraterrestrial or a favorite sugary breakfast cereal! She also has a favorite programming language (which no one else at DEADFACE likes that much, and they all think she is kinda weird for it). She probably mainly likes it because it was her first language she learned at the age of 9.\n\nSee if you can crack her program and figure out what her favorite cereal and entity are.\n\nEnter the answer as flag{LilithLikesMonsterCereal}.\n"}, {"name": "Cereal Killer 05", "desc": "TheZeal0t re\nCreated by: TheZeal0t\n\nWe think Dr. Geschichter of Lytton Labs likes to use his favorite monster cereal as a password for ALL of his accounts! See if you can figure out what it is, and keep it handy! Choose one of the binaries to work with.\n\nEnter the answer as flag{WHATEVER-IT-IS}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_05/re05.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_05/re05.exe.xz"]}, {"name": "Cereal Killer 06", "desc": "TheZeal0t re\nCreated by: TheZeal0t\n\nDark Angel has a favorite cereal, but don’t expect him to tell you what it is! He is a mercenary hacker that contracts to Lytton Labs, so he is extremely paranoid about protecting all of his personal information, even his favorite cereal! He treats it like a closely guarded government secret!\n\nChoose the Windows or Linux binary to see if you can defeat Dark Angel and get access to his deep, dark secret cereal!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_06/re06.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/Cereal_Killer_06/re06.exe.xz"]}, {"name": "My Daily Macros", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/My_Daily_Macros/HR_List.xlsm"], "desc": "hotstovehove re\n\nCreated by: hotstovehove\n\nDEADFACE has gotten hold of the HR departments contact list and has been distributing it with a macro in it. There is a phrase the RE team would like for you to pull out of the macro.\n\nSubmit the flag as flag{some_text}.\n"}, {"name": "STARvin for Secrets 1 Lindseys Lyrics", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/rev/STARvin_for_Secrets_1_Lindseys_Lyrics/MusicDownloader_Final.zip"], "desc": "t3harvinator Steph re\n\nCreated by: t3harvinator and Steph\n\nCreated by: t3harvinator and Steph\n\nSvetlana, an employee of Aurora Pharmaceuticals, navigated to Lindsey's Lyrics to download a program to enable her to convert Youtube videos to MP3 files. She was prompted to download MusicDownloader.exe and she did. The local network defenders got a notification that a sketchy file got downloaded so are investigating, They have called you in as their malware analysis expert. RE the executable and find the flags!\n\nSubmit the flag as: flag{text}.\n"}], "sql": [{"name": "Aurora Compromise", "desc": "syyntax sql\n\nCreated by: syyntax\n\nDEADFACE has taken responsibility for a partial database hack on a pharmacy tied to Aurora Pharmaceuticals. The hacked data consists of patient data, staff data, and information on drugs and prescriptions.\n\nWe’ve managed to get a hold of the hacked data. Provide the first and last name of the patient that lives on a street called Hansons Terrace.\n\nSubmit the flag as: flag{First Last}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/sql/Aurora_Compromise/System%20Design%20Specification.pdf", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/sql/Aurora_Compromise/aurora.sql"]}], "steg": [{"name": "Fetching Secrets", "desc": "syyntax steg\nCreated by: syyntax\n\nThis image was found on Ghost Town. Looks like one of DEADFACE’s newest members is new to steganography. See if you can find any hidden information in this image. Knowing information about the image may help to reveal the flag.\n\nSubmit the flag as: flag{flag_text}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/steg/Fetching_Secrets/cyberdog.jpg"]}, {"name": "The Wisdom of Knox", "desc": "TheZeal0t steg\n\nCreated by: TheZeal0t\n\nOh, Why Should the Spirit of Mortal be Proud?\n\nby William Knox, 1789 – 1825\n\nI. Oh, why should the spirit of mortal be proud?\nLike a swift-fleeing meteor, a fast-flying cloud,\nA flash of the Lightning, a break of the wave,\nMan passes from life to his rest in the grave.\n\nII. The leaves of the oak and the willow shall fade,\nBe scattered around and together be laid;\nAnd the young and the old, and the low and the high,\nShall molder to dust and together shall lie.\n\nIII. The infant, a mother attended and, loved,\nThe mother, that infant’s affection who proved,\nThe husband, that mother and infant who blessed,\nEach, all, are away to their dwellings of rest.\n\nIV. The maid, on whose cheek, on whose brow, in whose eye,\nShone beauty and pleasure––her triumphs are by;\nAnd the memories of those who have loved her and praised\nAre alike from the minds of the living erased.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/steg/The_Wisdom_of_Knox/wok.txt"]}, {"name": "Youve Been Ransomwared", "desc": "RP-01? steg crypto\n\nCreated by: RP-01?\n\nDEADFACE is taunting GlitterCo with their latest ransomware attack. According to our intel, the attackers like to leave a calling card in their attacks. If we can figure out which DEADFACE actor executed this attack, we might be able to figure out a way around paying. Can you find anything in this screenshot that might point to which attacker ran this ransomware attack?\n\nSubmit the flag as flag{attacker_name}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2023/steg/Youve_Been_Ransomwared/ransomwared.png"]}]}