{"crypto": [{"name": "4^2x4^2", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/4%5E2x4%5E2/4%5E2x4%5E2.zip"], "desc": "Shamel cryptography\nShamel\n\nRecovered from chat logs, we think this is supposed to be the password for an encrypted file. As you can tell, it is anything but complete.\n\nI know it's a bit time consuming, but see if you can figure the rest out.\n\nHint: Use 7zip \"Hey y'all, Shamel here, I messed up the password for the zip file, please replace all lowercase p characters with Uppercase P characters\" \"also use the photo to get the correct answer the ods file seems to flip the puzzle\"\n\nSHA1: d4a42fc3354221356edd0a12064f6713f53070e6\n"}, {"name": "Awww Sheet", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Awww_Sheet/Deadface_Doldrum.zip"], "desc": "Shamel cryptography\nCreated By: Shamel\n\nIt appears DEADFACE has shifted its focus to the music scene, but I'm not convinced this is just about melodies and rhythms. There's something more to this—I'm certain it's some kind of coded message.\n\nWhile deciphering sheet music isn't my area of expertise, I'm confident you'll know how to crack this. I’m assigning this mission to you—dig into it and uncover what DEADFACE is hiding.\n\nStart by exploring Ghost Town—there may be some hidden clues to help you unravel this mystery.\n\nTry NOT to REST on this too much, this needs to be solved soon.\n\nSHA1: 5eff4e43a6099195af2665340ddc96d8bbb0210b\n"}, {"name": "Cogs in the Machine", "desc": "syyntax cryptography\nCreated By: syyntax\n\nWe intercepted this internal communcation between DEADFACE members, but all of our attempts to decipher the message have failed. Use your skills in cryptanalysis to decipher the hidden message.\n\nSubmit the flag as flag{flag-text}.\n\nSHA1: 3414deba9788a60c04927cc30ef2606bfb4d66c9\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Cogs_in_the_Machine/ciphertext.txt"]}, {"name": "Da Cube", "desc": "Shamel cryptography\nCreated By: Shamel\n\nThis image was intercepted between deephax and mirveal. It sorta looks like well… I mean, it's obvious, but the scrambled text certainly isn't helping. See if you can find the key to this puzzle lying around.\n\nSHA1: a7b27c450d0ae5db6b0f6febe0937f07aef1c2e9\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Da_Cube/image.png"]}, {"name": "Discreet Logging", "desc": "neatzsche cryptography\nCreated By: neatzsche\n\nDEADFACE is running a server that is used to crack encryption of some sort. They didn’t secure their log server, so we have their logs. Please find out what key they cracked.\n\nSubmit the flag as flag{...}.\n\nSHA1: 00e5caccac909f3a518a4e7a932370a324aca82f\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Discreet_Logging/ecdh_crack_20241013.log"]}, {"name": "Drink Up", "desc": "syyntax cryptography\nCreated by: syyntax\n\nWhile responding to a recent security incident, TGRI found the following image on an employee’s compromised machine. We need to confirm which DEADFACE actor attacked TGRI.\n\nThere’s probably one or more hints in the image that will point you in the right direction.\n\nSubmit the flag as flag{flag}.\n\nzxk1ehfZ/kx7tzSyQeSm2XuGitnxsN8rG/mwxNaCjFFc2rCrTTWpwViZFpwI4xRccvdwm/Ta6l3GFeaPs96l7BPziIu+DsfoS6bdy5ByHSyW+D5bCgtTCuoVvMOlPC7xILtjlt6/Ky6ZPaV40gfmtM/iuRGR+zveFLNyWy9Tlu3TnOaq0lP6wp65lGEFBTHPSwho0jIP47pxoKryxnh7svJrTD1wh+D+YudNjDpPr39yH/iMlU+5xiK2dXjiD0UtL3vSSQ55MLCPpN/kFW6AuO2OEuadKXg2XYiXnAkLJcUxGdZhP7+Lo4LG3m5HsHdBmul5pX9gcvERFQSZOy2QfEv3+vRfLfoJPq6WQnBjwXUoVo/YHeD8SS+TDvg=\n"}, {"name": "Ides le Talk", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Ides_le_Talk/Mischiefs-English-HW.txt"], "desc": "Shamel cryptography\nCreated By: Shamel\n\nWe intercepted a file from one of DEADFACE’s more amateur members. They claim that they hid a password in a text file. When we looked at the file, it’s indecipherable jibberish. We believe a common cipher was used to hide the message (and the password). As far as possible keys goes, maybe it can be determined by the author of the original text?\n\nSubmit the flag as flag{flag-text}\n\nSHA1: d4239fe9e80cdcad49939edd1bbcf4b811f9286a\n"}, {"name": "Killer Curve", "desc": "neatzsche cryptography\nCreated By: neatzsche\n\nDEADFACE is using a program with a service hosted at killercurve.deadface.io:4444 to encrypt secret files they are sending. Find the private key that is used to derive the shared secret used to encrypt the file.\n\nTHE CLIENT IS WRONG, IT IS SECP256R1\n\nSubmit the flag as flag{...}.\n\nSHA1: e091d737656cb8e41cc201505a64b5a7cb54594f\nPassword: d34df4c3\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Killer_Curve/killercurve.zip"]}, {"name": "Logical Left and Rational Right", "desc": "Shamel cryptography\nCreated By: Shamel\n\nDEADFACE left this artifact with one of their victims. Can you decipher what it says?\n\nSubmit the flag as flag{flag-text}\n\nSHA1: 60405cade14b21f385265c4e5e0efadbc971e607\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Logical_Left_and_Rational_Right/logicalleftrationalright.txt"]}, {"name": "Sleeping Marble Beauty", "desc": "TheZeal0t cryptography steganography\nCreated By: The Zeal0t\n\nSleeping Marble Beauty\n\nPhantastes, by George MacDonald\n\n(Decode TheZeal0t’s personal recommendation / Words of Wisdom for how you should normally proceed in this situation…)\n\nSubmit the flag as flag{flag-text}\n\nSHA1: fb0cc233849c7a83f7536389eec6346f881fbd2c\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/crypto/Sleeping_Marble_Beauty/marble-lady-CN.txt"]}, {"name": "Social Pressure", "desc": "syyntax cryptography\nCreated by: syyntax\n\nWe intercepted this chat log between luciafer and lilith. We believe they’re discussing who or what they will target for their social engineering campaign.\n\nDecode the message and submit the name of the target. The key is to remember that sometimes the simplest solutions are just waiting to be reflected upon.\n\nSubmit the flag as flag{First_Last}.\n\nluciafer 1:19 PM\nSvb ororgs, yrt mvdh! Dv'iv tlrmt zugvi Wv Nlmmv Urmzmxrzo mvcg. Gsvri hvxfirgb nvzhfivh szev hlnv slovh gszg dv'iv tlmmz vckolrg yrt grnv! R'ev yvvm klprmt zilfmw zmw ulfmw hlnv HJO efomvizyrorgrvh dv xzm oveviztv uli nzcrnfn xszlh.\n\nIvnvnyvi gszg RG tfb R nvmgrlmvw yvuliv? Gfimh lfg, sv’h z ivzo xszggb Xzgsb lm hlxrzo nvwrz. Gsrmp dv xzm fhv hlnv tllw lo' hlxrzo vmtrmvvirmt gl lfi zwezmgztv. Dv’oo tvg srn hkvdrmt kzhhdliwh orpv z ovzpb uzfxvg. Kofh, drgs blfi LHRMG hprooh zmw nb HJO nztrx, gsvb dlm’g hvv dszg srg 'vn.\n\nlilith 1:20 PM\nR'ev zoivzwb hgzigvw hlnv LHRMG ivxlm zmw tfvhh dszg? Ulfmw hlnv qfrxb wvvgh zylfg gsvri RG gvzn lm OrmpvwRm. Kvlkov levihsziv hl nfxs, rg'h kizxgrxzoob z tlownrmv. Hlxrzo vmtrmvvirmt gszg xszggb wfwv hslfow yv z yivvav; R'oo xizug z ovtvmw gszg'oo szev srn hkroormt vevibgsrmt.\n\nluciafer 1:21 PM\nBzzzh, gsrh rh tlmmz yv ovtvmwzib! Olermt gsv vmgsfhrzhn. Zmw Voilb Lmtzil? Gszg tfb'h kizxgrxzoob iloormt lfg gsv ivw xzikvg uli fh drgs sld nfxs sv hszivh lmormv. Xzm'g yvorvev sld vzhb hlnv lu gsvhv gzitvgh nzpv rg.\n\nlilith 1:22 PM\nZyhlofgvob! Voilb Lmtzil szh ml rwvz dszg'h xlnrmt srh dzb. R'ev zoivzwb tlg z uvd zmtovh rm nrmw gl tvg srn gzoprmt. Hlxrzo vmtrmvvirmt gsvhv gbkvh rh zodzbh z gsiroo.\n\nR'oo hgzig wizugrmt hlnv kvihlmzh zmw hxirkgh. Lmxv sv'h fmwvi lfi rmuofvmxv, dv xzm lixsvhgizgv gsv HJO vckolrg hvznovhhob. Blfi vckvigrhv rm gszg zivz rh tlrmt gl yv xifxrzo.\n"}], "misc": [{"name": "Big Fish", "desc": "syyntax traffic analysis\nCreated By: syyntax\n\nDisclaimer: Please note that files extracted from the PCAP may trigger antivirus alerts due to its nature. This is expected in many challenges involving potentially malicious or suspicious code. It is strongly recommended to analyze or execute files in a controlled environment, such as a virtual machine (VM), to ensure the safety of your system. Always exercise caution when handling executable files.\n\nTGRI employee Garry Sartoris fell for a phishing attack recently. It’s hard to say what DEADFACE was after, but Turbo Tactical needs your help looking through the attack artifacts. Take a look at this PCAP and submit the attacker’s IP address.\n\nSubmit the flag as flag{IP Address}.\n\nSHA1: d90eaf6796a469f4a38d22c7b83caedadff99ee5\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/Big_Fish/phantom.zip"]}, {"name": "Cereal Killer 01", "desc": "TheZeal0t reverse engineering\nCreated By: TheZeal0t\n\nThis year, America's politicians are weighing in on the IMPORTANT issues... As in, which spooky cereal is best?\n\nMr. Robert F. Kennedy, Jr. has a favorite spooky cereal. Tear apart this binary and see if you can figure out what it is!\n\nSubmit the flag as flag{flag-text}. Example: flag{cocoaricepuffkrispiesbutter}\n\n SHA1: 2d9622f99cc3f4da60b417078f5b24560bf2286f\nPassword: d34df4c3\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/Cereal_Killer_01/cerealkiller01.zip"]}, {"name": "Cereal Killer 02", "desc": "TheZeal0t reverse engineering\nCreated By: TheZeal0t\n\nThis year, America's politicians are weighing in on the IMPORTANT issues...! As in, which spooky cereal is best?\n\nVice President Harris has a favorite spooky cereal. Tear apart this binary and see if you can figure out what it is!\n\nSubmit the flag as flag{flag-text}.\n\n SHA1: 34fbc0f69498fc8998c254de1676e988ab39ba70\nPassword: d34df4c3\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/Cereal_Killer_02/cerealkiller02.zip"]}, {"name": "Cereal Killer 03", "desc": "TheZeal0t reverse engineering\nCreated By: TheZeal0t\n\nThis year, America's politicians are weighing in on the IMPORTANT issues...! As in, which spooky cereal is best?\n\nPresident Biden has a favorite spooky cereal. Tear apart this binary and see if you can figure out what it is!\n\nSubmit the flag as flag{flag-text}.\n\n SHA1: 0a6892d157c6fcdf6e2f16a73f19a5350cb8264a\nPassword: d34df4c3\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/Cereal_Killer_03/cerealkiller03.zip"]}, {"name": "Cereal Killer 04", "desc": "TheZeal0t reverse engineering\nCreated By: TheZeal0t\n\nDisclaimer: Please note that the attached file may trigger antivirus alerts due to its nature. This is expected in many challenges involving potentially malicious or suspicious code. It is strongly recommended to analyze or execute files in a controlled environment, such as a virtual machine (VM), to ensure the safety of your system. Always exercise caution when handling executable files.\n\nDr. Geschichter of Lytton Labs is working on a new way to influence young children to do his evil bidding. He's using MONSTER CEREALS to DO IT!!! He is putting trigger words on the cereal boxes, so while the kids are eating their cereals and reading the boxes, they will ACTUALLY be reading their ACTIVATION CODES that put them into a hyper-suggestible state. Then, using Neuro-Linguistic Programming (NLP) and Subliminal Seduction, he plans on programming them to carry out his nefarious plans!\n\nSubmit the flag as flag{flag-text}.\n\n(So... Dr. Geschichter is a BOOMER, so I think there is a tiny flaw in his plan. This is now 2024, and I don't think Charles realizes that kids no longer READ the cereal boxes while they are eating their cereal. They are usually staring at iPhones or iPads while doing that. But please, don't tell HIM that... we'd really want to keep kids away from MK Ultra!!!)\n\n(There is a chance this program will trigger an Anti Virus alert. In that case, make an exception for it. It is safe, I assure you… unless you run it while reading the back of a cereal box…)\n\nSHA1: fdde7496f0f6264530a13a7d471c1164e2a2c327\nPassword: d34df4c3\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/Cereal_Killer_04/cerealkiller04.zip"]}, {"name": "Cereal Killer 05", "desc": "TheZeal0t reverse engineering\nCreated By: TheZeal0t\n\nThis year, America's politicians are weighing in on the IMPORTANT issues...! As in, which spooky cereal is best?\n\nPresident Donald Trump also has a favorite monster cereal, but it is secured by a password. As a test of your hacking mettle, oh great Turbo Tactical nerd, we need you to hack the program and gain access to the flag. Good luck!\n\nSubmit the flag as flag{flag-text}.\n\n SHA1: 03eb861fd8e07e42f5d76e2e231be43a8394a2b5\nPassword: d34df4c3\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/Cereal_Killer_05/cerealkiller05.zip"]}, {"name": "Image of the Beast", "desc": "TheZeal0t steganography\nCreated By: Shamel\n\nUh-oh. It seems like Clippy can’t catch a break! First he got sent to HR and demoted two years ago for smarting off to his software users, and then last year he got PIP’ed and demoted AGAIN for not properly generating secure passwords for Lytton Labs! As a result, Turbo Tactical got access to ALL of Lytton Labs' documents regarding their evil experiments on teenagers! Lytton Labs is currently under investigation, but Dr. Geshichter is pretty slick… we expect that he’ll get away again.\n\nIt seems Dr. Geschichter is now trying to MK-ULTRA little children by taking control of their minds with cereal boxes! We must STOP this madness before Dr. Geschichter gains more power over the children!\n\nWe think Clippy is ready to help us by giving us information that will help us ruin these plans. It seems that Lytton Labs is offering a tour of the new Academy that was built last year to a small number of lucky winners of their sweepstakes. We need to get one of our people in on that tour, and we think we can do that if you can hack the Sweepstakes Golden Ticket generator and get a Golden Ticket for our agent.\n\nHead over to Lytton Lab’s Lead Engineer’s (Karen Wrapper) Github repository. Clippy said he will leave us information there.\n\nSubmit the flag as flag{flag-text}\n\nhttps://github.com/karenwrapper\n"}, {"name": "Mal Where is My Mind 00", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/Mal_Where_is_My_Mind_00/Mal-Where%20is%20my%20mind.zip"], "desc": "Deputy_Doge reverse engineering\nCreated By: Deputy_Doge\n\nThe SOC team managed to quarantine an executable we think was left behind by DEADFACE actors. Unfortunately, they didn’t tell us what the password to the sample was. Can you figure out what the password is so we can start analyzing?\n\nSubmit the flag as flag{flag-text}\n\nSHA1: 453c474856ee2ac50e184a8feba5526c7736116f\n"}, {"name": "dead browse 1", "desc": "neatzsche reverse engineering\nCreated By: neatzsche\n\nDEADFACE has created a site http://deadbrowse.deadface.io:3000 and a browser that goes along with it. Figure out how to access the site!\n\nSubmit the flag as flag{flag-text}\n\nSHA1: 4a7e106c9fcb0a22121191b5196803e98bbf3483\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/misc/dead_browse_1/dead_browse.zip"]}], "net": [{"name": "Data Breach", "desc": "RP-01? traffic analysis\nCreated By: RP-01?\n\nWe suspect an internal employee is leaking sensitive information, but the source remains unclear. We've captured network traffic for analysis. Your mission is to investigate the data and locate the hidden flag.\n\nCan we count on your expertise to track it down?\n\nSubmit the flag as flag{flag-text}.\n\nDownload PCAP (342KB)\nSHA1: 48744d0b724fc30f660a7953b5e974320b60a47c\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/net/Data_Breach/databreach.zip"]}, {"name": "Unusual Exfiltration", "desc": "neatzsche traffic analysis\nCreated By: neatzsche\n\nNetwork logs from a machine DEADFACE compromised are being analyzed. It seems something was exfiltrated to their proxy machine on the local network before being sent back to their C2 server. Can you help figure out what data was stolen?\n\nSubmit the flag as flag{flag-text}\n\nSHA1: 00cbc381589aac82eae081c7d40ce7b0f4d46645\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/net/Unusual_Exfiltration/unusualexfil.zip"]}, {"name": "Wild Wild West", "desc": "RP-01? traffic analysis\nCreated By: RP-01?\n\nWoah, our network has been lighting up like the fourth of a July on steroids, I tell you HWHAT. Now, given that we had a user call in complaining about weird stuff happening, I think it is about time you cowboy up and figure out what is happening in our here network.\n\nSubmit the flag as flag{flag-text}.\n\nDownload PCAP (394KB)\nSHA1: e6959efe4522d92aa18c8ea15d8614fcfbdaee59\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/net/Wild_Wild_West/wildwildwest.zip"]}], "osint": [{"name": "Hidden in Plain Site", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/osint/Hidden_in_Plain_Site/OSINT07.png"], "desc": "RP-01? osint\nCreated By:RP-01?\n\nWe captured a DEADFACE laptop! During our forensics, we discovered a file with a weird tag that said “Hidden Treasure Here”. Can you find the treasure's identification code using the image file?\n\nSubmit the flag as flag{flagtext}. The flag will begin with a G.\n\nSHA1: 4c3cad926969e1e5a214f15fa67d7d330e13c33b\n"}], "prog": [{"name": "Missing Pieces", "desc": "syyntax programming crypto\nCreated By: syyntax\n\nWe found this code from deephax that looks like it was built to hide a flag using some form of cryptography. The program is missing code that will reveal the flag. Try to fix the program and submit the flag.\n\nSubmit the flag as flag{flag_text}.\n\nSHA1: 895ca32d397db50ee2fe3ad7021a63efc5dc7582\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/prog/Missing_Pieces/missingpieces.c"]}, {"name": "The Silver Swan", "desc": "TheZeal0t programming\nCreated By: TheZeal0t\n\nChallenge details are provided in the code below.\n\n# !/usr/bin/perl\n\nuse strict;\nuse warnings;\n\n{\nmy $poem = <<'END_POEM';\n    The silver Swan, who, living, had no Note,\n    when Death approached, unlocked her silent throat.\n    Leaning her breast against the reedy shore,\n    thus sang her first and last, and sang no more:\n    \"Farewell, all joys! O Death, come close mine eyes!\n     More Geese than Swans now live, more Fools than Wise.\"\nEND_POEM\n...\n\nDownload and examine the files below. Do the TODOs. TMTOWTDI.\n\nSHA1: 6df819ec56fe54b54c1d413e4c0b24f15d6a9734\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/prog/The_Silver_Swan/the_silver_swan.zip"]}], "steg": [{"name": "Descended from Wolves", "desc": "syyntax steganography\nCreated by: syyntax\n\nThere’s an image circulating on GhostTown of some weird dog. Based on the conversation in the forum, it sounds like the image holds some data that lamia415 extracted from De Monne Financial. Use the context in the conversation to determine what was extracted.\n\nSubmit the flag as flag{flag-text}.\n\nSHA1: d004a397bd04d17cc0462cb9578877607be9e34a\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/steg/Descended_from_Wolves/princess.png"]}, {"name": "Electric Soldiers", "desc": "syyntax steganography\nCreated by: syyntax\n\nWe stumbled across this image from d34th that might indicate how DEADFACE plans to sneak stolen information through various networks without detection. According to Ghost Town, d34th has been refining his process for embedding hidden information in various files.\n\nSee if you can uncover any hidden information in this image. Submit the flag as flag{flag-text}.\n\nSHA1: 908b0d7d387832aa065feabf4aef2ae7a1158f30\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/steg/Electric_Soldiers/electricsoldiers.png"]}, {"name": "Offsite Targets", "desc": "syyntax steganography\nCreated by: syyntax\n\nlamia415 sent an image to daem0n with secret information about who or what they are building a campaign against. Turbo Tactical wants to lean forward on this and prepare any individuals or companies that might be targeted by DEADFACE. Find out what the hidden message is and submit the flag.\n\nSubmit the flag as: flag{text_here}.\n\nSHA1: e2f3ba840b59a0170010d9880ee1ff825d252f42\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/steg/Offsite_Targets/img20240803.jpg"]}, {"name": "Price Check", "desc": "RP-01? steganography\nCreated by: RP-01?\n\nDEADFACE has been hacking random people all over town and no one can seem to figure out what they are doing. All we know at this time is that the most recent site that was hit was Otto’s Grocery Store. Oddly, only the customers are being affected and not the company’s network. What is happening? They hired our firm to sniff out the attack and we successfully captured a strange file being sent across the guest WiFi. We believe this is the primary attack vector, and we’ve heard some victims mention that they had to “scan” something - maybe it is in the wrong format? Can you figure out how this file is being used in the attack to reveal the flag?\n\nSubmit the flag as flag{flag_text_here}.\n\nSHA1: 213f1e381da74815b8c347f3cc1c28a8c6675085\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/steg/Price_Check/STEG05.csv"]}, {"name": "Something in the Dark", "desc": "syyntax steganography\nCreated by: syyntax\n\nDEADFACE extracted a sensitive photo from Lytton Labs. As far as we can tell, it’s just a normal photo of a neighborhood at night, but the man who took the photo insists he saw something else. Here is the man’s original tweet. He later added the following image below.\n\nSubmit the flag as flag{flag_text_here}.\n\nSHA1: aa80a85127e85e410fdb6a207396fe7a7d0f7ac1\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/steg/Something_in_the_Dark/didyouseeit.png"]}, {"name": "Tri Harder", "desc": "syyntax steganography cryptography\nCreated By: syyntax\n\nThe security team at NexGen Softworks reached out to us regarding a potential tip about DEADFACE. They were alerted to unusual email traffic between one of their employees and a third-party vendor regarding infrastructure upgrades. The email chain looks fairly innocent, but NexGen’s SEIM flagged it as suspicious and they’re not sure why.\n\nSHA1: ca3498bb2908794ec3d61b23b6aad0e9d13657f7\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2024/steg/Tri_Harder/email.zip"]}]}