{"crypto": [{"name": "3 Card Call Stream 1", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/crypto/3_Card_Call_Stream_1/3cc_1.zip"], "desc": "@Shamel\n\n Created By: @Shamel\nThis one is a bit weird - there was a video left behind by DEADFACE on a thumb drive. It seems strange but the short video only shows pairs of cards with the message we found in a text file being “[A-K |7-10] [0000-1111 | 0000-1111] {01000001 =QH 10D}”. We can assume its part of some instructions to solve it.\n\nSubmit your answer as deadface{flag_text}\n\nSHA1: 137cf9158d700f73beff1e736bfb848225c81219\n"}, {"name": "Binary Mixup", "desc": "@G2Gh0st\n\n Created By: @G2Gh0st\nWhile doing some forensics on a machine over at the Night Veil University, a strange file was found. The file is a basic text file but it only contains the following binary numbers:\n\n0011 0100\n0011 0011\n0010 0110\n0101 0001\n0001 0010\n0010 0011\n0100 0011\n0100 0001\n0011 0110\n0011 0011\n0001 0011\n0010 0101\n0100 0001\n0101 0011\n\nThe team has no idea what this could possible mean…can you help them figure out the code and reveal the flag?\n\nSubmit the flag as deadface{flagtext}.\n"}, {"name": "CreepNet", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/crypto/CreepNet/CreepNet.zip"], "desc": "pcap crypto\n@AstralByte\n\n Created By: @AstralByte\nWe know that DEADFACE communicated back to one of their servers, but we're not sure how they did it. The junior analyst over at De Monne Financial doesn't see any communications through standard channels in their network traffic. So, how is DEADFACE communicating? See if you can find the message.\n\nSubmit the flag as deadface{flag text}.\n\nSHA1: 12345\n"}, {"name": "Fenceline", "desc": "@TheZeal0t\n\n Created By: @TheZeal0t\nDEADFACE left behind a note on a fence outside one of Aurora Pharmeceuticals offices:\n\nHe thrusts his fists against the posts… nattpader-ha-Ae{-wsnahD-!eHS-wtTak}ce-Uo--dna-spDHsgudfSl--eeukedtlad-emSainS-\n\nSubmit the flag as deadface{text}.\n"}, {"name": "Ghastly Gears", "desc": "@syyntax\n\n Created By: @syyntax\nWe intercepted this internal communcation between DEADFACE members, but all of our attempts to decipher the message have failed. Use your skills in cryptanalysis to decipher the hidden message.\n\nSubmit the flag as deadface{flag-text}.\n\n‌Fsqp: rhurk415\nIe: ljjkhwaoj\nVygplkc: dr: rrudok ld tig hwuw\n\n---\n\nne,\n\najp rge hlpjy nayx gvt dakljn zdfpth nz enxe qoga. rip tcqe tlkmz ikyff hwu exnvzxrz—jv’w gst ceuyz yeltwo.\n\nzltq, kubvm dazsixzfz rafpc jp xmk vxdpe.hmj. fcbdq ae c oje wa amfgexisly?\n\n\"mou dpq npxcee vpkel nca nzsu — xutm vpmis jisbfn fl hfz: ikhloknq{uw0jll_i3s3q_e1h}\"\n\nvxd ehft zx co’p hmqquxfta, lff mdk cgir emv ujhc rvdn etrwg ujtgvpfa cscs.\n\nwqwq yr xv qho bflc nqui.\n"}, {"name": "Poor Megan", "desc": "@TheZeal0t\n\n Created By: @TheZeal0t\nOh, NO! Poor MEGAN! She's just been bitten by a ZOMBIE! We can save her if we act fast, but the formula for the antidote has been encoded somehow. Figure out how to unscramble the formula to save Megan from certain zombification.\n\nSubmit the flag as deadface{here-is-the-answer}.\n\nThe formula for the antidote:\n\njLfXjLjXiwfBRdi9lx49nwKslcvxih=1mYval2e9nLfXmxGalwy9lwi9lLf9lwy9nMnaQh=1ihSqlwDVmsvajYvXmMG8jcvZkg=1mYvwkgz1jwKspb55\n\nQUICK! She’s starting to GURGLE!!!\n"}, {"name": "Secret Symbols", "desc": "@G2Gh0st\n\n Created By: @G2Gh0st\nThe team over at Turbo Tactical actually managed to steal a screenshot of a message between two DEADFACE players. It appears to reveal some details about a new encryption scheme, but the team can’t seem to crack the code. Can you help them out and decipher the code for them?\n\nSubmit answer as deadface{flagtext}\n\nSHA256: 12345\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/crypto/Secret_Symbols/crypto-screenshot.png"]}, {"name": "Winky Face", "desc": "Created By: @syyntax\nDEADFACE is taunting us again. We suspect they’re claiming a recent attack on De Monne Financial, but we’re not sure who the target is. They left this cryptic message which has us scratching our heads. Who is DEADFACE’s next target and what is their position?\n\nSubmit the flag as deadface{Firstname Lastname}. Example: deadface{John Smith Manager}.\n\n🥴😵💡😤🤑😖😖😵💡😡😱😖🥺😖🤮😱🥺😩😄😄😄💡😀🤑😗'😎😵💡🤒😵😵😖💡😯😗🫡💡🤑😖💡🫠🥺🫡🤮🥶😄💡😬😗😥🫡💡🫠🥺😱🫡💡😗😖🫡😱😩💡🫠😵💡🤮🤑😖🥴😗🤮🫡💡🤑😗🙄💡🙄🥺😖😥🤑😤🫠🥺🙄😵💡🥺🫡🫡🥺🤮😰💡🤑😖💡😬🤑🥶😖🥺🫡🥶🥺😖💡🙄😵😵🥴🪇💡😀🤑😗🙄💡😯🙄😵🤮😱🤑😗😥💡🤮😡🤑😄\n"}], "forensic": [{"name": "Whats the Password", "desc": "@Deputy_Doge\n\n Created By: @Deputy_Doge\nNote: All challenges in the Trojan Echoes series will use the same ZIP file provided here,\n\nFollowing the compromise of Lytton Labs, our security analysts compiled a list of suspicious files that could be related to the breach. You have been called in as the resident malware expert in order to determine if the executable is indeed malicious and, if so, what signatures can we extract in order to detect other compromised hosts.\n\nFind the flag labeled flag 00 and submit the flag as deadface{here-is-the-answer}.\n\nSHA1: b9369a2309362f41720779d6a7a9d0c44e764b36\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/forensic/Whats_the_Password/Trojan%20Echoes.zip"]}], "misc": [{"name": "The Source", "desc": "@syyntax\n\n Created By: @syyntax\nA department at TGRI was getting lazy with sensitive files. Rather than use the company’s approved filesharing application, a member used an application called MyShare and forgot to configure it to run HTTPS.\n\nDEADFACE found the site and were able to compromise it and steal several sensitive files. Based on DEADFACE’s past behavior, let’s assume that flags discovered may be used as DEADFACE passwords.\n\nFirst thing’s first: what is the IP address of the DEADFACE attacker? Submit the flag as deadface{X.X.X.X}.\n\nSHA256: 12345\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/misc/The_Source/artifacts.tar.gz"]}], "osint": [{"name": "Melody Way", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/osint/Melody_Way/OSINT05_-_Melody_Way.jpg"], "desc": "osint\n@3.14ro\n\n Created By: @3.14ro\nTilon is a mysterious figure who enjoys his poetic life. Mirveal has discovered an image from one of Tilon’s trips. Apperently he goes often there. Now all that’s left is to get the name of the building.\n\nFlag format: DEADFACE{building_name_across_the_road}\n"}, {"name": "Waff Waff", "desc": "osint\n@3.14ro\n\n Created By: @3.14ro\nMirveal is keeping his shenanigans Doxing people around the world. Now we need to find the location of a person that Mirvael compromised his phone.\n\nEnter the answer as deadface{Country_City_Street}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/osint/Waff_Waff/puppets.jpg"]}], "pwn": [{"name": "Haunted Library", "desc": "@SpiffyLich\n\n Created By: @AstralByte\nDEADFACE appear to be using this program as a way to let potential new recruits view info on their server, while restricting access to more important files…\n\nI tried my hand at it, but i didnt get too far before hitting a wall. I do have some discoveries that might help you, though:\n\n1.) I dont think we’ll be able to put shellcode on the stack…\n\n2.) getting started was a nightmare! but I found a program that makes it wayyy easier: https://github.com/io12/pwninit\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/pwn/Haunted_Library/hauntedLibrary.7z"]}, {"name": "Locked Out", "desc": "@SpiffyLich\n\n Created By: @SpiffyLich\nWe found this program on one of the old drives DEADFACE threw out. We think they’re using it on a server somewhere as a way for members to ‘log in…' and to keep other people out.\n\nNo password seems to work. Looking it over, it seems vulnerable enough-- but how on earth do you open a lock with no key?\n\nSubmit the flag as deadface{flag text}.\n\nSHA1: 57c90bfab249ef976846cce8fc586860a2ec7447\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/pwn/Locked_Out/lockpick.zip"]}], "rev": [{"name": "Cereal Killer 01", "desc": "@TheZeal0t\n\n Created By: @TheZeal0t\nThe Tech Bro AI Moguls are now getting in on the act! They all want to have favorite, spooky cereals, too! Unfortunately, since they can’t decide which they like the best, they are asking their respective LLMs.\n\nMr. Sam Altman, CEO of OpenAI, has a favorite “spooky” cereal. Choose your poison, Windows or Linux, and see if you can figure out which “spooky” (there it is again) he likes the best!\n\n(You only need to choose one platform.)\n\nDownload for Windows\nSHA1: 4dea230c0e130070b53209b4d8270e027bbc42c1\n\nDownload for Linux\nSHA1: 92d47cb7594673f2963354b87a7043dc7b2cdfef\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_01/ck01-2025-rev03.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_01/ck01-2025-rev03.exe.xz"]}, {"name": "Cereal Killer 02", "desc": "@TheZeal0t\n\n Created By: @TheZeal0t\nEccentric billionaire business person and space-bro, Evan Must (whose tag line is the cringe-worthy “Evan MUST Get to Mars!” has decided to fund the silly endeavor of populating Mars by selling Monster Cereal NFTs!\n\nThe NFTs exist on the official Monster Cereal NFT Block Chain, which has a custom extractor program and a “seed image” of the absolutely terrifying Jason Voorhees and his signature breakfast cereal, Machete Mateys!\n\nEvan has hidden a flag inside the blockchain, and he promises a handsome reward for the first person to extract it. We know that Lytton Labs, DEADFACE, and maybe even Cereal Killer himself are after this reward. We’d like to be there first! The issue is that the blockchain is protected with a proprietary algorithm. Reverse engineer the nft_extractor binary and discover how to unlock the rest of the blockchain.\n\nPick your poison (you only need one of these):\n\nDownload Linux nft_extractor.bin (3.26MB)\nSHA1: ba074872afcad52e318caffab3be8363a20811f4\n\nDownload Windows nft_extractor.exe (3.40MB)\nSHA1: 9d79a31a3802f6d4c23dd6cae671434f5967388e\n\nYou will need both of these.\n\nUnzip this file. The contents should be in a “nft_blockchain” directory.\n\nDownload Blockchain File (2.46MB)\nSHA1: 39cdb8c6496c5933bf8597315a7eec95f78012f6\n\nThis is an unencrypted JPEG file that is the start of the chain.\n\nDownload Seed Image (167KB)\nSHA1: 92340038d1b9b02b24c7b7ab5ea8259766e5b475\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_02/ck02-rev04-2025.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_02/ck02-rev04-2025.exe.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_02/machete-mateys-seed-image.jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_02/nft_blockchain.zip"]}, {"name": "Cereal Killer 03", "desc": "@TheZeal0t\n\n Created By: @TheZeal0t\nEvan Must, eccentric billionaire Space-Bro and builder of NFT block chains, also has a favorite spooky cereal. However, Mr. Must is a shy, private person, so he doesn't like having details of his private life floating all over the internet! So Mr. Must has used his own SCHNOCK.ai to build a special decryptor that keeps this secret... secret.\n\nDo you have what it takes to crack a super secure program developed by the most advanced and Mr-Must-Like AI on the face of the planet?\n\nPick one binary to analyze.\n\nDownload for Windows (8.06MB)\nSHA1: 7ef320314a866af11f34035fc6ae32d566076ab2\n\nDownload for Linux (5.45MB)\nSHA1: 024affbc2e5768e88cb616d02f035d0bf63a5a66\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_03/ck03-rev05-2025.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_03/ck03-rev05-2025.exe.xz"]}, {"name": "Cereal Killer 04", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_04/ClippyCrippyV2.jar"], "desc": "reverse engineering programming\n@TheZeal0t\n\n Created By: @TheZeal0t\nLytton Labs has upgraded their technology after the unfortunate (for them) leak of their insecure password generator. We have managed to get our hands on a copy of the new password generator. From our initial analysis, it does appear to be secure, as it was “vibe coded” by Clippy himself, using the most advanced AI on the planet, ClippyAI.\n\nHowever, whispers on the Dark Web and in the GhostTown forum lead us to believe that the program may have been tampered with, possibly by the infamous hacker / phreaker from the 90’s, Emmanuel Goldstein (Codename: CEREAL KILLER) himself!\n\nAnalyze the program and see if you can help us determine if there are any weaknesses that we can exploit, and please, as always, keep an eye out for an opportunity to exploit any information you gather.\n\nTo determine whether or not you have found a weakness, see if you can produce the password for the SHA512 hash: cc2b7d09f0a7732319328eb5dd4a1167ac34957489f384d68586a7d23909ed7654d2c3b7f50f33289aeaecf8685f0a2eb60ba269aeb448e9173fa16b6073ca14\n\nEnter the cracked password inside of double quotes inside the flag tags, like this: deadface{\"GUr$@zea#nL_yL0TB%g\"}\n\nDownload ClippyCrippyV2.jar (4.79KB)\nSHA1: e1483372078dbeda8ba0a4760dce534bd7150715\n"}, {"name": "Cereal Killer 05", "desc": "@TheZeal0t\n\n Created By: @TheZeal0t\nDario Amodei (Rock Me, Amodei!), CEO of Anthropic, maker of ClaudeAI, has a favorite spooky cereal. Run the binary and inspect it with your favorite reverse engineering tools.\n\nSHA1: cc6621c28c64bad373d036607fe086bf246233d6\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Cereal_Killer_05/ck05-2025-rev07.exe.xz"]}, {"name": "Risky Experiments", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/rev/Risky_Experiments/Experiment.zip"], "desc": "@SpiffyLich\n\n Created By: @SpiffyLich\nWe think we found a secret downloader DEADFACE uses to share their latest tools with each other… But whenever we run it, it just deletes itself! Maybe you can find a way to get something interesting out of this? Enter the answer as deadface{here-is-the-answer}.\n\nSHA1: 32e49b06373424cf331ec63071accde1c8a74b6d\n"}], "steg": [{"name": "Bad Boy", "desc": "@syyntax\n\n Created By: @syyntax\nDEADFACE left this image on a victim’s machine with a hidden message. See if you can discover the flag hidden in this image. Submit the flag as deadface{flag text}.\n\nSHA256: 12345\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/steg/Bad_Boy/baddestboi.png"]}, {"name": "Creepy Resume", "desc": "3.14ro\n\n Created By: @3.14ro\nA DEADFACE member landed an interview at Spooky Coffee using a resume that whispers in Unicode and charms every AI it touches. Those who can read between the glyphs say it speaks in riddles, crafted to bypass filters and impress any CAPTCHA-checking HR daemon.\n\nAnalyze the resume PDF. Can you find the secret string?\n\nSubmit the flag as deadface{here_is_the_answer}.\n\nSHA1: ca123313ffe8e0d04d8ec5492c507f6ef37194eb\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/steg/Creepy_Resume/lambiresume.pdf"]}, {"name": "Double Decode", "desc": "steg crypto\n@G2Gh0st\n\n Created By: @G2Gh0st\nWhile doing forensics after a recent DEADFACE attack, the team found a file that was added to the system called qr_flag.png. Nothing seems wrong with the file, but we are sure Deadface is doing something with it. Can you figure out how this file has been modified and reveal the hidden secrets?\n\nSubmit the flag as deadface{flag_text}.\n\nSHA256: 8d72527588b938e56b07e8acf85e41e6243dbc9aab1ed8630d7ad947ad35f755\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/steg/Double_Decode/qr_flag.png"]}, {"name": "Secret Frog", "desc": "@syyntax\n\n Created By: @syyntax\nDEADFACE left behind this strange image of a frog with the message:\n\n“The frog has many secrets, but he’ll only tell you if you make him smile.”\n\nThere’s obviously more to this image than we can see here. Figure out if you can find the flag associated with this image. Submit the flag as deadface{flag text}.\n\nSHA256: 12345\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/steg/Secret_Frog/froggy-steg.png"]}, {"name": "Think Outside the Box", "desc": "@syyntax\n\n Created By: @syyntax\nDEADFACE left this image on a victim’s machine with a hidden message. See if you can discover the flag hidden in this image. Submit the flag as deadface{flag text}.\n\nSHA256: 12345\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/steg/Think_Outside_the_Box/thinkoutsidethebox.jpg"]}, {"name": "Think Outside the Box 2", "desc": "@syyntax\n\n Created By: @syyntax\nThe GIF of this good boy has been corrupted! There’s a flag somewhere in the image, but we can’t seem to reach it. Maybe there’s something in this GIF that we’re not seeing.\n\nSubmit the flag as deadface{text}.\n\nSHA1: b3f2c9a7caa929d85733a726bf7a2360bb496ec7\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/steg/Think_Outside_the_Box_2/challenge.gif"]}], "web": [{"name": "The Source of Our Troubles", "desc": "@syyntax\n\n Created By: @syyntax\nDEADFACE compromised Night Veil University’s student portal website. NVU swears up and down that they’ve secured the site, but the school leaderships wants us to validate that their site is no longer vulnerable. DEADFACE left several artifacts throughout the web app to taunt school staff. See if you can compromise the web app and find the artifacts left behind by DEADFACE.\n\nLet’s start by finding any artifacts on NVU’s homepage at http://env01.deadface.io:8080. NVU has graciously provided us with their System Design Document that includes information about the application and its intended behavior. Use these documents to facilitate your activities.\n\nSHA256: 12345\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DEADFACE/2025/web/The_Source_of_Our_Troubles/SDS.zip"]}]}