{"challenges": [{"name": "00 engineer", "desc": "東京駅の近くでソフトウェアエンジニアの名札を拾った。おそらく落とし物だろう。\nこのエンジニアが勤務している会社のWebサイト（トップページ）のURLを答えよ。\nFlag 形式: Diver25{https://google.com}\n\nAn software engineer's nameplate was picked up near Tokyo Station. This should be a lost item.\nAnswer the URL of the website (index page) of the company where this engineer works.\nFlag Format: Diver25{https://google.com}\n\nrecon カテゴリの問題を解答するには、この問題の情報が必要となる。ただし、この問題を除き、どの順序で解答しても構わない。\nTo answer the challenges in the recon category, information on this challenge is required. However, the challenges can be answered in any order except this one.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/00_engineer/engineer.jpg"]}, {"name": "01 asset", "desc": "\"00_engineer\" の問題で見つかった会社のCEOが持っていたスマートフォンの資産番号を答えよ。\nFlag 形式: Diver25{ABCD-12345}\n\nAnswer the asset number of the smartphone owned by the CEO of the company found in the \"00_engineer\" challenge.\nFlag Format: Diver25{ABCD-12345}\n"}, {"name": "02 recruit", "desc": "\"00_engineer\" の問題で見つかった会社で、採用を担当していると思われる人物の氏名を答えよ。\nFlag 形式: Diver25{Shigeru Ishiba} (ローマ字表記)\n\nAnswer the name of the person you think is in charge of recruitment at the company found in the \"00_engineer\" challenge.\nFlag Format: Diver25{Shigeru Ishiba} (In Latin alphabet. NOT Hiragana, Katakana, Kanji etc.)\n"}, {"name": "03 ceo", "desc": "\"00_engineer\" の問題で見つかった会社の、CEOのメールアドレス（Gmail）を答えよ。\nAnswer the email address (Gmail) of the CEO of the company found in \"00_engineer\" challenge?\nFlag 形式 / Flag Format: Diver25{example@gmail.com}\n"}, {"name": "04 internal", "desc": "\"00_engineer\" の問題で見つかった会社では、Webブラウザからアクセス可能な社内用のDevOpsプラットフォームが運用されている。\nそのシステムのバージョン名を、表記されている通りに答えよ。\nFlag 形式: Diver25{135.0.1-f2+nightly}\n\nThe company found in the \"00_engineer\" challenge operates an internal DevOps platform which can be accessed from web browsers.\nAnswer the name of the version of the system as it is displayed.\nFlag Format: Diver25{135.0.1-f2+nightly}\n"}, {"name": "05 designer", "desc": "\"00_engineer\" の問題で見つかった会社のWebサイトを手がけたデザイナーの連絡先（メールアドレス）を答えよ。\nFlag 形式: Diver25{foo.bar@example.com}\n\nAnswer the contact email address of the designer who worked on the company's website found in the \"00_engineer\" challenge.\nFlag Format: Diver25{foo.bar@example.com}\n"}, {"name": "06 leaked", "desc": "\"00_engineer\" の問題で見つかったソフトウェアエンジニアのパスワードが漏洩して公開されてしまったらしい。彼はパスワードを変更して事なきを得たようだが、漏洩したパスワードは何だっただろうか。\nFlag 形式: Diver25{his_password}\n\nThe password of the software engineer found in the \"00_engineer\" challenge has apparently been compromised and became public.\nHe seems to have changed his password and got away with it, but what was the compromised password?\nFlag Format: Diver25{his_password}\n"}, {"name": "36 years ago", "desc": "このニュース動画に映っている航空機に、1989年8月時点で割り当てられていたトランスポンダのMode Sコードを16進数表記で答えてください。\nhttps://www.youtube.com/watch?v=OvR2O_Vpwc0\nFlag形式: Diver25{1234AB}\ncontent warning: この映像は軽微な航空事故の様子を含みます。\n\nAnswer the transponder Mode S code assigned to the aircraft shown in this news video as of August 1989 in hexadecimal notation.\nhttps://www.youtube.com/watch?v=OvR2O_Vpwc0\nFlag Format: Diver25{1234AB}\ncontent warning: This video contains footage of minor aviation accident.\n"}, {"name": "Afghanistan", "desc": "動画 / Video:\nhttps://www.youtube.com/watch?v=NWQwx4-MeRg&t=65s\n\nこの動画の65～67秒に表示される写真はいつどこで撮影されたものか。\nFlag形式: Diver25{撮影場所名_YYYY-MM-DD}（撮影場所名は英語）\n例えば、2025年6月5日に、Camp Darbyで撮られた場合は、Diver25{Camp Darby_2025-06-05}となる。\n\nWhen and where was the photo shown at 65-67 seconds in this video taken?\nFlag format: Diver25{location name_YYYY-MM-DD} (location name should be in English)\nFor example, if it was taken at Camp Darby on June 5, 2025, it would be Diver25{Camp Darby_2025-06-05}.\n"}, {"name": "Talentopolis", "desc": "記事 / Article:\n\n\"Primera edición de Talentopolis\" という記事内に登場するステージの位置を答えよ。\n\nAnswer the location of the stage appeared in the article titled \"Primera edición de Talentopolis\".\n"}, {"name": "UART", "desc": "この商品のイーサネットスイッチコントローラに直接UARTでアクセスを試みたい。どの部品の、どのピンにアクセスすればいいだろうか。\nPCB上の部品番号 と、その部品の UART RX / UART TX ピン番号 を答えよ。ピン番号は部品の仕様に準拠せよ。\nなお、ピンヘッダやコネクタが利用可能な場合でも、イーサネットスイッチコントローラのピン番号を答えてほしい。\nFlag形式: Diver25{PCB上の部品番号_UART RXピン番号_UART TXピン番号}\n（例えば、イーサネットスイッチコントローラが T21 という部品番号で、RXのピン番号が120、TXのピン番号が150であれば、Diver25{T21_120_150}となる）\n\nI want to try to access the Ethernet switch controller of this product directly via UART. Which component and which pin should I access?\nAnswer the part number on the PCB and the UART RX / UART TX pin number of the component. The pin number should follow the specification of the component.\nNote that even if pin headers and connectors are available, answer the pin numbers of the Ethernet switch controller. Flag Format: Diver25{Part Number on PCB_UART RX pin number_UART TX pin number}\n(If the Ethernet switch controller has part number T21 on PCB, RX pin number is 120 and TX pin number is 150, the flag should be Diver25{T21_120_150}.)\n"}, {"name": "advertisement", "desc": "記事 / Article:\n\nこの記事の写真が撮影された場所はどこか。\n\nWhere were the photographs in this article taken?\n"}, {"name": "air2air", "desc": "動画 / Video:\nhttps://www.youtube.com/watch?v=wUa5TGj6uxc\n（無音です / No audio）\n\nこの動画は2025年3月11日（現地時間）に撮影された。遠くに映っている航空機のコールサインと機体記号を答えよ。\n（撮影者が搭乗している航空機ではない）\nFlag形式: Diver25{コールサイン_機体記号}（例: Diver25{ANA0183_JA381A}）\n\nThis video was taken on 11 March 2025 (in local time).\nAnswer the callsign and registration number of the aircraft seen in the distance.\n(Not the aircraft the person who shot the video is on board)\nFlag Format: Diver25{CALLSIGN_Registration}（Example: Diver25{ANA0183_JA381A}）\n"}, {"name": "bid", "desc": "2023年、オマーンにおいて、ある施設に関連するニュースが報じられた。\nhttps://www.youtube.com/watch?v=TFdubskF9Kw\n\nその後、2024年10～11月に、この施設に関連すると推定される、井戸およびパイプラインを建設するための入札が実施された。\nこのとき、3位の金額で入札した企業のCEOの名前を、Webサイトに掲載されている英語表記で答えよ。\nFlag形式: Diver25{Kelly Ortberg}\n\nIn 2023, news related to a facility was reported in Oman. https://www.youtube.com/watch?v=TFdubskF9Kw\n\nA tender was subsequently issued in October-November 2024 for the construction of wells and pipelines, presumably associated with this facility. Answer the name of the CEO of the company that bid for the third highest amount in this tender.\n(In English. Also follow the format in the company's official site.)\nFlag Format: Diver25{Kelly Ortberg}\n"}, {"name": "bridge", "desc": "動画 / Video:\nhttps://www.youtube.com/watch?v=fRMi8TXQRuo\n（無音です / No audio）\n\nこの動画で列車が通過した橋梁は、ある災害で損傷した後に架け替えられたものである。架け替えに際して、他の橋梁の構造物が流用されたことがある文献に示されている。その流用元の橋梁名を答えよ（この橋の名前ではない）。\nFlag形式: Diver25{橋梁名}（例: Diver25{日本橋川橋梁}）\n\nThe bridge that the train passed over in this video was replaced after it was damaged in one of the disasters. A document shows that structures from other bridges were diverted during the replacement.\nWhat is the name of the bridge from which it was diverted? (NOT the name of THIS bridge)\nFlag format: Diver25{The name of the bridge in Japanese} (Example: Diver25{日本橋川橋梁})\n"}, {"name": "bx", "desc": "introduction\n\n画像 / Picture:\nhttps://drive.google.com/file/d/1FocVup_AZSMfN8XHNtw2qZWOp6UjGCGw/view?usp=sharing\n\nこの写真で見える \"BX\" という看板の座標を答えなさい。\nGive the coordinates of the \"BX\" signboard visible in this picture.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/bx/bx.jpg"]}, {"name": "convenience", "desc": "青森県内に、公園とコンビニ、スーパーマーケットが互いに約100m圏内に存在する場所がいくつかある。また、これはOpenStreetMapで確認可能である。\nこの条件を満たす 公園 のうち、最南端 のものについて、OpenStreetMap上での Way Number を答えよ。\nなお、「公園」の定義は、OpenStreetMap上で \"park\" (leisure=park) と分類されているものに準拠する。\nFlag形式: Diver25{123456789}\n\nThere are several locations in Aomori Prefecture (青森県) where a park, a convenience store and a supermarket exist within approximately 100 metres of each other. This can be also confirmed on OpenStreetMap.\nAnswer the Way Number (on the OpenStreetMap) of the southernmost of these parks that satisfy this condition.\nThe definition of \"park\" conforms to that classified as \"park\" (leisure=park) on the OpenStreetMap.\nFlag Format: Diver25{123456789}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/convenience/convenience_hint.png"]}, {"name": "document", "desc": "introduction\n\nアメリカ海軍横須賀基地司令部（CFAY）は、米軍の関係者向けに羽田空港・成田空港と基地の間でシャトルバスを運行している。2023年に乗り場案内の書類を作成した人物の名前を答えよ。\nFlag形式: Diver25{George Washington}\n\nThe US Navy Commander Fleet Activities Yokosuka (CFAY) operates a shuttle bus service between Haneda airport/Narita airport and the base for US military personnel. Answer the name of the person who created the document about the boarding location of the bus in 2023.\nFlag Format: Diver25{George Washington}\n"}, {"name": "elevator", "desc": "これらの写真はあるホテルの客室内と、その窓からの景色を撮影したものである（撮影日は2024年）。\nこのホテルに設置されたエレベーターには、2件の故障記録が存在しているものが1基ある。 故障日と、故障記録があるエレベーターの登録番号を答えよ。\nFlag形式: Diver25{YYYYMMDD_YYYYMMDD_1234567}\n\n例えば、登録番号 \"1234567\" のエレベーターが2000年11月20日と2020年2月13日に故障していた場合、Flagは Diver25{20001120_20200213_1234567} となる。\n\nThese photos show the interior of one hotel room and the view from its windows (Taken in 2024).\nThere is one elevator installed in this hotel for which two failure records exist.\nAnswer dates of failure and the registration number of the elevator that has a fault history.\nFlag Format: Diver25{YYYYMMDD_YYYYMMDD_1234567}\n\nFor example, if an elevator with registration number \"1234567\" failed on 20 November 2000 and 13 February 2020, the Flag would be Diver25{20001120_20200213_1234567}.\n\n注意 / CAUTION:\nホテルや企業に接触しないでください。公開情報からFlagを入手できます。\nDO NOT CONTACT HOTELS AND COMPANIES. YOU CAN GET THE FLAG FROM OPEN SOURCE.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/elevator/elevator01.jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/elevator/elevator02.jpg"]}, {"name": "expense", "desc": "2025年1月、São Miguel do Guamáの市長が、ある食品関連会社にクレジットカード決済で支払った金額（現地通貨）を答えよ。\nFlag形式: Diver25{1234.56}（通貨記号/コードは不要）\n\nAnswer the amount (in local currency) paid by the mayor of São Miguel do Guamá to a food-related company by credit card payment in January 2025.\nFlag Format: Diver25{1234.56} (Currency symbol or code not required)\n"}, {"name": "finding my way", "desc": "introduction\n\n34.735639, 138.994950 にある 建造物 の、OpenStreetMapにおけるWay（ウェイ）番号を答えよ。\nFlag形式: Diver25{123456789}\n\nAnswer the Way number in OpenStreetMap of the building located at 34.735639, 138.994950. Flag Format: Diver25{123456789}\n"}, {"name": "flight from", "desc": "introduction\n\n画像 / Image:\nhttps://drive.google.com/file/d/14LSICiwmUqG9xqAfAm75IVdGd7P12uoy/view?usp=sharing\n\nこのヘリコプターが出発した飛行場のICAOコード（4レターコード）で答えよ。\nFlag形式: Diver25{RJTT}\n\nAnswer with the ICAO code (4 letter code) of the airfield from which this helicopter departed.\nFlag Format: Diver25{RJTT}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/flight_from/flight_from.png"]}, {"name": "hidden service", "desc": "introduction\n\n添付ファイルを確認して、Flagを獲得してください！\nSee the attached file and capture the flag!\nFlag形式 / Flag Format: Diver25{xxxxxxxxxxxxxxxxx}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/hidden_service/hidden_service.jpg"]}, {"name": "hole", "desc": "この穴があった場所はどこか。\nWhere was this hole located?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/hole/hole.png"]}, {"name": "internment", "desc": "著名な木曜島の真珠採りダイバーであった藤井富太郎氏は、第二次世界大戦中、強制収容されました。彼が釈放された収容所と釈放の年月日を明らかにしてください。\nFlag 形式: Diver25{YYYY-MM-DD_キャンプ番号_キャンプ地名_州名}\n\n例えば、「2025年6月1日に、キャンプ番号7番のDiver州Daibaキャンプ」から釈放されたならば、 Diver25{2025-06-01_7_Daiba_Diver} となります。なお、キャンプ番号がない場合はX（大文字のX）を入れてください。例えば、Diver25{2025-06-01_X_Daiba_Diver} となります。\n\nTomitaro Fujii(藤井富太郎), a prominent Thursday Island pearl diver, was interned during World War II. Please identify the camp from which he was released and the date of his release.\nFlag Format: Diver25{YYYY-MM-DD_CampNumber_CampPlaceName_State}\n\nFor example, if he was released from the Camp 7 (Daiba Camp) in Diver State, on June 1, 2025, the flag should be Diver25{2025-06-01_7_Daiba_Diver}. If the camp doesn't have a number, please use X (capital Latin alphabet X). For example, Diver25{2025-06-01_X_Daiba_Diver}.\n"}, {"name": "listen", "desc": "音声 / Audio:\nhttps://drive.google.com/file/d/1s_HC_S_9szbkupw9jQo4Zsvkoj73Qd_6/view?usp=sharing\n\nこの航空管制のやり取りが録音された空港のICAOコード（4レターコード）を答えよ。\nFlag形式: Diver25{RJTT}\n\nAnswer the ICAO 4 letter code of the airport where this air traffic control communication was recorded.\nFlag Format: Diver25{RJTT}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/listen/listen.mp3.xz"]}, {"name": "louvre", "desc": "introduction\n\nルーブル美術館の公共Wi-Fiアクセスポイントのうち、以下の条件を満たすもののベンダーを答えよ。\n\n    情報は2025年2月28日に収集されており、オンライン上で確認できる。\n    ベンダーはBSSIDに準拠して判定せよ。\n\nFlag形式: Diver25{Company Name} (例: Apple Inc.の場合、Diver25{Apple Inc.} となる。)\n\nAnswer the vendor of one of the Louvre's public Wi-Fi access points that meets the following criteria.\n\n    Information was collected on 28 February 2025. This can be accessed via online.\n    Determine the vendor according to the BSSID.\n\nFlag format: Diver25{Company Name} (e.g. If the company is Apple Inc., the flag should be Diver25{Apple Inc.}.)\n"}, {"name": "next train", "desc": "この音声が録音された駅はどこか。駅名を答えよ（日本語でも英語でも可）。\n（駅名は鉄道会社の公式サイトやWikipediaに記載されている表記とする）\nFlag形式: Diver25{京都駅}\n\nWhich station was this sound recorded at? Answer the name of the station.\n(The station name should be as it appears on the official website of the railway company or on Wikipedia.)\nEither Japanese or English are okay.\nFlag Format: Diver25{Kyoto Station}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/next_train/next_train.m4a"]}, {"name": "night accident", "desc": "introduction\n\n動画 / Video:\nhttps://www.youtube.com/watch?v=jHgqCpJNL28\n\nこの動画で、車とバスが衝突しそうになった場所はどこか。\nIn this video, where did the car and bus almost collide?\n\ncontent warning:\n衝突には至らないものの、交通事故のようなシーンがあります\nThere are scenes that do not result in a collision, but are similar to a road accident.\n"}, {"name": "night street", "desc": "画像の中心に写っている茶色の2階建ての建物に入る施設の正式名称を現地語表記で答えなさい。\nFlag形式: Diver25{施設名}（例: Diver25{お台場海浜公園前郵便局}）\n注意: この問題を解く際、外部サイトへの機械的なアクセスやスクレイピングは禁止します。また、それらを行う必要はありません。 ただし、ブラウザから手動で取得できる情報や、公開されているAPIサービスやデータセットの利用は問題ありません。\n\nAnswer the official name of the facility that will be housed in the two-story brown building in the center of the image (in local language).\nFlag Format: Diver25{Facility Name} (e.g. Diver25{お台場海浜公園前郵便局})\nWarning: Mechanical access or scraping of external sites is prohibited when solving this challenge. Nor are you required to do so. However, there is no problem with using public API services, public datasets and information retrieved from the web browser by (literally) your hand.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/night_street/night_street.jpg"]}, {"name": "object", "desc": "69.216246, 33.378242 には大きな構造物が存在する。この構造物のプロジェクト番号および、構造物の名称（固有名詞）を現地語で答えよ。\nFlag形式: Diver25{プロジェクト番号_名称}（例: Diver25{955А_Борей-А}）\n\nThere is a large object at 69.216246, 33.378242. Answer the project number and particular name of that object. Flag Format: Diver25{PROJECT NUMBER_NAME} (e.g. Diver25{955А_Борей-А})\n"}, {"name": "p2t", "desc": "introduction\n\nこの写真の左側に掲示されている写真には、ある動物が写っている。その名前を、日本語で書かれている通りに答えよ。\nFlag 形式: Diver25{シバイヌ}\n\nThe photo posted to the left of this photo shows an animal. Answer its name as it is written in Japanese.\nFlag Format: Diver25{シバイヌ}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/p2t/p2t.JPG"]}, {"name": "phone", "desc": "2016年7月23日～24日、この携帯電話の発売に先立ってEMI試験が行われた。試験は三重県の会社が実施したようだ。その試験に供された端末のシリアル番号を答えよ。\nシリアル番号に / や - といった記号を含む場合、その記号も含めて記載すること。\nFlag形式（例）: Diver25{123-45/6789-0}\n\nAn EMI test was conducted prior to the launch of this mobile phone on 23-24 July 2016. The test was conducted by a company in Mie Prefecture (Mie-ken), Japan.\nAnswer the serial number of the specific mobile phone that was subjected to that test.\nIf the serial number contains symbols such as / and -, include them.\nFlag Format (example): Diver25{123-45/6789-0}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/phone/phone.jpg"]}, {"name": "platform", "desc": "この写真が撮影された駅はどこか。駅名を答えよ（日本語でも英語でも可）。\n（駅名は鉄道会社の公式サイトやWikipediaに記載されている表記とする）\nFlag形式: Diver25{京都駅}\n\nWhich station was this photograph taken at? Answer the name of the station.\n(The station name should be as it appears on the official website of the railway company or on Wikipedia.)\nEither Japanese or English are okay.\nFlag Format: Diver25{Kyoto Station}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/platform/platform.jpg"]}, {"name": "radar", "desc": "画像 / Image:\nhttps://drive.google.com/file/d/1hHoRFkG3ZpiQvgBN5wN9BMIkiF5WSIB1/view?usp=sharing\n\n画像に写っているものは、福建省に存在する、中国人民解放軍東部戦区のレーダー施設であると考えられる。\n公式な情報は明らかにされていないものの、オンライン上で中国の軍事を分析している人々がこの基地を運用する部隊と分隊の番号を特定しているらしい。\nもちろん、オンライン上の情報だけを鵜呑みにするわけにはいかないが、ひとまず検討する価値はあるだろう。\nその情報を探り当て、教えてほしい。\nFlag形式: Diver25{部隊番号_分隊番号}（例えば12345部隊の56分隊のとき、Diver25{12345_56} となる）\n\nThe facility in the image is believed to be a radar facility in the Chinese People's Liberation Army's Eastern War Zone, located in Fujian Province.\nAlthough no official information has been revealed, people analysing PLA on the internet have apparently identified the unit and squad numbers that operate this base. Of course, we cannot just rely on those information on the internet, but it is worth considering at least.\nFlag Format: Diver25{Unit Number_Squad Number} (e.g. If the answer is Squad 56 of Unit 12345, the flag should be Diver25{12345_56})\n\nImage source: Google Earth\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/radar/radar.png"]}, {"name": "sanction", "desc": "2024年10月25日、制裁下にあるロシア船籍のRORO船「ANGARA」がある港湾に停泊していることが衛星画像で確認された。\n停泊位置を答えよ。\n\nOn 25 October 2024, satellite imagery confirmed that the Russian-flagged RORO vessel \"ANGARA\", which is under sanctions, was anchored in a certain port.\nAnswer the position of the anchorage.\n"}, {"name": "ship", "desc": "introduction\n\nこれは、ある組織が運用する船舶である。もし将来、この船が外国に売却されたとしても、変わらない番号を答えよ。\nFlag形式: Diver25{現地語での船名_番号}（例: 船名が「ペンギン饅頭号」で番号が 1234567 の場合、Flagは Diver25{ペンギン饅頭号_1234567} となる）\n\nThis is a vessel operated by a some organisation. Answer the number that would remain the same if this vessel were to be sold to a foreign country in the future.\nFlag Format: Diver25{ship name in **the local language**_number} (e.g. If the ship name is \"ペンギン饅頭号\" and the number is 1234567, the flag should be Diver25{ペンギン饅頭号_1234567}.)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/ship/ship.jpg"]}, {"name": "what3slashes", "desc": "この画像が撮影されたとき、正面に家が3軒、右手に家が1軒あった。\nそれから少し経った、ある月の初旬にこの場所にもう一度訪れてみた。そのときには、正面左側に家が1軒増えていて、正面右側にもう1軒が建設中であった。その時点で、建設中の家に屋根はなかったが、黒っぽい屋根を作る予定だという。\n「ある月の初旬」とは何年の何月のことだろうか。\nFlag形式 : Diver25{YYYY/MM} (e.g. Diver25{2025/06})\n\nWhen this image was taken, there were three houses in front and one on the right.\nSome time later, at the beginning of one of the months, I visited this place again. At that time, one more house had been added to the left side of the front and another was under construction on the right side of the front. At that point, the house under construction did not have a roof, but they were planning to build a blackish roof. In which year and month is \"the beginning of one of the months\"?\nFlag Format: Diver25{YYYY/MM} (e.g. Diver25{2025/06})\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/DIVEROSINT/2025/what3slashes/what3slashes.jpeg"]}, {"name": "worker", "desc": "\"object\" の問題で示された構造物で仕事をしていた1964年生まれのある人物は、Akhtubinskに居住しているとされる。\nこの人物が1987年～2009年にかけて勤務していた組織のOGRNを答えよ。\nFlag形式: Diver25{1234567890123}\n\nA person born in 1964 who worked at the object indicated in the \"object\" challenge is said to reside in Akhtubinsk.\nAnswer the OGRN of the organisation where this person worked between 1987 and 2009.\nFlag format: Diver25{1234567890123}\n"}]}