{"crypto": [{"name": "Learning from errors", "desc": "A communication has been intercepted containing encrypted data by the DOSEAL initiative (Defensive Operation for Satellite Encrypted Analysis Localization). It seems to be related to a KEM public key that our experts confirmed to be a post-quantum mechanism, and the corresponding public key has been found. The secret key is nowhere to be found.\n\nHowever, our informant has provided the DOSEAL key generation source code and a memory dump of one generation.\n\nCan the secret document of the DOSEAL initiative be retrieved?\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/crypto/Learning_from_errors/amossys_LearningFromError.zip"]}, {"name": "Mono Poly", "desc": "A top-secret message has been intercepted. Unfortunately, it is encrypted. Fortunately, it seems that this scheme is not very... up to date.\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/crypto/Mono_Poly/houko_mono-poly.zip"]}, {"name": "Old proprietary encryption", "desc": "Your workshop colleague challenges you to bypass his password protection. Unfortunately for him, some proprietary encryption methods aren’t very effective. To help you, you've conducted a few tests using a platform ('TestPasswordHash.txt'). The flag is in the format ECW{theDecryptedPassword}.\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/crypto/Old_proprietary_encryption/dga_encrypted_pass.zip"]}, {"name": "RSAd", "desc": "During your technical interview, the cryptography engineer leans back and smiles : Here's a little RSA encryption puzzle we like to give candidates. If you can recover the original message, the job is yours !\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/crypto/RSAd/houko_RSAd.zip"]}, {"name": "SHAlphabet", "desc": "We intercept a password database. But we still miss the admin password, we only have the corresponding hash ! Can you break it ?\n\nThe flag is in the format ECW{password}.\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/crypto/SHAlphabet/houko_SHAlphabet.zip"]}, {"name": "rsa rsa rsa", "desc": "In this challenge, the participant's task is to decrypt a message that has been encoded in .png. The modulus N for RSA is also given, however no other information is given. Because the modulus is large and prime, prime factorization is not possible, so alternative methods must be used. Luckily, as the modulus is prime, the Euler totient of N is equal to N-1, hence the ciphertext can be decrypted. Sometimes you need multiple primes, sometimes you need only one.\n\nChallenge made by Rufus from :\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/crypto/rsa_rsa_rsa/esna_FileEncryption.png"]}], "forensic": [{"name": "Alice In Rans0ml4nd", "desc": "You are urgently contacted by Alice-Corp, a company specialized in developing technological solutions. Our server as well as all workstations connected to our Active Directory have suddenly been encrypted. The Alice-Corp network team managed to capture part of the network traffic. As a forensic investigator, you must analyze this file to find:\n\nThe email address used by the attacker (format: attacker@example.com)\nThe email address targeted within the company (format: victim@alice.corp)\nThe MD5 hash of the first malware\nThe domain name contacted to download a script\nThe password used to connect to the server\nThe name of the scheduled task that was executed\nThe domain name (in lowercase) contacted by the script to download the second malware\nThe MD5 hash of the malware present on the server\nThe domain name used for data exfiltration\nThe name of the ransomware gang (in lowercase)\nThe cryptocurrency wallet address used by the attackers\nThe final flag contained in a file exfiltrated by the malware\nThen create a sha256 digest. example echo -n \"totor@example.com:roro@alice.corp:5d41402abc4b2a76b9719d911017c592:example.com:123456789:ImAtask:example.com:5d41402abc4b2a76b9719d911017c592:example.com:black-cat:84EgZVjXKF4d1JkEhZSxm4LQQEx64AvqQEwkvWPtHEb5JMrB1Y86y1vCPSCiXsKzbfS9x8vCpx3gVgPaHCpobPYqQzANTnC:fin4l_flag\" | sha256sum\n\nECW{976605e64af03242e3321d7b5cdb8c6bb0bd0839ca36ba12abb11cef0fdac320}\n\nDisclaimer The PCAP file provided in this challenge contains real or simulated malicious payloads (such as executables, scripts, or infected files transferred over the network).\nUse an isolated environment\nArchive password : 1_C0ns3nt_;)\n\nChallenge made by Insomnia from :\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/forensic/Alice_In_Rans0ml4nd/esna_AliceInRans0ml4nd.zip"]}, {"name": "Clipbored", "desc": "The SOC team alerted us about unusual activity detected on one of our workstations. They tried to handle the incident, but your expertise is now needed for a deeper analysis.\nThe initial investigation of the environment showed that the user conducted suspicious web searches, followed by attempts to exfiltrate data.\n\nThe SOC team suggests that the user executed several sensitive commands quickly and repeatedly.\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/forensic/Clipbored/clibored.zip"]}, {"name": "Jobstacle I", "desc": "It looks like the enemy is recruiting...\n\nOne of our agents was contacted by a recruiter for a company working in weapons technology, Hammer Industries. A big contract apparently, but we don't know the company well. Our analysts, however, suspect that it has a connection to the drone attacks observed recently.\n\nTwo weeks ago, investigations led to the discovery of a hidden ZIP file on their website. The file, named hammer.zip, appeared to be an innocuous technical archive containing documentation...\n\nAnalyze this archive (no bruteforce needed) and let us know if anything interesting is found there.\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/forensic/Jobstacle_I/hammer.zip"]}], "misc": [{"name": "Homemade Keeloq I", "desc": "Your mission :\nFind the next key value, more information given in the source.\n\nFlag is in the format ECW{cRyPt0gr4pHy_Is_t00_Hard_NEXTKEY}. NEXTKEY being the next 16 bit key in decimal format.\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/misc/Homemade_Keeloq_I/astek_HomemadeKeeloqI.zip"]}], "net": [{"name": "White rabbit searching", "desc": "Alice set out to find a trace of the White Rabbit... But as always, the paths in Wonderland are confusing, and some traces of the white rabbit have been found on the network.\nTry to assemble the different paths and recover the clue!\n\nChallenge made by Ostra from :\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/net/White_rabbit_searching/Searching_this_rabbit.pcap.xz"]}], "osint": [{"name": "DroneGuesser I", "desc": "You heard weird noises coming at high speeds from outside. Oh it's a drone!\n\nGet some general information about it and its producing company.\n\nReplace the corresponding data in the flag to validate the challenge. ECW{xxxxxxxxx_yy_zz_vvvv}\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/osint/DroneGuesser_I/astek_DroneGuesser_I.zip"]}, {"name": "DroneGuesser II", "desc": "Your friend crashed his FPV drone and lost a motor a while ago !\n\nLet's offer him a replacement for the mesmerizing content he produces.\nAttached is his profile picture.\n\nFind the reference and official technical specs of his lost motor.\n\nECW{MOTORType_MaxThrust_MaxThrustRPM}.\nTake the values from the testing data\n\nFlag shadow is either (old): ECW{************_****.*_*****}\nor (true) : ECW{**************_****.**_*****}\n\nBoth values will be accepted\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/osint/DroneGuesser_II/astek_DroneGuesser_II.zip"]}, {"name": "DroneGuesser III", "desc": "Who put a tree here ?!\n\nYour friend caught on video a crash of his FPV drone into a tree a while ago, that time, he even left a motor on the floor !\n\nFind the exact coordinates of the tree he crashed into and lost a motor.\n\nAttached is his profile picture.\n\nFlag is the coordinates rounded to 3 decimal places. ECW{**.***, ***.***}\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/osint/DroneGuesser_III/astek_geoint.zip"]}, {"name": "Its a sign", "desc": "We are on the trace of an enemy agent. He appears to have escaped to a country that does not seem to be France.\n\nA photo has been leaked, locate it and give us its approximate location.\n\nFlag format: ECW{8CWW4889+29}\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/osint/Its_a_sign/sign.jpg"]}, {"name": "Larrys enigmas", "desc": "Larry wants to meet up. The place is secret of course.\n\nLarry doesn't believe in cryptography... so he ends up using non-traditional (straight up annoying) methods of sharing his position.\n\nThis time, he seems to be using a pet bioship as a beacon.\n\nFind the nearest bus stop from his position.\n\nFormat : ECW{City_n°bus_BusStopName}.\nExample : ECW{Tbilisi_316_FreedomSquare}\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/osint/Larrys_enigmas/message_from_larry.zip"]}, {"name": "WhosDatCat", "desc": "What is my cats name ?\nFlag is simply \"ECW{Name}\"\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/osint/WhosDatCat/astek_WhosDatCat.zip"]}], "rev": [{"name": "Down the rabbit hole", "desc": "Find the key that opens Wonderland; you’ll face some challenges along the way!\n\nChallenge made by Arueco from:\nMD5 : 4edc15046e930b35d154b7c107b3de0a\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/rev/Down_the_rabbit_hole/esna_DownTheRabbitHole.zip"]}, {"name": "Power Redirect", "desc": "Your help is required to transfer energy to a critical power plant!\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/rev/Power_Redirect/power_control"]}, {"name": "Sky Seal 10", "desc": "The year is 2039. Humanity has grown heavily reliant on an ultra-secure satellite network known as SkyNet Quantum Link. But disaster strikes: a critical node, Satellite #10 – Sky Seal, suddenly goes dark.\n\nA cybersecurity analyst team uncovers that an automatic lockdown has been triggered. To restore access, a valid authentication key must be regenerated.\n\nYour objective is to analyze the binary file, understand the internal logic, and reconstruct the legitimate key that will restore access to the satellite’s data systems.\n\nTime is critical. The longer Sky Seal 10 stays offline, the greater the risk of downstream system collapse.\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/rev/Sky_Seal_10/amossys_SkySeal.zip"]}], "web": [{"name": "Alice and the Literal Escape", "desc": "Captain-explorer Alice sets sail on the Star Wind for a crossing into the unknown!\nTwo security locks protect the cargo hold: the Quartermaster checks that only the ship's mousses embarked ‘from the deck’ have access to the administration bridge.\nThe Logbook records every cargo in the hold; a strange process converts your notes into a record.\nFlag is located in flag.txt\n\nChallenge made by icegeo from :\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/web/Alice_and_the_Literal_Escape/src.py"]}, {"name": "Tacticool Bin", "desc": "'I only had one job ! Reading Larry's message at 6:00 on this pastebin like website.'\nThat's what you said to yourself whilst calmly waking up at 9:30. Find another way to get in touch with Larry !\n\nThankfully, the app is opensourced.\nYou only know Larry uses his own name as a username and loves l33TsP34k, glhf.\n\nFlag is in the format : ECW{username-phone_number-domain_name_of_his_email}\n\nChallenge made by:\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/ECW/2025/Quals/web/Tacticool_Bin/TacticoolBin_Source_win.zip"]}]}