{"crypto": [{"name": "Beautiful Forts", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/crypto/Beautiful_Forts/QR.png"], "desc": "High upon the emerald hills of Eldara stood a fort, its golden walls gleaming in the sunlight. The fort, known as Celestia, had watched over the land for centuries, nestled between towering peaks and rolling valleys. It was said that the fort was built not for war, but to embrace the beauty of the world around it. From its highest tower, one could see endless horizons—rivers sparkling like silver threads, forests swaying in the wind, the sun setting in a blaze of orange and pink, casting a warm glow over the hills and the flags of different countries making them easy to capture. An Italian mathematician from the 1200s unveiled a revolutionary weapon and a KEY, providing a pathway that would empower them to conquer the world. However, the journey would reset after every 8th step.\n\nCan you find the weapon?\n"}, {"name": "DC", "desc": "NbHt{s0y35_4xh_a1rnp35}\n\nI can be cracked. I can be made. I can be told. I can be played. What am I? I am your key.\n"}, {"name": "Fool Me Not", "desc": "Don't be so gullible.\n\n\"hi\" Use this.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/crypto/Fool_Me_Not/chall.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/crypto/Fool_Me_Not/img.jpg"]}, {"name": "Happy Euler", "desc": "C:2335210353774960917424607410416119517667538750238406964793599564775738940317348136027395629591291707979569781774836200454531228824722178758530454221179573\n\nN:8421349495618586450667077135268159327548193764962010355156642315694830484084869495533730213022077296266155178741797453626381857225277332067246863487708911\n"}, {"name": "W31C0M3", "desc": "Apologies, but sharing the key feels like too much effort today! I'm in full-on lazy mode, you know?\n\nuYorl fa g:EpnX{5JU7H_T33_B6N1N1}N6\n"}], "forensic": [{"name": "Bin", "desc": "I am thinking of buying a bin to store a bunch of my trash. Do you like this one?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/forensic/Bin/bin.png"]}, {"name": "Invisible Ink", "desc": "Found this mysterious piece of text. Looks like a bunch of gibberish. Can you help me decipher it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/forensic/Invisible_Ink/flag.txt"]}, {"name": "Rogue MIKE", "desc": "Dr. Eleanor Riggs is a research scientist at Riggs Labs and the creator of MIKE. MIKE was an ambitious project with an aim to develop a fully autonomous intelligent agent with pseudo-infinite capabilities. Recently, Dr. Riggs started noticing strange behaviors on MIKE's networks. Due to fear of MIKE going rogue, Dr. Riggs started monitoring MIKE's networks and made attempts to get access to MIKE's neurotic layers and curb MIKE. But MIKE, possibly aware of her intentions, went off the grid. The only thing left behind is a network packet capture as recorded by Dr.Riggs. Help access MIKE's core neural components and the flag will be yours.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/forensic/Rogue_MIKE/mikes_network.pcap.xz"]}, {"name": "SOS", "desc": "In 1996, a research expedition to the Arctic vanished without a trace. Nearly three decades later, a USB device was discovered near their last known location. The device contains a single file—a cryptic log of network traffic.\n\nYour mission is to analyze this file, uncover the expedition’s final message, and solve the mystery of their disappearance. Hidden within the data lies a vital clue that could unlock the truth and lead to their rescue.\n\nCan you decipher the forgotten signal and reveal the flag?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/forensic/SOS/traffic.pcapng.xz"]}, {"name": "Save your secrets", "desc": "Seems like a typical React project. What could be wrong?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/forensic/Save_your_secrets/my-project.zip"]}, {"name": "Who am I", "desc": "Welcome to digital forensics!\n\nTLDR: Get the flag!\n\nIf you're new to forensics, don't worry—it's like a digital treasure hunt where the clues are hidden in files, network traffic, or even memory dumps. Your job? Dig through the data, connect the dots, and figure out what’s really going on. Think of it as part detective work, part data ninja skills. So grab your magnifying glass (+ other forensics tools) and get ready to uncover the secrets hiding in plain sight (or not)!\n\nEdit: File contains Red Herrings (Fake flags)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/forensic/Who_am_I/file.txt"]}], "pwn": [{"name": "Cheat Engine", "desc": "Each price shown here is in dollars.. the prices you pitch will be dollars however the real account balance and account balance will be done i rupees. 1 dollar = 90 rupees Make sure not to overpitch as you will lose your balance and get in debt.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/Cheat_Engine/chall"]}, {"name": "Expose", "desc": "\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/Expose/chall"]}, {"name": "Got Root", "desc": "A long journey to achieve root on a system takes its baby steps..\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/Got_Root/chall"]}, {"name": "No Beef", "desc": "NoBeef but a ton a ways to call a function.. and oh this is a bipartly binary system.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/No_Beef/chall", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/No_Beef/chall1"]}, {"name": "Sweet Milk", "desc": "Remembering Ratan Tata, one must recall Qissa-i Sanjan, \"Like sugar in milk, our presence in your country will sweeten your lives.\" But to begin with you must find where is Sugar and its Milk.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/Sweet_Milk/chall", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/Sweet_Milk/chall1", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/Sweet_Milk/libcallme.so", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/pwn/Sweet_Milk/librunme.so"]}], "rev": [{"name": "Breaking Out of Yankin", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/rev/Breaking_Out_of_Yankin/BOY"], "desc": "One Piece is Real! Brave explorers, your mission begins here. The One Piece, the legendary treasure, lies hidden in the vast universe, and only those with the sharpest reverse engineering skills and unbreakable determination can claim it. In this 24-hour journey, you will face countless trials, but remember: You are warriors, dreamers, and conquerors of the impossible! The Force is strong within you, and with each step, you get closer to the treasure that will bring you eternal glory. But first, a great challenge stands before you.\n\nWe are currently trapped at Yakin, the mighty gas giant swirling in the endless void, controlled by the ruthless Palpatine. This villain has set traps and obstacles for us, determined to keep us from achieving our goal. But we will not falter, for we are explorers, and no force in this galaxy or beyond can stop us from reaching the One Piece!\n\nTo continue, you must prove yourself worthy. This is your first task—to Break Out of Yakin (BOY). But escaping the villain's clutches requires more than just brute force. You must find the password that will let the machine decide if you are a \"Good BOY\" and ready to continue your journey.\n\nWarrior’s Code: To submit the flag, you must follow the warrior’s tradition. If the password you discover is not already in the form EnXp{...flag...}, then submit it in this format: EnXp{flag}\n\nFor example, if the password that deems you a Good BOY is WillOfD, then you should submit it as: EnXp{WillOfD}\n\nHowever, if the password is already in the correct format, such as EnXp{WillOfD}, simply submit it as is.\n\nMay the Force guide your steps, and remember, explorers: The One Piece is real, but only for those who prove themselves worthy of this epic journey.\n"}, {"name": "Light Speed Escape", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/rev/Light_Speed_Escape/Light-Speed-Escape.exe.xz"], "desc": "Yeahh, explorers! You’ve come so far, proving your strength and resolve time and time again. I know you’re tired, but now is not the time to rest. We’ve escaped the enemy’s planet, but they won’t let us go easily. They are right on our tail, firing relentlessly, determined to stop us. Blasts of energy shake our ship, and the tension rises. The Force is no longer strong enough to hold them back—we’ve grown weak, and the enemy grows stronger by the minute.\n\nBut we have one chance to escape: Light Speed. With it, we can outrun their fleet and disappear into the stars. The problem? We don’t know the password to engage the Light Speed drive. Without it, we’re sitting ducks in the enemy’s sights.\n\nYour mission is clear: write the correct password to activate Light Speed and unlock our next adventure. Only with the right code will we be able to make the jump and leave the enemy behind for good.\n\nWarrior’s Code: Once again, you must honor the warrior’s tradition. If the flag you discover is not already in the form EnXp{...flag...}, then submit it in this format: EnXp{flag}\n\nFor example, if the flag you retrieve is Imu{WillDie}, submit it as: EnXp{Imu{WillDie}}\n\nHowever, if the flag is already in the correct format, such as EnXp{Imu{WillDie}}, simply submit it as is.\n\nThe galaxy awaits, explorers! Enter the password, activate Light Speed, and prepare for the next chapter in our epic journey!\n"}, {"name": "Steal the Battle Ship", "desc": "Congratulations, brave explorers! You’ve overcome great trials, and the gates of Yakin are now open! Your determination and strength have brought you this far, but the journey is not over yet. Now, we face a new challenge—one that requires cunning and skill.\n\nTo continue on our quest for the One Piece, we need battle ships to soar through the stars. The enemy's ships are mighty, but they will be ours. We must infiltrate their system and steal a battle ship to carry us forward.\n\nBut beware, explorers. The Force within you has weakened, and this task will be more difficult. Logging into the enemy’s system will require every ounce of your skill and focus. Yet, we are warriors, and no system is too strong for us to break through! Once you succeed, our adventure toward the One Piece will continue at full speed.\n\nWarrior’s Code: As always, respect the warrior's tradition. If the flag you retrieve is not already in the form EnXp{...flag...}, submit it like this: EnXp{flag}\n\nFor example, if the flag you uncover is MilleniumFalconXGoingMerry, submit it as: EnXp{MilleniumFalconXGoingMerry}\n\nHowever, if the flag is already in this format, submit it as is.\n\nThe stars await, explorers! This is your moment. Secure the ship, and let our journey to the One Piece continue!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/rev/Steal_the_Battle_Ship/Steal_the_Battle_Ship.exe.xz"]}, {"name": "The Force Awakens", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/rev/The_Force_Awakens/Force_Awakens.exe.xz"], "desc": "All The Brave Explorers, Congratulations on Being a Good BOY! You’ve proven your worth, and the journey ahead is now open to you. But remember, this is just the beginning! Your strength, courage, and unyielding spirit have been recognized by the universe, and now it’s time to harness The Force within you. It is your greatest weapon, the key to defeating the enemy and reaching the One Piece.\n\nThe path to freedom from Yakin is close, but there is one more obstacle in your way. The enemy’s machine is powerful, but thanks to the Force, we’ve weakened its defenses. Now, it’s up to your skills and determination to break through and open the door of Yakin.\n\nBut be quick, brave explorers—time is not on our side. The journey is long, and even the strongest of us have limits. Your Force is strong, but you must move swiftly. Successfully logging into the enemy’s system will grant you the next piece of the puzzle and the correct flag needed to continue.\n\nWarrior’s Code: Once again, you must honor the warrior’s tradition. If the flag you discover is not already in the form EnXp{...flag...}, then submit it in this format: EnXp{flag}\n\nFor example, if the flag you retrieve is Imu{WillDie}, submit it as: EnXp{Imu{WillDie}}\n\nHowever, if the flag is already in the correct format, such as EnXp{Imu{WillDie}}, simply submit it as is.\n\nThe Force is with you, explorers! Now go, unlock the door, and press on toward your destiny.\n"}, {"name": "The Quest for Laughtale Unveiling the Hidden Coordinates", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/rev/The_Quest_for_Laughtale_Unveiling_the_Hidden_Coordinates/Pwd", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/rev/The_Quest_for_Laughtale_Unveiling_the_Hidden_Coordinates/check.exe.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2024/rev/The_Quest_for_Laughtale_Unveiling_the_Hidden_Coordinates/verify.exe.xz"], "desc": "Explorers, we did it! Congratulations on successfully engaging the Light Speed drive. Your bravery and skill have brought us out of the enemy's grasp, and we've outrun their fleet. As we made the jump into hyperspace, the stars blurred into streaks of light, and in an instant, we left the enemy behind. The tension in the air is finally easing—our ship no longer trembles with the impact of energy blasts, and the enemy’s pursuit has ceased.\n\nBut in the chaos of the escape, we faced an unforeseen dilemma. In the rush to initiate Light Speed, we couldn’t calculate our destination in time. Now, we’re drifting through the vast unknown, far beyond the reach of any charted space. The good news? During that final, war-like sequence, something miraculous happened. As we dodged and weaved through their attacks, our countermeasures activated at just the right moment. The enemy tracking device—a tool they’d used to follow us relentlessly—was jettisoned, torn away during the final surge of Light Speed.\n\nWe are now truly untraceable, explorers. Free from their eyes, untethered from their technology. They can no longer find us in this sea of stars.\n\nBut your journey is far from over. Since you've proven yourselves worthy so far, I’m going to provide you with something extraordinary—the location of Laughtale, the legendary destination known to exist at the edge of the universe. But don’t get too excited just yet; this knowledge is locked behind a series of challenges designed to test only the most worthy explorers. If you’re not up to the task, you’ll never see it.\n\nHere’s how you’ll find it: Your task is to crack the Pwd file and enter the pass to win.\n\nThe pass key for this file will serve as input to check.exe. Once you've found the serial of that pass key and received a positive response from check.exe, you will move to the next step.\n\nIn the next step, you'll use verify.exe, where the serial from check.exe will be your name, and the Registration number and keys are actually the secret coordinates—smartly hidden from the world. If verify.exe gives a positive response, it means the Registration number and keys are the correct coordinates.\n\nTo submit the flag, take the first half of the Registration number and the second half of the Registration key, and present it under EnXp.\n\nFor example, if the Registration number is 123 and the Registration key is 56789, your final flag will be:\n\nEnXp{1:789}\n\nGood luck, warrior! The path to victory awaits.\n"}]}