{"crypto": [{"name": "DragonsLair Part 2", "desc": "You’ve breached the dragon’s sanctum, but its malevolent essence still lingers. On a pedestal rests a scorched scroll (output.txt), a cryptic mind-trap humming with arcane power. Its script is no ordinary rune—it is an ancient sorcery woven from the logic of elliptic curves and isogenies.\n\nDecipher the scroll, recover its secret, and banish the dragon’s echo—before it consumes you.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/crypto/DragonsLair_Part_2/output.txt"]}, {"name": "Not So Prime", "desc": "My primes are not so prime anymore. Some chinese gobbled them up using the best number and put them back together all wrong.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/crypto/Not_So_Prime/output.txt"]}], "misc": [{"name": "Never Gonna Solve You", "desc": "An old classic arrived in our inbox, seemingly just a nostalgic trip. We suspect a troll, but maybe there's more to this performance than meets the eye. Inside, we both know what's been going on. weknowthegameandweregonnaplayit\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/misc/Never_Gonna_Solve_You/RememberMe.jpg"]}], "osint": [{"name": "Bored Waiting", "desc": "I was so bored waiting there that I started recording people.\n\nFlag Format: EnXp{time_location}\n\nExample flag: EnXp{12:30PM_location}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/osint/Bored_Waiting/boredwaiting.mp4.xz"]}, {"name": "Doors will open on the left", "desc": "It was just another morning commute, the rhythmic clatter of the tracks a familiar sound as the world slid past the window in a blur of green. My eyes caught a small, unassuming sticker near the door, a number 8. It seemed insignificant, but it sparked a question: who actually built this specific carriage? Your task is to figure out the train's supplier and confirm its starting and ending stations.\n\nFlag Format: EnXp{source_destination_supplier}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/osint/Doors_will_open_on_the_left/leftdoor.jpg"]}, {"name": "Lights out and here we go", "desc": "Author: AronYogurt\n\nI went to see an event earlier this year and saw this car there. A British Knight was quickest at 1:15.484 to lap the circuit. I stayed at a hotel that looked like a mansion from the front, which was about 15 minutes from the place. But I forgot the name of the hotel. Can you help me remember the name?\n\nFlag Format: EnXp{HOTEL_NAME} Example flag: EnXp{HOTEL_RADISSON_BLU} Example flag: EnXp{OSTELLO_BELLO_ROMA}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/osint/Lights_out_and_here_we_go/car.jpg"]}, {"name": "Top Gun", "desc": "An old April '64 file is my only clue to a legendary spy plane. The stories about it are endless, but I'm trying to piece together the hard facts from its early days. The logbooks must contain the truth. Your mission, should you choose to accept it, is to find the file and tell me: the sheer weight of its very first takeoff, specific tail number that first took its detachment past Mach 3, date and time flight 20 was programmed for.\n\nFlag Format: EnXp{weight(inlbs)_aircraftnumber_time_date(ddmm)}\n\nExample: If the weight was 5000 lbs, aircraft number 985 and time and date were 22:00 hours on March 5 Flag will be EnXp{5000_985_2200_0503}\n"}], "rev": [{"name": "Clockwork", "desc": "Hmmmm… what could this be? A quiet little machine keeps ticking, its gears moving in a pattern you can’t quite figure out. Something’s hidden inside, just waiting for the right touch to reveal its message\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/rev/Clockwork/clockwork_pieces"]}, {"name": "Compute at your own risk", "desc": "In the void between stars, Enrico Pucci left behind a machine that counts beyond reason. It bends numbers like gravity, orbiting closer to a perfect balance, then collapsing. Each input drags you deeper into its cosmic recursion. Find what it seeks before it completes its divine calculation which equals f(10289)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/EnigmaXplore/2025/rev/Compute_at_your_own_risk/slow_bin"]}]}