{"crypto": [{"name": "Cipherception", "desc": "A brilliant cryptographer was last seen working on an ultra-secure encryption scheme before vanishing mysteriously. His final notes mention something about ‘layers of encryption’—but all that remains is a strange file containing a public key, an encrypted number, and a cryptic hint.\n\nRumor has it that he never trusted a single method of encryption. Can you break through the layers and recover the flag?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/crypto/Cipherception/challenge.txt"]}, {"name": "Crypt0n1um Vault", "desc": "The notorious hacker group \"Phantom Protocol\" has been using a sophisticated multi-layered encryption system to protect their secret messages. One of our agents managed to infiltrate their system and extracted their encryption code along with a secured message file. We need your expertise to reverse-engineer their encryption scheme and recover the flag hidden within.\n\nThe message is protected by a complex combination of RSA, AES, and XOR encryption techniques. Your mission is to carefully analyze the layers and retrieve the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/crypto/Crypt0n1um_Vault/challenge.txt"]}, {"name": "Encrypted Echoes", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/crypto/Encrypted_Echoes/Challenge.png"], "desc": "A renowned cryptographer, Dr. X, vanished under mysterious circumstances, leaving behind only a single image. Before disappearing, he whispered to his assistant: \"The key is hidden within... but you must break the cipher to hear my final message.\"\n\nRumors suggest that the image contains an encrypted transmission—one that only the most skilled minds can decode. Can you uncover Dr. X’s last words?\n"}, {"name": "Operation Matrix Guardian", "desc": "The shadowy organization known as \"The Grid\" has been intercepting classified government communications for months. Intelligence reports suggest they're using advanced mathematical techniques to secure their internal messages.\n\nOur field agent managed to exfiltrate a partial decryption system and an encrypted message from one of their terminals. However, during the hasty escape, some components of the system were corrupted. The message is believed to contain the access codes to their central communication hub.\n\nYour mission: Repair the decryption mechanism and recover the flag hidden within their system. Time is critical - each day The Grid remains operational puts more lives at risk.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/crypto/Operation_Matrix_Guardian/lattice_challenge.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/crypto/Operation_Matrix_Guardian/xor_key.txt"]}], "misc": [{"name": "CryptoMix Madness", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/misc/CryptoMix_Madness/Hint.txt"], "desc": "A brilliant cryptographer once designed a secret verification system to protect valuable information. The system, known as CryptoMix Madness, uses a series of transformations to encode the final message.\n\nTo prove your cryptographic prowess, you must correctly apply the some transformations.\n\nCan you crack the code and claim the ultimate reward?\n"}, {"name": "Lost Transmission", "desc": "A rogue operative was transmitting classified data when their signal was intercepted. Our analysts recovered only a single file from the transmission—final_challenge.mp3.\n\nHowever, something feels off. No traces of audio data exist in the file, and attempts to play it result in static. The intelligence agency believes that the operative may have used unconventional methods to conceal the data.\n\nYour mission is to uncover what lies within and retrieve the lost information before it disappears forever.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/misc/Lost_Transmission/final_challenge.mp3.xz"]}, {"name": "Silent Whispers", "desc": "A cryptic image was intercepted from an underground hacker forum—hearme.jpg. At first glance, it appears to be just an ordinary picture, but intelligence reports suggest otherwise.\n\nThe sender, known only as \"GhostCipher,\" is infamous for embedding secret messages in plain sight. Rumors say that critical information has been hidden within this image, accessible only to those who know where to look.\n\nCan you decode the hidden message before it vanishes into the void?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/misc/Silent_Whispers/hearme.jpg"]}], "pwn": [{"name": "Madate Vanter", "desc": "Lost in the depths of an obscure, self-hosted service, you find a strange application that seems to reveal hidden addresses. But before you can make any use of it, you realize access is locked behind layers of security. Can you manipulate the program to leak critical information and take control?\n\nA single misstep, and you might vanish into the void—unless you can find the right address and take control of execution.\n\nConnect to the remote service and prove your skills in binary exploitation!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/pwn/Madate_Vanter/magic_function_finder"]}], "rev": [{"name": "Bitmap Mystery", "desc": "You have intercepted a mysterious BMP file, but its contents seem to be encoded. Your task is to analyze the given Python script and extract the hidden flag from flag.bmp.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/rev/Bitmap_Mystery/compressed.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/rev/Bitmap_Mystery/compressed_data"]}, {"name": "Cipher Maze", "desc": "A hidden mechanism scrambles the flag, making it unreadable. Can you analyze the logic and recover the original message? Use your favorite reversing tools to break it open!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/rev/Cipher_Maze/chall"]}, {"name": "Gates of Iron", "desc": "The ancient gate stands firm, locked by an unseen force. A secret sequence must be spoken—precise, unyielding. One mistake, and the path remains closed. Can you find the key?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/FooBarCTF/2025/rev/Gates_of_Iron/iron_gate"]}]}