{"net": [{"name": "Atlas", "desc": "NETWORK\nAfter jackin' into the groundstation, we scoped out the GPS satellite we need - Atlas. We gotta reach it, hack it, and plant the GovGPT agent inside. It’ll handle the rest, findin' the island and all that. Sucks though, if things go wrong, we can't even get rid of it.\n\ngovGPT agent:\n\nE071119BFC83EF5C84AF01DEC888940CB191B8C006A10F130E7D0D5CF34D6C8A\n"}, {"name": "Wi fi", "desc": "NETWORK\n- \"Ok now that we are here the plan is simple: you sneak past those 4 beefy and angry dudes, enter the building and steal the keys to a boat, then you come back.\"\n- \"Why me? I'd rather stay alive. You go.\"\n- \"...change of plans. Let's crack their Wi-fi instead.\"\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/InterlogicaCTFs/2024/net/Wi_fi/ShipyardWiFi.cap"]}], "rev": [{"name": "Memory dump", "desc": "The door to the ground station's main control room is closed, but we found an old disabled GMS-06 defense droid. It seems it was being worked on when the bombs fell. There's still a USB key attached to it with a DFSec logo on it. We managed to read the key: it seems to be some kind of memory dump from the droid. Maybe we can use it to retrieve the entrance code to the station's control room.\njmp .up\n.down:\npop eax\npush 0xD68C67D9\ncall eax\npush 0x1154286C\ncall eax\npush 0x1B1A1E19\ncall eax\npush 0x161B2D02\ncall eax\npush 0x1A372608\ncall eax\npush 0x2917094C\ncall eax\nmov eax, 4\nmov ebx, 1\nmov ecx, esp\nmov edx, 0x18\nint 0x80\nmov eax, 1\ndec ebx\nint 0x80\n.up: call .down\nxor [esp+4], ebx\nmov ebx, [esp+4]\nret\n"}], "steg": [{"name": "Blessings for the Future", "desc": "Armed with the bounty of resources discovered within the remote building, we embark on a journey to a bustling market — a beacon of resilience and community in the post-apocalyptic landscape. Here, amidst the chaos and clamor, we share the treasures unearthed, offering sustenance, equipment, and tools to fellow survivors in need. In this act of generosity and camaraderie, we sow the seeds of hope and forge bonds that transcend the trials of the present. As we engage in the delicate dance of sharing and bartering, we remember that these exchanges are not merely transactions of goods but blessings for the future — a testament to the enduring spirit of cooperation and solidarity. Through our actions, we lay the foundation for a brighter tomorrow, where mutual support and compassion reign supreme. We embrace the power of community and the promise of a shared future as we navigate the challenges that lie ahead.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/InterlogicaCTFs/2024/steg/Blessings_for_the_Future/blessingsforthefuture.png"]}, {"name": "Echoes from the Past", "desc": "In the aftermath of a devastating nuclear explosion, the souls lost many years ago linger in the digital ether, silently observing and supporting our mission. Through hidden messages embedded within seemingly innocuous images, they communicate with us, offering crucial guidance and aid. We must unravel the mysteries concealed within these echoes of the past to survive and succeed in our mission. Every pixel holds a secret, every whisper a clue—listen closely, for the souls of the past guide our path to survival.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/InterlogicaCTFs/2024/steg/Echoes_from_the_Past/echoesofthepast.jpg"]}, {"name": "Gifts of the Present", "desc": "Within the hidden recesses of the remote building, we uncover a cornucopia of sustenance, equipment, gear, and tools essential for survival. This stash, carefully concealed yet now revealed through our perseverance and decoding prowess, offers a beacon of hope in the bleak aftermath of disaster. As we gather these invaluable resources, we remember that they are not merely relics of the past, but gifts of the present — testaments to resilience, preparedness, and the enduring spirit of survival. We embrace the abundance bestowed upon us and carry forth the mission of aid and empowerment to those in need. In this challenge lies not only the keys to sustenance but also the embodiment of generosity and solidarity amidst adversity.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/InterlogicaCTFs/2024/steg/Gifts_of_the_Present/giftsofthepresent.png"]}, {"name": "Whispers of the Past", "desc": "Having deciphered the enigmatic messages from the souls lost in the nuclear catastrophe, we are led to a remote building nestled in the desolate desert. Here lies a treasure trove of resources crucial for survival, waiting to be unearthed and shared with other unfortunate survivors. Our journey towards resilience and generosity begins here, as we harness the knowledge bestowed upon us to extend a lifeline to those in need. We must let the whispers of the past guide us as we embark on this noble quest of discovery and altruism.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/InterlogicaCTFs/2024/steg/Whispers_of_the_Past/whispersofthepast.png"]}]}