{"crypto": [{"name": "Attn Agents", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/Attn_Agents/ATTN.txt"], "desc": "crypto easy\n\nWe heard a distress call and received a transmission. Only this text came through. You better take a look at this at once! It's definitely not Greek, I'll tell you that right now.\n"}, {"name": "Crack a Mateo", "desc": "crypto easy\n\nYou are an intern for the pentesting company \"John Doe\". They are currently performing an penetration test for Amazon. The OSINT team was able to obtain a conversation between a high value target and another employee. A file was also discovered which is believed to to belong to the high value target. Unforutnately, this is protected with a password. They tasked the password retrieval process with you. Obtain the password to further the engagement, no pressure :)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/Crack_a_Mateo/challenge-image.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/Crack_a_Mateo/flag.pdf"]}, {"name": "HashCraft", "desc": "crypto medium\n\nThe penetration testing team faces a challenging task: decrypting a file protected by a password known only to its meticulous owner. Historical password patterns have been uncovered, revealing a sequence of attempts: adminbackup, adminbackup1, !adminbackup1. Despite these insights, none have successfully unlocked the file. The task at hand requires a strategic approach, crafting a custom rule that mutates the foundational password, adminbackup, into a variant that has yet to be tried.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/HashCraft/encrypted_backup.zip"]}, {"name": "adveRSAry", "desc": "crypto medium\n\nYou have intercepted an encrypted message from the RB back to Dr. Tom!!!! The component values of Dr. Tom's public key are obviously readily available, but one of the components of his private keys was accidentally published as well! We've been eavesdropping on channels that Dr. Tom frequently uses, maybe these keys can be used to decrypt this traffic? The included files contain a message to decrypt, and the key components discussed.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/adveRSAry/intercepted", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/adveRSAry/publicKeys"]}, {"name": "corporateEspionage", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/corporateEspionage/BreakoutMeeting.jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/corporateEspionage/RickComputer1.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/corporateEspionage/RickComputer2.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/corporateEspionage/ShaneTrash.jpg"], "desc": "crypto hard\n\nAs a Junior developer at the Weyland Yutani corporation, you're used to working for the good of the company's mission. However, something seems to be amiss with two of your co-workers Rick and Shane. There has recently been a breach of company secrets on the dark web, and rival companies are excited to rival Weyland Yutani in the asteroid mining business. You suspect Rick and Shane are responsible for this theft, but in order to get the evidence to convict them, you need to determine the shared secret key they've been using. By tailing them around the office, you've recovered several artifacts that may help you determine their shared key. Rick and Shane are new at this, you should verify these artifacts for accuracy. These artifacts include a half-erased whiteboard from one of Rick and Shane's breakout meetings, two screenshots from Rick's computer, and a scrap of paper that didn't make it into Shane's trash can.\n"}, {"name": "cyber artifacts", "desc": "crypto hard\n\nYou have woken up with sand underneath your back, you hear the ocean WAVs and smell the salty water, and looking straight above is the bright blue sky. Your memory is a bit groggy but you have a recollection of how you got here, a bad boating accident. You feel around in your pocket and there is a paper titled Shadows of the Digital Abyss with some weird story on it. As you are reading through that paper you hear the ocean WAVs beating against the sand dunes ahead. You notice something in the sand and you go to investigate but it's just a glass bottle. In that bottle is a rolled up piece of paper, with literally gibberish. Just all letters and numbers! This seems like a treasure hunt, or possibly even a fever dream.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/cyber_artifacts/Shadows_of_the_Digital_Abyss.docx", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/cyber_artifacts/some-kinda-code.txt"]}, {"name": "its not greek to me", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/its_not_greek_to_me/JustSomeNormalPyramids.bmp"], "desc": "crypto easy\n\nA local museum was recently hacked by an unknown threat actor. Upon investigation, we found that an administrator's password was sucessfully entered and a former employee sent a suspicious email the day prior to the incident. However, the only information found in the email was this image file. Is there any way the admin password could have been transferred in secret?\n"}, {"name": "mutant mayhem", "desc": "crypto hard\n\nTo prevent the RB from impersonating any communications coming from you to our team, we need to employ an extremely secure digital signature algorithm. One of the most secure signature algorithms out there is the one used for bitcoin and ehtereum. Using the same Elliptic Curve used for those cryptocurrency calculations, hash and send me the message \"Establishing a Secure Connection... :)\". You also needed to provide me with the signature so that I can verify what was sent. The private key and other needed information is included in the file attached. Good luck agent!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/crypto/mutant_mayhem/importantInfo"]}], "forensic": [{"name": "All Along the Watchtower", "desc": "forensics medium\n\nOur informant has met back with us at base. He has stolen a file from a suspect who’s starting to show dangerous signs of cyberpsychosis. Aside from his unending lust for bloodshed, our informant noted that the suspect would not shut up about “rats making him crazy” as well as the term “Base FFFF+1” but that’s probably just nonsense. Anyways, can you look beyond the layers of this corrupted file to extract the information that we need?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/forensic/All_Along_the_Watchtower/the-panglao-watchtower.jpg"]}, {"name": "groovy", "desc": "forensics easy\n\nYou know you're getting old when you hear the music these kids are putting out and all you think is \"no thank you.\"\n\nAnyway, I'm too old for this or maybe I need some cybernetic ears or something. Maybe you'll like these groovy tunes.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/forensic/groovy/sick_jams_dude.wav"]}, {"name": "locked out", "desc": "forensics medium\n\nI made this zip folder a while ago and I can't remember the password! I know I made it a very secure password, so wordlists won't help... can you open this folder without the password?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/forensic/locked_out/locked-out.zip"]}, {"name": "netrunner detected", "desc": "forensics easy\n\nThe netrunners were detected in our network. They used LOTL tactics and utilized nmap but we don't know what the traffic means or what their ultimate goal was. Can you replicate the nmap scan based off the captured traffic?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/forensic/netrunner_detected/net-runners-detected.pcapng.xz"]}, {"name": "secret tunnels", "desc": "forensics hard\n\nAn attacker has accessed the corporate network and is exfiltrating the flag!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/forensic/secret_tunnels/secret-tunnels.pcapng.xz"]}, {"name": "substitute detail torrent", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/forensic/substitute_detail_torrent/Blob.wim"], "desc": "forensics easy\n\nWe've been given a file and need to figure out what url it was downloaded from.\n"}, {"name": "vibrations", "desc": "forensics hard\n\nWhile managing some of our thermal systems, we noticed unusual behavior. We collected the network traffic, see if you can find anything unusual.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/forensic/vibrations/final.pcapng.xz"]}], "misc": [{"name": "Augmented and Fragmented", "desc": "misc easy\n\nArtificial intelligence makes me shiver. How could anyone ever try to outsmart something that can read you in a million ways? Maybe it's not about how much you can see, but what you choose to see. Like in the alien hunters in the Predator movie, it only needed a handful of filters before it saw what it needed to see out in the Open. Even then it's not enough to Solve it. Hidden in plain sight. Hidden in the little bits.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/Augmented_and_Fragmented/nicc_aug3.png"]}, {"name": "data divergence discovery", "desc": "misc easy\n\nI received these 2 files in an email and they mysterious sender asked me to find the differences between the files. I cannot seem to figure out the differences, it looks all the same to me! Can you help me spot the differences.\n\nOnce you find the differences, make to sure to encapsulate it in jctf{answer}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/data_divergence_discovery/neon-echoes-1.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/data_divergence_discovery/neon-echoes-2.txt"]}, {"name": "future packet", "desc": "misc hard\n\nYour neighbors down the block own a small retail business that is taking off! Their sales are doing great, their customers are happy and employment is stable too. A random afternoon you get a call from them saying they think they were hacked (OH NO)! As the well known, and super knowledgeable cyber security specialist you are, you run down to try to help them remediate the problem ASAP. You notice that there is some sort of malware on the accounting computer, that is asking for encryption authentication. You need to figure out the code to get in there and find that flag! One piece of evidence was found in the network on one of the servers, check the network and see what you can find, the more time they have on there, the more they can take for ransom!\n\nFlag Format (all uppercase): jctf{FLAG1_FLAG2_FLAG3}\n\nNOTE: Windows, Mac, and Linux systems are able to use Cisco Packet Tracer.\n\nYou can create an account and download Cisco Packet Tracer for free from the website: HERE or you can find a copy of packet tracer HERE\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/future_packet/future-packets.pkt"]}, {"name": "surf n turf", "desc": "misc medium\n\nOur NICC agents have received these files from high command to help determine a potential base of operations. High command has encrypted the location of the potential base of operation to prevent the Rogue AI from knowing their movements. The file containing a voice prompt will help you get into the file telling where the potential base may be.\n\nNote: Once you figure out the location and there are spaces, replace them with underscores. jctf{Name_of_Location}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/surf_n_turf/location.txt.aes", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/surf_n_turf/password.wav"]}, {"name": "the droid youre looking for", "desc": "misc medium\n\nCan you analyze this file and see if there's any data of interest?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/the_droid_youre_looking_for/app-debug.apk"]}, {"name": "wi will wi will...", "desc": "misc medium\n\nOne of our analysts captured this traffic which contains some important communications, but they weren't able to see the data, can you get it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/misc/wi_will_wi_will.../sniff-01.cap"]}], "osint": [{"name": "beyond the packet", "desc": "osint medium\n\nNICC netrunners have intercepted network traffic sent over an insecure channel. It seems there are messages located somewhere sent by a suspect we believe to be under the influence of the Rogue AI. Perhaps there is a way to find information about where he plans to meet our informant for an exchange of secrets.\n\nFlag Format - (special characters allowed, use dashes instead of spaces and no capitalization of letters) jctf{name-of-location}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/osint/beyond_the_packet/insecure_traffic.pcapng.xz"]}, {"name": "coasting underground", "desc": "osint easy\n\nI am currently lost. I am trying to find a local attraction at my current location, but can't seem to remember the name. Can you figure out what the name of this nearby attraction is called?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/osint/coasting_underground/flag.jpg"]}, {"name": "thanks ray", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/osint/thanks_ray/Notjustcubes.wav"], "desc": "osint medium\n\n    I'm not gonna lie. With all of the information I'm absorbing, I'm about to lose my mind. It's times like these that I understand how someone could go crazy like Mr. 4-sided-earth himself. Okay, maybe not as crazy as him, but you get the idea.\n    Speaking of - I really do wonder how he got obssessed with cubes.\n    Simon got an interview with him the other day where it seems like it wasn't just about cubes...\n    Ray mentioned writing it down, but I thought he only wrote the blog.\n    I guess I'm wrong. Mind finding it for me? Stick to the federal stuff, please - Ray didn't trust the Googles.\n    When you find it, tell me what he was doing business as when he published the book, the page count, and the alpha-numberic registration id.\n"}, {"name": "this is not the flag you are looking for", "desc": "osint easy\n\nI received this note with this code. Enclosed with it, it asked for help finding a specific US Navy ship that was linked to this code. Can you decipher this code to give me the name of this US Navy ship and the type of ship it was with its associated number?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/osint/this_is_not_the_flag_you_are_looking_for/motto.PNG"]}, {"name": "where is it", "desc": "osint easy\n\nI found this image online, and it's blurry, I can't see all its details!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/osint/where_is_it/WhereIsIt.jpg"]}], "pwn": [{"name": "MathTest", "desc": "bin/rev easy\n\nSolve three multiplication questions and get a flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/pwn/MathTest/mathtest.c"]}, {"name": "PasswordManager", "desc": "bin/rev easy\n\nDue to the onerous password requirements at NICC (four characters), Mary Morse decided to write a password manager for herself. Unfortunately, all it does it tell you if you guessed the password correctly. Can you crack it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/pwn/PasswordManager/pw"]}, {"name": "RunningOnPrayers", "desc": "bin/rev hard\n\nNo hard reverse engineering, no massive file to debug, just a vuln function, a gift and a dream.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/pwn/RunningOnPrayers/RunningOnPrayers"]}, {"name": "StageLeft", "desc": "bin/rev hard\n\nYou get the overflow but by so few bytes. If only there was a way to read more input.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/pwn/StageLeft/StageLeft"]}, {"name": "humble beginnings", "desc": "bin/rev easy\n\n    In a city completely integrated with technology and living expenses through the roof, one way to get ahead is to become a netrunner.\n    One day while browsing at a convenient store you notice that someone installed a crypto skimmer at the checkout counter.\n    This normally would charge the person an unnoticeable amount more but luckily you have a blocker on your wallet.\n    Through a slight of hand, you snatch the device.\n    You wonder: Can I gain access to the crypto wallet on the device?\n    Encase the found crypto address as follows jctf{ADDRESS}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/pwn/humble_beginnings/skimmer.exe.xz"]}, {"name": "searching through vines", "desc": "bin/rev easy\n\n    We got access to a terminal that the netrunners recently abandoned, it might have some useful information.\n    Can you find a way to navigate the file system and see if there is anything of interest?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/pwn/searching_through_vines/main.c"]}], "web": [{"name": "N0D3BR3ACHERs", "desc": "web hard\n\nWelcome N0D3BR3ACHER intiate, your trial to become one of us, get the /etc/passwd file for this web server. We were able to get some of the project source code but we lost access, do what you can with it. Our informant had mentioned a major restructuring of their application, the vulnerable python code is no longer part of the application base.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/web/N0D3BR3ACHERs/jctf4-web-nodebreachers.zip"]}, {"name": "runner net", "desc": "web medium\n\nGreat work cracking that pcap file! I think we saw some interesting traffic, and we were definitely onto something with Dr Tom's blog. Unfortunately - security seems tight.\n\nBut fortunately for us - people are the weakest link and some people might still be celebrating st. paddy's based on this network capture we grabbed. Check it out and see if they slipped up anywhere. It might be helpful to cross compare the old one, while you're at it.\n\nI can't help but think there's more than that. Mary and Maya said they found a way in, but typical them - they're MIA. Probably back dancing the night away again.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2024/web/runner_net/itsacap.pcap.xz"]}]}