{"crypto": [{"name": "Almighty Alphabet", "desc": "malanka\n\nThe criminal alphabet, the noir alphabet, the alphabet of a private detective, and whatnot, but there is still something mystical that doesn't look like an alphabet, but at the same time it hides the magical message.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/crypto/Almighty_Alphabet/solveit.png"]}, {"name": "CryptoPass API", "desc": "mel\n\nRoko managed to build some application that allows members of the consortium to store their private data We need access to the admin account in order to read their secret plans and possible misdeeds they'll carry out in the future Unfortunately, there's no account system and we can only login as guest Can you help us?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/crypto/CryptoPass_API/server.py"]}, {"name": "Let s Break Something at LoWE s", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/crypto/Let_s_Break_Something_at_LoWE_s/Lets_Break_Something_at_LoWEs.zip"], "desc": "Raunak Singh\n\nMary and Maya were in LoWE's to grow their crypto toolbox, when Maya saw some mysterious white seagulls... or drones, hovering around the building. Suddenly, a gust of wind made one of the drones drop a blue paper on Maya's head. Mary thinks it might have the structure and inner workings of \"The Turing Lock\". Can you open it to see what's inside? At the LoWE's Pro Desk, Maya spotted an oracle at , but she's not sure if it can help...\n"}, {"name": "The Hidden Key", "desc": "Dylan\n\nAn anonymous party was using Wireshark looking network activity and stumbled across this encrypted text, they then notified NICC and sent the file. This could be a key to something.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/crypto/The_Hidden_Key/TheHiddenKey.txt"]}, {"name": "Vignalysis", "desc": "IH\n\n    We intercepted a message but it seems to be encrypted. We know it is a vignere cipher that was used but do not know the key or key length. Can you crack it?\n    note: The text has been changed to lowercase and only alphabetical letters were used. The text is in the English language. search \"jctfv\" in the decrypted text to find the flag. It will be between two \"jctfv\" tags. ex: jctfvflagherejctfv = jctfv{flaghere}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/crypto/Vignalysis/encryptedText.txt"]}, {"name": "sandy shores", "desc": "thatLoganGuy\n\nThe sun begins to set as the investigator finds a clue that will change the course of his investigation. The remnants of the thief's equations lay partially washed away in the sand. The equation that lies in the sand is \"y^2 = x^3 + __x + __ mod 373\". These underscores represent where a number was written but has been washed away. More notes lie in the sand as well, including a coordinate (7,39), and the number 27. The investigator knows that this coordinate and number must be used this equation somehow... but what's missing? Our detective is able to deduce more notes hidden in the underbrush just out of reach. Two scraps of paper that correspond to the two gaps in the equation drawn on the beach. The first paper has two phrases crudely scrawled, being \"Fantastic Four Wanted Dead or Alive,\" and \"Issue Number?\". The second paper also has two phrases scralwed, being \"Alfred's first appearence in the batcave\", and \"Original Price?\". If the investigator can deduce these classic comic book clues to determine the missing values of this equation, they should be able to find the coordinate of the thief's lair. Flag: jctfv{(x,x)}\n"}], "forensic": [{"name": "DoNt See Me", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/forensic/DoNt_See_Me/DoNtSeeMe.zip"], "desc": "Dan\n\n“Listen, Detective,” the voice on the other end of the line rasped, like someone who'd seen too many sleepless nights. “Looks like we've got a rat in the precinct. Someone's been feeding the press, and it’s only a matter of time before the whole damn thing blows wide open. We need you to dig through the traffic captures, and Windows Logs, figure out where the leaks are coming from. Find out what’s what was spilled, so we can patch up the holes before the damage is done.”\n\nI leaned back in my chair, the leather creaking like an old man’s bones. Another day, another mess to clean up. But something about this felt different. Dirty, like a secret that had been left out in the open too long.\n\nNote: For this challenge the flag format is NOT jctfv{} but is instead jctf{}\nUnlock Hint for\n"}, {"name": "Dollhouse Confidential", "desc": "Trent\n\nA single artifact holds many secrets, each more elusive than the last. Will you rise to the challenge and uncover the truth hidden within? Download the file here\n\nNote: For this challenge the flag format is NOT jctfv{} but instead jctf{}\n\nhttps://s3.us-east-1.amazonaws.com/njit-jerseyctf/Dollhouse-Confidential/Dollhouse-Conf.zip\n"}, {"name": "Frequencies of Deception", "desc": "Trent\n\nAn intercepted audio transmission carries a veiled warning. Some say it’s just noise, others believe it’s the key to an unsolved mystery. Use your forensic skills to dissect the frequencies and uncover the message lurking in the static. Flag format jctf{}\n\nNote: For this challenge the flag format is NOT jctfv{} but is instead jctf{}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/forensic/Frequencies_of_Deception/unknown.wav.xz"]}, {"name": "Ransom in the Shadows", "desc": "Trent\n\nUnravel the mystery of encrypted data left behind by a sinister attack and recover the hidden key to unlock the shadows. Download the the file here\n\nhttps://s3.us-east-1.amazonaws.com/njit-jerseyctf/Ransom-In-The-Shadows/Ransom-In-The-Shadows.rar\n"}, {"name": "The Veiled Backtrace", "desc": "Trent\n\nA hard drive full of photos. Hundreds of still frames, nothing out of the ordinary. But something’s tucked away — veiled, deliberate. One image holds more than meets the eye. Peel back the layers. Follow the trace.\n\nFlag format: jctf{IP:Port} Note: For this challenge the flag format is NOT jctfv{} but instead jctf{} Note: The IP is not a valid/real IP, this is for your protection.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/forensic/The_Veiled_Backtrace/archive.zip"]}, {"name": "evtx", "desc": "Jan\n\nIt appears that one of the low-level grunts of the NICC organization have gone rogue. They keep trying to get into a user's account by guessing their password. Can you tell us 1. the name of the user who is being targeted with brute force password guessing attempts and 2. the number of times the rogue user has tried to get into the account? The flag should have the format jctfv{Name_Number} where Name is the username and Number is the count.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/forensic/evtx/evtx.zip"]}, {"name": "linux live response", "desc": "Rob B.\n\nOur Linux web server has been compromised. The forensics team has taken a live response image using UAC to investigate the intrustion. Find the IP address of the attacker and the full path to the file where they have left their reverse shell for persistence. Flag format: jctfv{IP address:/path/to/file}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/forensic/linux_live_response/linux-live-response.tar.gz"]}, {"name": "path finder", "desc": "Malanka\n\nThe map with some weird objects stored on a USB flash drive was revealed in one of the New York City's sewage systems...Who left it there? Does it relate to a recent crime on one of NY streets? Or it might be even worse...it was carried through a sewage for miles. Anyway, this is your turn to discover the hidden message.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/forensic/path_finder/path-finder.zip"]}], "misc": [{"name": "A Mysterious Melody", "desc": "mel\n\nOur intelligence operatives have been chasing after a strange secretive operation between Dr. Lei and Roko, where Lei appears to be giving some sort of secret \"upgrade\" to Roko that even his close trusted peers aren't aware of.\n\nJust recently, we were able to gain access to a very important server regarding this operation, but it appears they anticipated us coming and thoroughly wiped their entire hard drive of everything. The only things we managed to recover were some strange music files which appeared to have been generated by Roko himself, along with the access token we came looking for. Unfortunately, they encrypted it before we got there in time.\n\nThe only other information we have regarding this are the messages we intercepted between Lei and Roko. Information regarding the encryption process is that it was using some sort of secret password, and since we know they're quite fond of AES, the lack of an IV makes us pretty certain it's in ECB mode. They also mentioned the use of a primitive hashing scheme and, judging from their past, VERY heavily hate anything with less than 256 bits of security.\n\nWe're unsure what this all means, but we do have the files we exfiltrated from their server. Maybe it has more use than we originally thought.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/misc/A_Mysterious_Melody/intercepted.zip"]}, {"name": "Bitcoin Butterfingers", "desc": "Dave\n\n    A careless RB-affiliated Netrunner fumbled a Bitcoin transaction 11 years ago, leaving a trail across the blockchain. It seems some marshals took hold of our BTC, which originated from only the most legitimate business ventures, of course.\n\n    NICC needs you to follow the money—trace the transactions and find the final wallet holding the flag! But be careful—before reaching the destination, the funds passed through another wallet that you'll need to track along the way.\n\n    The wallet is 1Ez69SnzzmePmZX3WpEzMKTrcBF2gpNQ55 and the transaction is 29.659K BTC! Hopefully that doesn't equal a lot of USD these days...\n\n    The flag format is jctfv{walletHash}\n"}, {"name": "Social Pressure", "desc": "IH\n\n    We need you to geta flag from a company specializing in social engineering. We have word someone named Carl has information on the flag, maybe a colleague? We are going to need you to get that target to email the flag! He probably wont believe any old email though, it needs to come from someone he knows. Luckily we were able to steal the dkim key they use on their email signatures. Can you get flag to be sent to an external email address? Carl probably would boast about this somewhere online. Maybe a forum post or something?\n\n    Something like \"Hey , send an email with that flag to <your_fake_emaiil_address_here>. It is urgent!\"\n\n    Note: To stop this challenge from being used to spam arbitrary addresses, there will not be any email response email sent. Instead you can use a webportal to verify if your email went through successfully and it will give you the flag. The webportal can be reached at http://social-pressure.jerseyctf.com:32000\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/misc/Social_Pressure/default.private"]}, {"name": "Sounds secure", "desc": "Jack Z\n\nAn Agent has left you a message that they received.\n\nYour goal, listen and look at the clues with the file to lead you to the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/misc/Sounds_secure/sounds_secure.mp3.xz"]}, {"name": "The Golden Circle", "desc": "David\n\nA secret agent within The Consortium has made contact with NICC and ACM in hopes of becoming a double agent. In order to identify said agent, a picture was sent to NICC and ACM to decipher and make contact with the agent. Can you figure out this secret agent's pseudonym?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/misc/The_Golden_Circle/noir.jpg"]}, {"name": "The Shattered Cipher", "desc": "Trent\n\nWill figure out challenge description later. The premise is a split RSA key, try to use forensics to uncover where the fragments are hidden on the image.\n"}, {"name": "Transmission Trace", "desc": "IH\n\nWe have logs of a machine where we believe that a transmission was being sent that we did not authorize. It seems like someone exfiltrated a flag during this time. Are you able to find and recover it for us?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/misc/Transmission_Trace/output.pcap.xz"]}], "osint": [{"name": "Da", "desc": "Cyb0rgSw0rd\n\nA stranger walked in off the street, coat dripping from the rain, fed me a story that smelled like a week-old alibi. Said there was a problem, it was urgent. Rumor has it that one of the hand picked agents in a new government agency was already compromised. Not by The Consortium, if the whispers in the alleys are true. One of our older enemies, maybe?\n\nThis one's deep. Real deep. But how deep is that alleged connection? That’s the million-dollar question. Lucky for us, people leave digital footprints the way drunks leave bar tabs—careless, messy, and easy to follow if you know where to look.\n\nIf the rumors are on the level, this guy's got some big balls - bigger than you'd expect for someone playing a double game.\n\nOur team is good, real good. If you can grab us a few bits of information, we can get to the rest and find out for ourselves if this is true. Go shake some trees and knock on doors until you get their primary github username - the one for his diamond business. After that, track down his alleged maternal grandfather's first name and his alleged maternal great-grandfather's first name.\n\nGet us that, and we’ve got leverage. We’ve got a way in. Without it? We’re flying blind, and we don’t have a doge in the fight.\n\nFlag format: jctfv{username_grandfathersinitials_greatgrandfathersFirstName} Example if the username was anonymous, his grandfather's initials were ABC, and his great grandfather's name was Billy: jctfv{anonymous_ABC_Billy}\n\nThe flag will not be case sensitive.\n"}, {"name": "Here I Stood", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Here_I_Stood/2022-07-04.png"], "desc": "Dave F\n\nBack when NICC’s coffers were light enough to be collected in person, I got stuck with the worst job in the outfit—waiting in bank lines that moved slower than cold molasses. That was over a decade ago, but I remember the feeling. Stale air. The tick of the clock. The sound of my patience being ground into dust.\n\nOnly thing that kept me from losing my mind? A bright yellow billboard across the street. Big, bold numbers staring back at me, burning into my brain like a bad memory. A phone number. One I can’t seem to recall now, no matter how hard I try.\n\nThing is, I’m starting to think that number wasn’t just some meaningless ad. It might be important. Dr. Tom Lei seems to think so, too, seeing as his goons have been asking around town non-stop about it.\n\nI dug up a picture of the bank I wasted years at. Maybe you can piece together what my memory won’t. What was the phone number on the billboard?\n\nFlag Format: jctfv{###-###-####}\n"}, {"name": "Layers and Layers", "desc": "Dave\n\nLooks like Dr. Tom is still using Beef N Cheddar - where The Consortium has been gathering online... They talk pretty openly, and it looks like some looselips may have been too confident in the security Dr. Tom set up. Those blabbermouths even left this finger print laying around 99AB8B9756802E8ACE7F0A7A421A949FEAFF133F.\n\nNICC suspects it’s part of the network spreading cyber psychosis—trace its location before the infection spreads further!\n"}, {"name": "On The Shoulders of Giants", "desc": "Evan S.\n\nAnna received some intelligence that The Consortium was trying to get their hands on some machine learning researcher. The intel was scrambled, but the phrase \"machine learning researchers are not good programmers\" kept repeating. She needs to get to the researcher before they do. We called up our friends at Osiris Lab but they haven't seen the professor around the Brooklyn campus in a while... And he's not in the Village either. Maybe he's in hiding or maybe he's just out enjoying one of his hobbies... If he's hiding out, maybe he's spending time with his evil brother? Let's see if we can track them down.\n\nCan you help Anna find the three hobbies they have in common? Once we have that she'll be able to narrow it down. Everything you need should be online, so thankfully we won't need to bother calling anyone.\n\nFlag Format: If a hobby has multiple words, separate those words by a hyphen. Separate hobbies using an underscore _ jctfv{hobby-one_hobby-two_hobby-three}\n"}, {"name": "Pie in the Sky", "desc": "mel\n\nOne of our operatives was investigating Dr. Tom Lei and managed to board a private jet he chartered for some unknown reason. It's unclear whether this is just one of his leisure flights or if it's something else, but given how they seemed to go AWOL moments later it's definitely very fishy. They managed to send us a photo somewhere in the middle of the flight, but beyond that we don't have any idea where she is or where Lei was going. Furthermore, it was also stated by them that when the jet took off from Dublin International on December 30th 2024, an airline related to Lei's mission finished taxiing to Gate 104 after finishing its flight from Lei's target destination. Do you think you could help us track down the airport he landed in, as well as what approximate time he took off? We don't need the exact seconds they left, but we do need to get the minutes.\n\nSpecify your flag in the format jctfv{[4 character ICAO code]-HOUR:MINUTES:[AM/PM]} in GMT For example, if the plane landed in Newark Liberty International at 1:02 AM, the flag would be jctfv{KEWR-01:02:AM}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Pie_in_the_Sky/recovered.png"]}, {"name": "Simon and the Whale", "desc": "medium unlocks others\n\nCyb0rgSw0rd\n\nThe neon buzzed outside Simon’s window, humming like a bad omen. Ever since G0ldenFalc0n7 showed up, things had gotten… complicated. People were vanishing into thin air, reappearing randomly. Dr. Tom was repeatedly coming near campus, despite his usual absense these last few years. Anna, who normally had ice in her veins, was now squirreled away whispering secrets only the walls could hear. Or so she thought.\n\nSimon caught a whiff of something. This whole thing was rancid. While trying to talk to Anna, he overheard her whispering frantically, her voice was barely audible, dripping with a level of warmth and anxious concern he had not heard from her. \"Storing it publicly wasn't smart,\" she whispered. \"You're risking everything, Arthur! You could ... What if it gets pulled?!\"\n\nThat sealed it. Who was Arthur? Something was afoot. Anna would never betray NICC, this was her world! And the other day Simon was told they saw her with someone who looked like the G0ldenFalc0n7...\n\nIs Anna working with The Consortium? Is she working with GoldenFalc0n7? Or is this something deeper?\n\nSimon has his hands full—he needs you to follow the trail. The answers are out there, hidden in plain sight. You just need to look in the right place. Find it and get ready for the next step.\n\nFlag format: jctfv{flag}\n"}, {"name": "Th3 F1v3 P01nt Chas3", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Th3_F1v3_P01nt_Chas3/Location_1.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Th3_F1v3_P01nt_Chas3/Location_2.qt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Th3_F1v3_P01nt_Chas3/Location_3.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Th3_F1v3_P01nt_Chas3/Location_4.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Th3_F1v3_P01nt_Chas3/Location_5.png"], "desc": "LoadinConfusion and N00D135\n\nA new player has emerged, R3d F0x, who has been stirring up trouble in the cybersecurity landscape. Who they are, or what drives them remains a mystery—some say they’re a vigilante, others believe they’re playing a much darker game. Four photos and one video are the only clues to their current location. Maybe by connecting the dots and tracing the constellation, the structure at its center will hold the key. On the day of saturn of this competition, before the light day slips into its final act, an event will occur. The name is the key to unwrap this mystery.\n\nFlag format: jctfv{this_is_what_a_flag_looks_like}\n"}, {"name": "Tinker Tailor Solider Spy", "desc": "Cyb0rgSw0rd\n\nWell, maybe not a tinker... But we need help gaining a foothold against the Consortium and stopping the Turing Lock from completion.\n\nLuckily we have somebody working on some powerful tech. They couldn't make the dead-drop location, but managed to offload it somewhere else.\n\nOur contact said one of the first american spies would mark the spot, but they couldn't remember which spy it was. However, he does know that it's close to that guy who died dueling someone who made some disparaging remarks about his father, among 8 others nearby. So it should be straightforward to narrow down.\n\nGet us the name of the spy and the coordinates, and we'll go pick it up!\n\nFlag Format: jctfv{Lastname_latitude,longitude} Our system won't handle DMS coordinates, so get the DD cordinates for us.\n"}, {"name": "Where Am I", "desc": "Rob B.\n\nWe intercepted this picture from D00mSay3r - Says they were visiting a friend. Can you narrow it down for us? Get as exact as you can - we need to follow their footsteps. Use 3 words to describe the exact location that this photo was taken.\n\nFlag format: jctfv{word1.word2.word3}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/osint/Where_Am_I/where-am-i.jpg"]}], "pwn": [{"name": "Fantaxotic Fledgling", "desc": "Buffer&Overbyte\n\nDeep in a forgotten coal mine of code, a fragile finch guards the gold. With just so many songs to sing, one is bound to crack the silence. Send your message carefully, miner—one wrong note and the finch will scream.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Fantaxotic_Fledgling/fantaxotic_fledgling"]}, {"name": "Hexstore", "desc": "medium piece of the final puzzle\n\nmel\n\n    The Consortium just unveiled their newest project: HexStore.\n    It appears to be an online \"museum\" of sorts, where they share images to the world to better boost their image and align them against us.\n    They seem to be hiding an important \"antique\". We're not entirely sure what it is, but we don't really like the sounds of it. Think you could help?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Hexstore/hexstore"]}, {"name": "Kiddy Pool", "desc": "easy piece of the final puzzle\n\nRobert Blacha\n\nWe've received a message from Golden Falcon! \"Math is hard! If you think you have what it takes to swim with the fishes, take a dive into the kiddy pool!\" Take on his challenge to get the flag!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Kiddy_Pool/kiddy", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Kiddy_Pool/kiddy.c"]}, {"name": "Ladder To Heaven", "desc": "NativeFunction\n\n    You are an employee of a business that uses a Scada system. A technician came to the company, plugged something in, and entered into a debug menu on the main plc of the facility. You are tasked with entering that debug menu so the company can debug the system itself. Luckily you snagged a few screenshots of the technician's source code. What inputs should we provide power?\n\n    Key format: jctfv{__BINARY__} where __BINARY__ is the plc inputs in sequencial order and their given on or off state. Only 0's and 1's, no spaces or anything else.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Ladder_To_Heaven/heaven.png"]}, {"name": "Mallo r cy", "desc": "hard piece of the final puzzle\n\nRobert Blacha\n\nWe've discovered an old note taking service that Dr. Tom Lei was using a couple years back. We suspect that there's still a flag on machine that's running it. NICC has been able to recover the binary files from him, help them see if they can get a shell!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Mallo_r_cy/ld-2.23.so", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Mallo_r_cy/libc.so.6", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Mallo_r_cy/notepad"]}, {"name": "Mayas Terminal Rescue", "desc": "easy piece of the final puzzle\n\nmel\n\n    Maya was doing some indepth research and stated that she discovered some really important intel regarding Loab. Howevever, something happened and we lost contact with her.\n    Our operatives are currently tracing her down, but Loab seems to have caught on. Whatever the case is, we NEED to gain access to that information before she finds it and wipes it from us.\n    We have all of Maya's login credentials, but she seems to have implemented her own login mechanism that we can't seem to figure out.\n    Think you can help?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Mayas_Terminal_Rescue/terminal_rescue"]}, {"name": "Play Fairi", "desc": "easy piece of the final puzzle\n\nRobert Blacha\n\nWe've exfiltrated some code that RB has been using to encrypt some flags! NICC also found along with the code, a snippet of text: yjp}b{k{_vog1pnb2j31dhs1bsptln. We're sure it must be the flag but can't figure out how to undo the encryption.\n\nNote: flag format is jctf{} for this challenge, not jctfv{}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Play_Fairi/file.py"]}, {"name": "Rokos Jersey Lottery", "desc": "hard piece of the final puzzle\n\nmel\n\n    We managed to uncover a mysterious underground lottery going on, hosted by Roko himself.\n    It seems like he's really put all his effort into securing it, but we did manage to extract the crucial data and software before he locked us out for good.\n    We need to grab that flag before he auctions it off for good, can you help us?\n    If it helps, prior to the alleged launch of this lottery, Roko was going on about the number 647389. We're not sure what it means, but it might help.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Rokos_Jersey_Lottery/ld.so.2", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Rokos_Jersey_Lottery/libc.so.6", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/pwn/Rokos_Jersey_Lottery/lottery"]}], "web": [{"name": "Layers of Lies", "desc": "medium crypto\n\nDaniel-Bootnik\n\nYou’ve stumbled upon a mysterious webpage with nothing but a cryptic message: \"Nothing to see here...or is there?\". There must be more to it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/web/Layers_of_Lies/view.php"]}, {"name": "The Heist", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/web/The_Heist/Plan.png"], "desc": "Benjamin\n\nTo pull off a perfect heist you need a perfect crew. You get invited to a \"secret\" heist planning group that have come up with the perfect plan to break into \"K!ngf1sh\" bankvault. The plan was so good in fact you all decided to party the night away. Sadly, once you woke up from the party everyone on your team forgot about the plan and in the end you are own left with a crappy bar napkin with the plans scribbled on. Try to see if you can still pull off the legendary heist.\n"}, {"name": "whats your number", "desc": "hard networking\n\nNoah Jacobson\n\nAnna found this strange website. We do not know much about it but would like to see what we could find. She told me that something strange is happening on the transport layer, can you find out more?\n\nThis challenge requires the ability to spoof source IP addresses. Some ISPs will block this. To help keep the challenge fair, we've setup a relay. Sending a packet to whats-your-number-relay.aws.jerseyctf.com (resolve the IP address) will rewrite the source address to 1.2.3.4 and forward it to whats-your-number.aws.jerseyctf.com. Nothing else is changed besides the source and destination IP address.\n\nPlease note that being behind a NAT or firewall may still prevent the required packets from going through. If you encounter this, you may need to use a cloud provider or VPN that provides direct access to a public IP address. You may want to practice in your LAN first.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/JerseyCTF/2025/web/whats_your_number/whats-your-number.zip"]}]}