{"crypto": [{"name": "Astra and Equinox", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/crypto/Astra_and_Equinox/Description%20and%20hint.zip"], "desc": "Author\n\npmsiam0\n\nHope you guys will enjoy it.\n\nBASE62_ALPHABET = \"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789\" Add a shift within 1–93..\n\nNote: Seed value is actually a key value.\n\nFlag Format: KCTF{Fl4G_H3Re}\n\nHint: Phase One (Astra) – Each character’s ASCII value was turned into a base-62 string (letters/digits) separated by dashes. Phase Two (Equinox) – A pseudo-random shift was applied to each character (within printable ASCII range), controlled by a numeric seed.\n\nThe term “Astra” can metaphorically symbolize the act of mapping standard characters to a higher or “celestial” representation—here, it’s the conversion of ASCII values into base-62 strings. Think of it as elevating ordinary letters/numbers to a “starry” or more complex format. “Equinox” represents the cyclical nature of shifting characters. In astronomy, an equinox is when day and night are of equal length, marking a cycle. In the code, we apply a cyclical shift (with wrap-around) in the ASCII table, driven by a numeric seed.\n"}, {"name": "Forward Yet It Falls Back", "desc": "Author\n\npmsiam0\n\nWe discovered a peculiar string that appears standard but yields gibberish under normal decoding. Some analysts detect suspicious symmetry, hinting at reflection or an inverted dimension. Others suspect hidden block boundaries or a “backwards encoding,” while a few insist it's “rotated on a different axis.”\n\nOur only clue: “Symbols may shift forward, but the key is often in reversing what we think is correct.”\n\nGood luck peeling back the layers—sometimes you must step backward to see what’s right before you.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/crypto/Forward_Yet_It_Falls_Back/Reverse.zip"]}, {"name": "RandomseniorAdleman", "desc": "Author\n\npmsiam0\n\nCommon Encryption findout by senior Adleman.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/crypto/RandomseniorAdleman/senior.zip"]}, {"name": "Reflections in the Random", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/crypto/Reflections_in_the_Random/Chipher.zip"], "desc": "Author\n\npmsiam0\n\nWe’ve uncovered a single string that’s saturated with possibilities. At first glance, it might resemble standard Base64 output—but every attempt to decode it directly results in chaotic gibberish.\n\nSome agents suspect an unconventional passphrase or a stray cosmic phenomenon that shifted the bits; others whisper about symmetrical illusions that hide the real message. We even tried old-fashioned classical ciphers—simple shifts, sub-harmonic permutations, you name it—but the truth remains elusive.\n\nAll we know is that the message is said to be “spun backward from a single pivot,” though no one agrees what that means. Could it mean time is reversed? Maybe it’s an obscure numeric transformation. Rumor has it that if you find “the key,” everything falls into place. Or maybe it’s simpler than we think—just cleverly disguised.\n\nGood luck dissecting this anomaly. Remember: “When the obvious leads nowhere, perhaps the solution sits right in front of you—only viewed from the wrong angle.\n"}], "net": [{"name": "Server and Attacker IP", "desc": "Author\n\nTareqAhamed (0xt4req)\n\nIn this challenge, I've crafted a series of intricate scenarios that will test your investigative skills. You'll dive into a network of secrets, uncover hidden identities, and piece together the story of a complex cyber attack. Each step requires careful analysis and keen observation. There are total 17 challenges & 3 pcap files in this category. The files will be provided accordingly. The answers are there, but they won't come easily—you'll need to think like an attacker and act like a detective. Get ready to unravel the mystery and prove your prowess in this thrilling journey.\n\nWhat are the server & attacker IPs?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/net/Server_and_Attacker_IP/capture1.zip"]}], "pwn": [{"name": "Knight Bank", "desc": "Author\n\nNomanProdhan\n\nIn the heart of the ancient kingdom lies the Knight Bank, a fortress of wealth guarded by its intricate magical arithmetic. Only the most cunning warriors who understand the secret vulnerabilities of numbers can uncover the hidden treasure buried deep within its vaults.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/pwn/Knight_Bank/knight_bank"]}], "rev": [{"name": "Binary Quest", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/rev/Binary_Quest/Binary_Quest.zip"], "desc": "Author\n\nNomanProdhan\n\nIn the far-off kingdom of Valoria, an ancient relic called the “Sacred Flag” lies hidden within a guarded fortress. Legend says only a true knight of cunning and skill can lay claim to its power. Dare you venture into the shadows and emerge victorious? Your journey begins now—onward, brave soul, and seize your destiny in the Binary Quest.\n"}, {"name": "Easy Path to the Grail", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/rev/Easy_Path_to_the_Grail/Easy_Path_to_the_Grail.zip"], "desc": "Author\n\nNomanProdhan\n\nBrave knight, your quest is simple yet essential—unlock the secrets hidden in this binary challenge and tread the path to the grail. The journey will test your wits as you reverse the provided binary, uncovering the treasure within.\n"}, {"name": "Knight s Enigma", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/rev/Knight_s_Enigma/Knight_s_Enigma.zip"], "desc": "Author\n\nNomanProdhan\n\nIn the shadowed corridors of an ancient fortress, a legendary knight once safeguarded a secret so potent that countless contenders have vanished trying to decipher it. Now the seal has cracked, and echoes of its power seep into the present. Test your courage as you follow cryptic traces left by the knight’s hand, unraveling an enigma steeped in the mysticism of ages past. Will your wits prove enough to break the bindings and uncover the realm’s hidden legacy—or will you, too, fade into the swirling mists of history? The choice—and fate—are yours to determine.\n"}, {"name": "Knights Droid", "desc": "Author\n\nNomanProdhan\n\nFor ages, a cryptic mechanical guardian has slumbered beneath the Knight’s Citadel. Some say it holds powerful secrets once wielded by ancient code-wielding Knights. Many have tried to reactivate the droid and claim its hidden knowledge—yet none have returned victorious. Will you be the one to solve its riddles and awaken this legendary machine?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/rev/Knights_Droid/knights_droid.zip"]}, {"name": "Worthy Knight", "desc": "Author\n\nNomanProdhan\n\nThe gates of the Crimson Keep stand locked, sealed by cryptic runes from ages past. Many challengers have tested their might against these ancient wards—yet all were found wanting. Will you speak the correct incantation and earn the Keep’s hidden treasures? Prove your valor and stand among legends… if you truly are a Worthy Knight.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/rev/Worthy_Knight/Worthy_Knight.zip"]}], "web": [{"name": "Exceeding Knight", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/web/Exceeding_Knight/Exceeding_Knight_Source.zip"], "desc": "Author\n\nNomanProdhan\n\nIn the shadows of the ancient realm, a knight watches over unseen boundaries. The path ahead holds secrets known only to those who dare to explore beyond the ordinary.\n"}, {"name": "Knight Connect", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/KnightCTF/2025/web/Knight_Connect/KnightConnect_Source.zip"], "desc": "Author\n\nNomanProdhan\n\nIn a realm where ancient knights and modern technology collide, a mysterious portal emerges—known as \"Knight Connect.\" Only the wisest and most cunning warriors can decipher its secrets. Legends whisper of a forgotten system, guarded by layers of encryption and vulnerabilities, waiting for a brave soul to breach its defenses.\n\nDo you possess the skills to uncover the truth? Enter the domain of Knight Connect and etch your name into the annals of digital knighthood. The challenge awaits.\n"}]}