{"crypto": [{"name": "Electronic Christmas Book", "desc": "Santa's making final preparations with his finalized nice list, but his laptop isn't allowing him to access the new admin panel made by his elves. Since he only has a few names left on the list, he got an elf to send an encrypted screenshot of the page, but he lost the encryption key! He's too embarrassed to ask for help again, so can you figure out how to read the list and help Santa finish his preparations?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/crypto/Electronic_Christmas_Book/nice_list_screenshot.bmp.enc"]}, {"name": "ShaNOISEmir", "desc": "Shamir keeps getting interrupted while sharing his secrets.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/crypto/ShaNOISEmir/ShaNOISEmir.py"]}], "forensic": [{"name": "Hunt and Peck", "desc": "I was going to type out the flag, but I forgot my keyboard. No worries, though, I figured out a way.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/forensic/Hunt_and_Peck/usb.pcapng.xz"]}], "misc": [{"name": "Perl Poetry", "desc": "Happy Holidays! Santa Claus needs your help to save Christmas. An APT known as \"Krampus\" has infiltrated Santa Claus's poetry site and locked him out completely. However, Santa can't wipe the server since it also stores important files like the flag that he didn't backup. Your job: Get back in and retrieve the flag to save Christmas, hopefully Krampus hasn't already started encrypting files...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/misc/Perl_Poetry/poetry-site.zip"]}], "osint": [{"name": "Gift Hunt", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/osint/Gift_Hunt/GiftHunt.jpg"], "desc": "Santa Claus is making this year's Christmas extra special with a worldwide treasure hunt! All participants have been given a photograph showing the exact location where gifts will be distributed. Everyone who arrives at this location on Christmas Eve will receive a special gift from Santa himself. Can you use your skills to find where Santa is waiting?\n\nSubmit the exact name of this location to claim your gift! For example, if the picture was taken in the lobby of the Willis Tower, you would simply submit Willis Tower.\n"}], "pwn": [{"name": "Santas Christmas Calculator", "desc": "The elves are hard at work building toys for all the children, but they're loosing track of parts and costs. Luckily, Santa is an expert C programmer, so he whipped up a handy little calculator for them, just in time! It can add and subtract, and is optimized to be super-fast! It's a little buggy, but *mostly* works.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/pwn/Santas_Christmas_Calculator/xmascalc.zip"]}, {"name": "Satellite Command", "desc": "We're prototyping a new system for grabbing telemetry from our CubeSat, can you give it a quick test to make sure it's safe to run?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/pwn/Satellite_Command/SatCommand.zip"]}], "rev": [{"name": "Opermutated", "desc": "There's a lot of ways to do anything in assembly :)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/rev/Opermutated/opermutated"]}, {"name": "Steal The Xmas", "desc": "Alicia is looking for someone to help her collect presents! She is in possession of a flag and doesn't mind trading it for the presents so everybody wins!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/rev/Steal_The_Xmas/StealTheXmas.zip"]}], "web": [{"name": "Gigs", "desc": "Our elves are worried about a recent CVE that was discovered in Gogs, we updated our Gogs instance to the latest version but it seems like something is still off.\n\nCan you find a way to exploit it and get the flag?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MetaCTF/2025/web/Gigs/gigs.zip"]}]}