{"crypto": [{"name": "Intro Retour aux sources", "desc": "FR : Je crois que j'ai oublié quelque chose de fondamental...\n\nEN : I think I forgot something fundamental...\n\nAuthor : Ap4sh\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/crypto/Intro_Retour_aux_sources/retourauxsources.rar"]}, {"name": "LetMeFeal", "desc": "Niveau / Level : Difficile / Hard\n\nDescription: Can you FEAL me ?\n\nAuthor : Vozec\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/crypto/LetMeFeal/sources.zip"]}, {"name": "LetMeHash", "desc": "Niveau / Level : Easy / medium\n\nDescription: Can you find few collisions ?\n\nAuthor: Mister7F et Vozec\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/crypto/LetMeHash/sources.zip"]}, {"name": "PolyCipher", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/crypto/PolyCipher/PolyCipher2000.rar"], "desc": "Niveau / Level : Moyen / Medium\n\nDescription: I'm sure you won't break my Matrix Polynomial cipher !\n\nAuthor: Vozec\n"}], "forensic": [{"name": "Croissanted Part 1", "desc": "FR : Une backdoor semble avoir été déposée sur une machine virtuelle. Des fichiers ont été ajoutés dans le filesystem. Bien que l'utilisateur change régulièrement son mot de passe, les intrusions continuent. Identifiez pourquoi. Une copie de la VM vous a été fournie.\n\nEN: A backdoor seems to have been placed on a virtual machine. Files have been added to the filesystem. Although the user regularly changes their password, the intrusions continue. Identify why. A copy of the VM has been provided to you.\n\nFlag format : MCTF{/full/path/backdoor1:/full/path/backdoor2}\n\nLien de téléchargement / Download link : Google Drive : https://drive.google.com/file/d/1SPxsP1BgIZTkuVe_qIzxgVsNWIgss_vn/view?usp=sharing Mega : https://mega.nz/file/tFoljBKa#nQzbbbOS9VfCc3dJq3idTa7-dgLAHVd3jmr0c4C6KJA\n\nAuthor : klemou\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/forensic/Croissanted_Part_1/password_zip.txt"]}, {"name": "I want my tickets back Etape 1 5", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/forensic/I_want_my_tickets_back_Etape_1_5/Informations.html"], "desc": "FR : Jean a découvert un colis dans sa boîte aux lettres. À l'intérieur, il se trouvait une clé USB et une lettre lui annonçant qu'il avait gagné des billets pour les Jeux Olympiques de Paris 2024. La lettre précisait que les billets étaient sur la clé USB. Intrigué, Jean a inséré la clé dans son ordinateur et a ouvert le fichier, une note d'information au format HTML. Conformément aux instructions, le billet s'est téléchargé automatiquement. Après avoir consulté son billet, Jean s'est rendu compte que tout cela n'était qu'une supercherie et, déçu, il s'est absenté pendant quelques heures. À son retour, Jean a été stupéfait de constater qu'il était désormais incapable d'ouvrir ses fichiers. Tous présentaient désormais l'extension .enc. Trouver la technique MITRE ATT&CK liée à la méthodologie d’attaque associé au fichier HTML. Trouver également le hash SHA256 de l’exécutable malveillant.\n\nTrouver la technique MITRE ATT&CK liée à la méthodologie d’attaque associé au fichier HTML. Trouver également le hash SHA256 de l’exécutable malveillant.\n\nFormat du flag : MCTF{TXXXX.XXX:Hash_fichier_malveillant}\n\nEN : Jean discovered a package in his mailbox. Inside, he found a USB key and a letter announcing that he had won tickets to the 2024 Paris Olympics. The letter specified that the tickets were on the USB key. Intrigued, Jean inserted the key into his computer and opened the file which is an HTML format information note. Following the instructions, the ticket downloaded automatically. After checking his ticket, Jean realized it was all a hoax and, disappointed, he left for a few hours. Upon his return, Jean was stunned to find that he was now unable to open his files. They all now had the .enc extension. Find the MITRE ATT&CK technique associated with the attack methodology related to the HTML file. Also, find the SHA256 hash of the malicious executable.\n\nFind the MITRE ATT&CK technique linked to the attack methodology associated with the HTML file. Also find the SHA256 hash of the malicious executable.\n\nFlag format : MCTF{TXXXX.XXX:Hash_malicious_file}\n\nAuthor : Niceclear & ZarKyo\n"}, {"name": "Mackos", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/forensic/Mackos/Mackos.pcap.xz"], "desc": "FR : La forensique mémoire avec Volatility2 est ma grande passion, et ce depuis sa sortie en août 2006 ! Récemment, j'ai même participé à un concours d'analyse mémoire sur un chat IRC assez rétro. Même si j'ai eu quelques difficultés à trouver le bon profil à utiliser, un utilisateur nommé \"jonas_kahnwald44\" a pu m'en fournir un fonctionnel. Maintenant que j'en parle, j'ai remarqué un message inattendu lors de l'exécution de Volatility2 avec ce profil. Pourriez-vous jeter un oeil à cette capture réseau réalisée sur mon serveur d'analyse ?\n\nEN : Memory forensics with Volatility2 has been my great passion since its release in August 2006! Recently, I even participated in a memory analysis contest on a rather retro IRC chat. Although I had some difficulties finding the right profile to use, a user named \"jonas_kahnwald44\" was able to provide me with a functional one. Now that I mention it, I noticed an unexpected message while running Volatility2 with this profile. Could you take a look at this network capture made on my analysis server?\n\nAuthor: Abyss Watcher\n"}, {"name": "SignMyRar5", "desc": "Difficulté : Easy\n\nFR : On a malheureusement supprimé l'archive contenant les patchs de sécurité, un voyageur vous a laissé des messages.\n\nEN : Unfortunately we deleted archive containing all security patches, a traveller left you messages.\n\n    Lien téléchargement / Download link : Google drive : https://drive.google.com/file/d/1FbsiFXNGXtS_c0bIyAioOIAD5RdODd6v/view?usp=sharing Mega : https://mega.nz/file/9dZnSCzB#cJR-BHb-zncq5JiSpwZ4bLykTqDeR7S3ukDjbkLRB98\n\n    Archive password : look the .txt file\n\nAuthor: Chic0s\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/forensic/SignMyRar5/archive_passcode.txt"]}], "misc": [{"name": "Script Encoder", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/misc/Script_Encoder/FLAG_ENCODED.txt"], "desc": "FR : Un mistérieux logiciel a encodé mon fichier..\n\nEN : A misterious software encoded my file...\n\nAuthor : Stone\n"}], "net": [{"name": "Intro slow and low", "desc": "FR: exfiltration en eau douce...\n\nEN : exflitration in fresh water...\n\nFORMAT : MCTF{flag{xxxx}}\n\nAuthor : Kuroashi\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/net/Intro_slow_and_low/challenge_ctf.pcap.xz"]}, {"name": "Why encoding", "desc": "FR : Trouver le flag encodé dans ce paquet réseau.\n\nEN : Find the encoded flag in the newtork trame.\n\nFlag format : MCTF{}\n\nAuthor: Stone\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/net/Why_encoding/packet_why_encoding.pcap.xz"]}, {"name": "leak http", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/net/leak_http/CTF_807.pcapng.xz"], "desc": "FR : Les voyageurs ont essayés de nous envoyer un fichier. On a pu capturer la trame !\n\nEN : The travelers tried to send us a file. We achieved to capture a frame !\n\nFORMAT : MCTF{flag{xxxx}}\n\nAuthor : 807ct\n"}], "pwn": [{"name": "64kallocator", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/pwn/64kallocator/Player_Input.zip"], "desc": "FR : Vous venez de déménager et en avez profité pour trier vos vieilles affaires. Dans un carton poussiéreux, vous redécouvrez votre Amstrad CPC 464, que vous aviez acheté dès sa sortie il y a quelques années.\n\nAvec lui, au milieu de la poussière, se trouve la cassette d'un de vos amis. Sa tranche indique \"Modern memory manager for 64k computer\". En hommage aux soirées de programmation passées sur ce CPC 464 avec votre ami, vous décidez de jeter un oeil à ce code et d'en évaluer la sécurité...\n\nEN: You've just moved and took the opportunity to sort through your old stuff. In a dusty box, you rediscover your Amstrad CPC 464, which you bought when it was released a few years ago.\n\nInside, among the dust, is a cassette from one of your friends. Its label reads \"Modern memory manager for 64k computer.\" In homage to the programming nights spent on this CPC 464 with your friend, you decide to take a look at this code and evaluate its security...\n\nAuthor: Noiche\n"}, {"name": "Budget simulator", "desc": "FR : J'ai fait un petit programme pour m'aider à gérer mon budget. Une faille en échange d'un flag, ça t'intéresse ? Note : L'ASLR n'est pas activé.\n\nEN :I made a small program to help me manage my budget. Interested in finding a vulnerability in exchange for a flag? Note: ASLR is not enabled.\n\nAuthor : 25kGoldn\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/pwn/Budget_simulator/budget_simulator.zip"]}, {"name": "Mad Admin", "desc": "FR : A votre retour de vacances, vous vous rendez compte que vous ne pouvez plus rien faire sur votre poste distant. Après un passage à la cafèt', un collègue vous apprend que l'admin-sys vous déteste et a pourri votre shell. Montrer lui que vous êtes plus malin et récupérez le fichier /flag/flag.\n\nCommande de compilation: gcc -fPIC -shared -o mad_lib.so mad_lib.c -ldl\n\nEN : When you return from vacation, you realize that you can't do anything on your remote workstation anymore. After a coffee break, a colleague informs you that the sysadmin hates you and has messed up your shell.\n\nShow them that you're smarter and recover the file /flag/flag.\n\nCompilation command: gcc -fPIC -shared -o mad_lib.so mad_lib.c -ldl Author : 25kgoldn\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/pwn/Mad_Admin/mad_admin_sources.zip"]}, {"name": "Snake", "desc": "FR Des informations classifiées secret défense ont été cachées, il vous faudra obtenir plus de 100 \n\nEN : Top secret informations has been hidden, you need to get 100,000 in order to get the secret code !\n\nFlag format : MCTF{}\n\nAuthor : Kuorashi\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/pwn/Snake/snake"]}, {"name": "heapdivers", "desc": "FR : Les Helldivers sont prêts à mourir pour repousser les envahisseurs Terminid et Automaton, pour répandre la démocratie et préserver la sérénité de la Super-Terre - tel est leur devoir. Lors d'une mission sur la planète Hellmire, vous devrez choisir vos stratagèmes avec soin si vous souhaitez mener à bien cette mission et planter le drapeau qui marquera la conquête de cette planète et la fin de l'invasion Terminid. Bonne chance Helldivers ! Pour la démocratie !\n\nEN : The helldivers are ready to die to repel the Terminid and Automaton invaders, to spread democracy and preserve the serenity of the super-Earth - such is their duty. On a mission to the planet Hellmire, you'll have to choose your stratagems carefully if you want to successfully complete this mission and plant the flag that will mark the conquest of this planet and the end of the Terminid invasion. Good luck helldivers! For democracy !\n\nAuthor : TounSec\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/pwn/heapdivers/heapdivers"]}], "rev": [{"name": "Deck Decoder", "desc": "FR : Toutes vos archives, soigneusement stockées et empilées sur l'étagère du salon depuis plus de 24 ans, ont été malheureusement dispersées sur le sol. En récupérant et en essayant de trier tant bien que mal cet agglomérat d'objets divers, vous réalisez que la tâche est bien plus ardue que prévu. Il va falloir tout reprendre !\n\nEN: All your archives, carefully stored and stacked on the living room shelf for over 24 years, have unfortunately been scattered on the floor. As you pick up and try to sort out this jumble of various items, you realize that the task is much more difficult than expected. You'll have to start all over again!\n\nFlag format : MCTF{flag}\n\nAuthor: Prince 2 Lu\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/rev/Deck_Decoder/deck_decoder"]}, {"name": "Major Order", "desc": "EN : The Automatons have penetrated the orbital defenses set up by S.E.A.F. and completely destroyed our guidance systems. In order to carry out an in-depth strike to paralyze the supply lines, we need to find a way to get the old interplanetary missile control consoles working again. Problem: we've lost the activation codes.\n\nAuthor : deadc0de\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/rev/Major_Order/major_order_30510f7cf01fde3ac68ee8401f8a50635c93f776613152651fd616428b773f74"]}, {"name": "WiiWii en avant les amis", "desc": "FR : Un agent de notre organisation s’est vu transmettre un étrange fichier, qu’il doit utiliser sur son ancienne console de jeux. Aidez-le à en déchiffrer le secret.\n\nEN : An agent of our organization was given a strange file, he has to use it on his old game console. Help him decipher the secret.\n\nFlag format : MF{xxxxxxxxx} File : application.dol\n\nAuthor : UVision\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/rev/WiiWii_en_avant_les_amis/application.dol"]}], "steg": [{"name": "Intro Hackin9", "desc": "FR : Tr0p b1en un l1vr3 de H4CK3R !\n\nEN : N1c3 ! A H4CK3R b00k !\n\nAuthor : Kuorashi\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/steg/Intro_Hackin9/hackin9.jpg"]}, {"name": "Rapport de Police", "desc": "FR : Voici un rapport de police trouvé dans des archives, il contient un mystérieux message.\n\nEN : Here is a police report found in archives, it contains a mysterious message.\n\n('No osint')\n\nFlag format : MCTF{flag}\n\nAuthor : KØDΛ\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/steg/Rapport_de_Police/Report_Police.pdf"]}, {"name": "Silent Hill Part 2", "desc": "FR : Chhuuuuuut !\n\nEN : Shhhh ! Author : Kuorashi\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/steg/Silent_Hill_Part_2/Silent_hill_2.png"]}, {"name": "s0uS l3s r4d4r", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/steg/s0uS_l3s_r4d4r/Gorille_wallpaper.jpg"], "desc": "FR : Où est ce que j’ai rangé mon code ? Quelques compétences en Python sont requises pour atteindre son but.\n\nEN : Where did I store my code ? Some Python skills are required to achieve his goal. flag format : MCTF{flag{xxxxxxxxx}}\n\nAuthor : Kuorashi\n"}], "web": [{"name": "CacheCache", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/MidnightFlag/2024/web/CacheCache/CacheCache.zip"], "desc": "FR : J'ai créé mon premier site web en mettant en œuvre un peu de mise en cache, j'espère que c'est génial et non vulnérable !\n\nEN : I've made my first website implementing some cache, hope it's great and not vulnerable !\n\nAuthor: Worty\n"}]}