{"crypto": [{"name": "Break My Stream", "desc": "CrypTopia is testing their next gen encryption algorithm. We believe that the way they implemented it may have a flaw...\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/Break_My_Stream/main.py"]}, {"name": "CrypTopiaShell", "desc": "We just found a breach in CrypTopia servers, and we have a shell access! However, they are using a custom shell to run commands in an authenticated way. We managed to exfiltrate the source code and a sample file, can you find a way to execute commands??\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/CrypTopiaShell/cryptopiashell.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/CrypTopiaShell/example.ctpsig"]}, {"name": "Free n00psy", "desc": "I found data left by n00psy who was analysing a security lock before getting captured.\n\nNoopsy might have been able to glitch its RNG. This document was also laying around.\n\nCan you help me recover the secret to clone a security badge and open the secure door to free n00psy.\n\nChallenge designed by Qualcomm\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/Free_n00psy/Secret.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/Free_n00psy/SignatureLog.txt"]}, {"name": "Key Exchange", "desc": "We have located a secret endpoint of CrypTopia. If we manage to establish a communication with it, we should be able to get sensitive information!\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/Key_Exchange/main.py"]}, {"name": "Meago", "desc": "In Meago precision is key. Sharpen your calculations, find innovative ways to solve the oracle's riddle.\n\nAuthor : factoreal\n\nChallenge designed by ASIS team\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/Meago/meago.sage"]}, {"name": "The Emperor", "desc": "Ahoye! Here are the crypto newbies! Today, we are learning the basics of cryptography! Here is an encrypted message for you, try to decipher it. Learning this will help you on the day you will face CrypTopia.\n\nNote: The flag format is B4BY{DECODEDMESSAGE}.\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/The_Emperor/challenge.txt"]}, {"name": "n0psichu", "desc": "In N0PSichu, polish a cryptosystem to reveal its hidden flaws and make it shine, or break.\n\nAuthor: factoreal\n\nChallenge designed by ASIS team\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/crypto/n0psichu/n0psichu.py"]}], "forensic": [{"name": "Moshy Moshy", "desc": "We were comfortably watching our favorite cartoon in an open air cinema, when suddenly the video quality dropped. It was all moshy moshed :'( Can you try to fix the video? We really want to see this cartoon :)\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/forensic/Moshy_Moshy/challenge.zip"]}, {"name": "Unknown File", "desc": "Hello young trainees! Today, we are studying digital forensics! This may be useful if one day you have to face PwnTopia...\n\nHere is a file, you have to find a way to read its content. Good luck!\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/forensic/Unknown_File/challenge"]}], "misc": [{"name": "G Bee S", "desc": "Miscellaneous\n\nThere is a bee living in N0PStopia, named Valentine. She loves waterlilies, and lots of them are located around her beehive. However, she needs some help to find a good way to visit all of them while tralling the shortest distance, can you help her? She does not need the best path, but at least one that is good enough.\n\nNote: Each line is the coordinates of a waterlily. The beehive is located in (0,0), and the path has to start from there and end there. Each flower has to be visited one time, but not more. When submitting, you have to send the order of flowers to be visited. For instance, if your path is to visit the 2nd flower, then the 3rd, then the 1st, you will send 0 2 3 1 0, where 0 represents the beehive. In order to be valid, your path has to have a total length of less than 1400.\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/misc/G_Bee_S/flowers.txt"]}, {"name": "Maze Cup", "desc": "Miscellaneous\n\nLater on the hike, n00psy takes you to a place he really likes: a maze!\n\nAuthor: Jusdepommes\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/misc/Maze_Cup/maze.png"]}, {"name": "Musical Encounter", "desc": "Miscellaneous\n\nn00psy takes you to a nature walk in N0PStopia. On your way, you meet a group of dancing skeletons! What an amazing adventure to see and hear. I wonder what they talk about...\n\nAuthor: Jusdepommes\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/misc/Musical_Encounter/dancing_skeletons.mp4.xz"]}, {"name": "Selfie Memory", "desc": "Miscellaneous\n\nAt the end of this lovely moment, n00psy gives you a picture of him. \"I will never forget this moment, thank you for coming with me!\", he says. \"Also, sorry if the quality of this picture is a bit poor on the edges, this is an old picture that my friend Joseph took in 1807.\"\n\nAuthors: volca_ky & Jusdepommes\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/misc/Selfie_Memory/noopsy_selfie.png"]}], "osint": [{"name": "La foire nest pas sur le pont", "desc": "OSINT\n\nIt seems that this place is more agitated than it appears. Usually empty, we have recently seen mischievous silhouettes roaming around it, seeming to meet here, for some unknown purpose...\n\nThe flag will be the Overpass Turbo node ID corresponding to the bridge.\n\nFlag format : N0PS{Overpass_Turbo_Node _Type_Id}\n\nFlag Example : N0PS{Way_133333337}\n\nAuthor: Baptiste Martinez\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/osint/La_foire_nest_pas_sur_le_pont/bridge.png"]}, {"name": "Tak Tak", "desc": "OSINT\n\nAloha querid@s! ^^\n\nIt's finally time to dive into the fascinating world of OSINT, that magical word that excites digital detectives and gives regular folks the chills. Today, we’ll be starting with the baaasic stuff: just a bit of reverse image searching to warm up!\n\nNow, story time: Alice has stumbled into N0PStopia and found herself in a surreal place, lined entirely with chairs. 🪑\n\nWill you be able to figure out where this tunnel is, when it opened, and, just for fun, how many chairs are in there? It seemed like it stretches into infinity.. x)\n\nFlag format : B4BY{Place-Location_Opening-Date_chairs-number}\n\nExample : B4BY{Lectures-Tower-N0PSTopia_June-1st-2025_505}\n\nNote : Make sure all the parts of your flag (even country names) are in English.\n\nAuthor : Sto\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/osint/Tak_Tak/pic.jpg"]}], "pwn": [{"name": "A515", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/A515/BLUE.png"], "desc": "We just received this sign from Foreniego, one of the wanderers of Pwntopia. He's known for drifting between Topias, never settling down, and always leaving behind a few secrets. We've been told there's something hidden in the sign he sent us, maybe it holds a clue that will help in the steps ahead. Can you uncover the truth he's hiding?\n\nAuthor: y3noor, Sto\n"}, {"name": "Invaders", "desc": "We've found an old-school space-invaders game on a PwnTopia server, but it seems to be unusually large in size. Maybe something is hidden inside of it...\n\nNote: This is a Windows challenge, so having a Windows VM might be helpful. Also, the only assets related to this challenge are the ones below. Nothing Else.\n\nSecurity Warning: Windows SmartScreen may flag the executable as unrecognized or potentially unsafe. This is not due to malware, but because the binary is not digitally signed by a trusted certificate authority. If you're unsure run it inside a virtual machine.\n\nAuthor: CaptWake\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/Invaders/invaders.exe.xz"]}, {"name": "LooneyDroid", "desc": "As MJ, Jojo has been captured by the looney! To escape, he must win the game of the best cartoon...\n\nAuthor : Antonio Ruggia\n\nChallenge designed by ThreatNemesis\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/LooneyDroid/rev2.apk"]}, {"name": "Missing Piece", "desc": "Forensics Reverse Engineering\n\nWe managed to steal this USB stick from a member of PwnTopia, but there was nothing useful on it. Can you see if you can find anything ?\n\nAuthors: algorab, CaptWake\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/Missing_Piece/disk.zip"]}, {"name": "Under Attack", "desc": "Ladybug Command System FULLY OPERATIONAL.\n\nAuthor : y3noor\n\nUse the Under Attack Instance for this challenge.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/Under_Attack/ladybug_app", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/Under_Attack/libc.so.6"]}, {"name": "VALidTOR", "desc": "Jojo has finally triangulated n00psy’s SOS signal... and it’s emanating from a very cranky pink flip-phone running an equally cranky Android app.\n\nInside the handset lurks VALidATOR, a gatekeeper who refuses to let anyone decipher Noopsy’s voicemail unless you whisper the one valid integer into its single, lonely text box. Legend says the number untangles a knot of modular riddles that the three evil Lords have etched.\n\nAuthor : packmad\n\nChallenge designed by ThreatNemesis\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/VALidTOR/VALidATOR.apk"]}, {"name": "pwnfield", "desc": "We discovered that PwnTopia use their secret mine to collect shellcodium, a very rare and powerful resource! We need it too, to be able to defend N0PStopia. However, PwnTopia has put some mines in the way to the shellcodium, but we are lucky PwnTopia left their most powerful tool, a shell , sh on their way out! Can this be a secret message? Can you manage to avoid the mines and use their tool against them?\n\nAuthor: Xen0s\n\nUse the pwnfield Instance for this challenge.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/pwnfield/chall.zip"]}, {"name": "pwntopiashl", "desc": "N0PStopia has been attacked by PwnTopia! They installed a stealthy binary on one of our servers, but we did not understand what it does! Can you help? We saw some weird ICMP traffic during the attack, you can find attached a capture file.\n\nAuthor: algorab, CaptWake\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/pwntopiashl/capture.pcap.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/pwn/pwntopiashl/pwntopiashl"]}], "rev": [{"name": "Read the Bytes", "desc": "Look who's there! New students! Fine, this time we will focus on reverse engineering. This could help you against PwnTopia one day!\n\nI give you now a Python program and its output. Try to understand how it works!\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/rev/Read_the_Bytes/challenge.py"]}], "web": [{"name": "3v3ntl0g", "desc": "We were able to infiltrate a WebTopia server! However, our hacking skills are not very good... We were only able to read from the keyboard input driver. Here is the data we collected, can you have a look? It seems that is has been shuffled a bit though... Also, WebTopia freaks are frenchies, and they use an AZERTY keyboard, just in case you need that information...\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/web/3v3ntl0g/shuffled.bin"]}, {"name": "Big Phone", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/web/Big_Phone/CTF_phone.txt"], "desc": "Miscellaneous\n\nA few minutes ago, a message from the evil lord of WebTopia to the other lords has been intercepted. He does not send a lot of them. Thus it must be important! But, what could it mean?\n\nAuthor: Jusdepommes\n"}, {"name": "XSS Lab", "desc": "We got an access to a training resource from WebTopia, where they practise XSS filter bypassing. Enjoy it!\n\nNote: If your payload does not seem to work at first, please use RequestBin to check before contacting the support.\n\nAuthor: algorab\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/N0PSctf/2025/web/XSS_Lab/xsslab.zip"]}]}