{"rev": [{"name": "Malwalker", "desc": "We want to make the attackers believe that the machine of the CEO was infected. The flag is the data that would be transmitted on the first request to the command and control server. His machine is up to date and you can find all the information about it in systeminfo.txt Flag : NORZH{<the_data>}\n\nDISCLAIMER This challenge contains a malware. Don't try to execute or debug any binaries on your own machine. The ZIP archive is protected with the password \"infected\". ATTENTION Ce challenge contient un malware. Ne tentez pas d'exécuter ou débuguer les binaires sur votre propre machine. L'archive ZIP est protégée par le mot de passe \"infected\".\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Norzh/2021/rev/Malwalker/infected.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Norzh/2021/rev/Malwalker/systeminfo.txt"]}, {"name": "SUPPLY ME", "desc": "The CTF airport is asking you to participate in a threat hunting campaign.\n\nPlease check for possible traces of compromise and search all the way back to find the origin of the attack (if there was one of course ;)) Here is a copy of the disk of one of our servers, it's up to you to analyze it. In case you need it the admin credentials are norzh:norzhCTF_2k21. But we suspect that you probably won't need them.\n\nThe flag is the concatenation of the name of the service that was exploited + the payload that triggers an exploit. Flag format NORZH{<service name>:<payload>}\n\n    PS: sorry for you if you have a crappy internet connection, the file is 5GB...\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Norzh/2021/rev/SUPPLY_ME/challenge_supply_me_NORZH_CTF.qcow2.torrent"]}, {"name": "Secure Auth v0", "desc": "One of NorzhNuclea's developers joined the team last quarter, specialized in authentication systems he found one he developed a few years ago with a innovative obfuscation method. Find the correct password to validate the checks.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Norzh/2021/rev/Secure_Auth_v0/chall.xz"]}]}