{"blockchain": [{"name": "Buy My Coin", "desc": "Author: xseven\n\nThe Nullium Protocol has just launched its algorithmic token, $NULL. We believe we have solved the greatest problem in decentralized finance: The Liquidity Trilemma. Nullium isn't just a token; it is a self-stabilizing, mathematically perfect store of value designed to outlast the volatility of the crypto markets. In a world of chaos, Nullium offers order. Our proprietary Elastic Reserve Bonding Curve ensures that every single $NULL token in existence is backed by a calculated fraction of Ethereum. There are no admin keys, no rug pulls, and no human error. Just pure, immutable code governing the future of money.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/blockchain/Buy_My_Coin/buy-my-coin.zip"]}, {"name": "We Go Gambling", "desc": "Author: xseven\n\nWelcome to the Lucky Crypto Casino! The premier destination for high-stakes gambling on the blockchain. Step right up, ladies and gentlemen, to the only place in the metaverse where fortune favors the bold!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/blockchain/We_Go_Gambling/we-go-gambling.zip"]}, {"name": "We Go Gambling Revenge", "desc": "Author: xseven\n\nWelcome to the Lucky Crypto Casino - Revenge!!!!! The premier destination for high-stakes gambling on the blockchain. Step right up, ladies and gentlemen, to the only place in the metaverse where fortune favors the bold!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/blockchain/We_Go_Gambling_Revenge/we-go-gambling-revenge.zip"]}], "crypto": [{"name": "Classically", "desc": "crypto easy\nAuthor: infernosalex\n\n\"Do you think you can solve this classically?\"\n\nFlag format: ctf{}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/crypto/Classically/classically.zip"]}, {"name": "Witching Hour", "desc": "Author: xseven\n\nLong before prime numbers were tamed by modern cryptographers, the geomancers of the Old Continent whispered of a curve that could bind infinity to a single point. Forged from immense prime-born fractions and marked by coordinates chosen from the deepest reaches of number-space, this ancient shape reveals its secret only to those who can reconstruct the hidden parameter that defines it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/crypto/Witching_Hour/witching_hour.zip"]}, {"name": "double it and give it to the next person", "desc": "crypto medium\nAuthor: infernosalex\n\ndubleaza si da mai departe meme\n\nIn romanian folklore, there is a tradition called \"dubleza si da mai departe\" (double it and give it to the next person). This challenge is inspired by that tradition, but with a cryptographic twist.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/crypto/double_it_and_give_it_to_the_next_person/double_it_and_give_it_to_the_next_person.zip"]}, {"name": "gizsea", "desc": "crypto medium\nAuthor: infernosalex\n\nGiza Pyramid\n\nThe Great Pyramid of Giza[a] is the largest Egyptian pyramid. It served as the tomb of pharaoh Khufu (\"Cheops\"), who ruled during the Fourth Dynasty of the Old Kingdom. OK, now stop with History lessons, let's get to the challenge. Gizsea is a new custom encryption algorithm that I've developed. CShark3008 told me it looks indestructible, but I'm sure you can break it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/crypto/gizsea/gizsea.zip"]}, {"name": "infernoPAD", "desc": "crypto hard\nAuthor: infernosalex\n\nInfernoPAD is to help you, not to help others. GO and try to find the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/crypto/infernoPAD/infernoPAD.zip"]}, {"name": "rusty dusty", "desc": "crypto hard reverse\nAuthor: infernosalex\n\nmath_rusty\n\nwhen you are rusty and you don't know how to use your skills, dust yourself off and try again.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/crypto/rusty_dusty/rusty_dusty_2.zip"]}], "forensic": [{"name": "iuesbitaipsi", "desc": "forensics easy\nAuthor: mrbgd\n\nayay uat is iuor taip for iuesbi?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/forensic/iuesbitaipsi/iuesbitaipsi.zip"]}], "misc": [{"name": "Hypertext TCP Control Pots Cyber Protocol", "desc": "Author: cshark3008\n\nCatched a coffee pot? A teapot? A kettle? A hot water dispenser? We have caught a discussion between a few friends about their favorite drinks. They are using a custom protocol to brew their drinks. Can you find out how to brew their drinks?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/misc/Hypertext_TCP_Control_Pots_Cyber_Protocol/hijacking-tcp-cyber-programming-control-pots.zip"]}, {"name": "RATatoille", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/misc/RATatoille/RATatoille.zip"], "desc": "forensics threat hunting malware analysis\nAuthor: mrbgd\n\n\"In the dark corners of the internet, a new \"Chef\" is brewing a malicious recipe. This isn't your grandmothers soup; it is a sophisticated RAT hidden beneath layers of obfuscation and encryption. Just as Remy hides under Linguini's hat to control him, this malware hides its true intent behind a \"chef's hat\" of PowerShell scripts and batch files.\n\nYour task is to play the role of Anton Ego. You must peel back the layers of this digital onion, taste the code, and identify the secret ingredients before the kitchen burns down. Can you find the recipe before the RAT takes control? Bon appétit!\"\n\nDANGER: LIVE MALWARE The file provided in this challenge is a live, functional malware sample. Safety Instructions: DO NOT run, double-click, or execute this file on your personal computer, host operating system, or corporate network. ALWAYS analyze this sample inside an isolated Virtual Machine (VM) or a dedicated malware sandbox. DISABLE all network adapters in your analysis environment to prevent the malware from communicating with its Command & Control (C2) server. TAKE SNAPSHOTS of your VM before beginning analysis so you can revert any changes or infections.\n\nDISCLAIMER: By downloading or accessing this challenge, you acknowledge that you are handling dangerous software at your own risk. The creator and platform hosting this challenge are not responsible for any damage, data loss, infection, or legal consequences resulting from the execution, misuse, or accidental spread of this malware. You are solely responsible for ensuring the safety and security of your own environment.\n\nZip Password: malware\n"}, {"name": "Reservation", "desc": "misc easy\nAuthor: Stefan\n\nI wanted to take my inexistent girlfriend to this fancy restaurant called Windows, but they keep asking me for a key PROMPT. I don't know what to do, can you help me?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/misc/Reservation/reservation.py"]}, {"name": "Slim Shady", "desc": "Author: xrp\n\nMay I have your attention please?\n\nTHIS IS A REAL MALWARE!!! PLEASE BE CAUTIOS WHEN YOU HANDLE IT!!!\n"}, {"name": "abcdef", "desc": "Author: xseven\n\nThe Grand Arcanist has severed the ley lines of syntax. A silence spell hangs heavy over the terminal, choking out all complex commands. The only magic that permeates the barrier is the Hex, the alphabet of the machine spirit. The interpreter will hear nothing but the six sacred runes: a, b, c, d, e, f. Can you conjure a flag from the silence?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/misc/abcdef/abcdef.zip"]}], "osint": [{"name": "geo osint", "desc": "osint medium\nAuthor: mrbgd\n\nI wanna know where i am! Agent perry hired you to find all the locations from this quiz. Could u help him and become Perry the Platypus?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/osint/geo_osint/geoosint.zip"]}], "pwn": [{"name": "distrustful", "desc": "Author: tudor\n\ni don't trust glibc printf security so i made my own, but less secure\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/pwn/distrustful/distrustful.zip"]}, {"name": "reloc8", "desc": "pwn hard v8\nAuthor: tomadimitrie\n\nI usually find myself moving around elements in an array, so I thought I should make a built-in function for that.\n\nOriginal commit: f91f6775b20929d862d7e9c508139466e2102d96\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/pwn/reloc8/reloc8.zip"]}, {"name": "sketchy", "desc": "pwn easy\nAuthor: tudor\n\nsketchy stuff going on here i'm scared\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/pwn/sketchy/sketchy.zip"]}], "rev": [{"name": "Big Lez", "desc": "reverse hard\nAuthor: xrp\n\nYa fucken' druggo\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/rev/Big_Lez/bigLez.zip"]}, {"name": "Clutter", "desc": "mobile android flutter\nAuthor: cshark3008\n\nA Flutter app hides its “premium unlock key” using secure storage, obfuscation, and a native channels that decrypts a flag. Reverse the app and recover the real flag. No guessing.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/rev/Clutter/clutter.zip"]}, {"name": "Netfilter Nightmare", "desc": "reverse medium\nAuthor: vektor\n\nI ran a program some friend sent me and all my traffic is now messed up! All this while I was looking at a great steal on the web and can't remember the website(s) I found it on. Help!\n\nNote: By default no traffic passes through the given program.\n\nuse sudo iptables -I OUTPUT -j NFQUEUE --queue-num 0 --queue-bypass to send traffic to it.\nuse sudo iptables -D OUTPUT -j NFQUEUE --queue-num 0 --queue-bypass to delete the previous rule.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/rev/Netfilter_Nightmare/netfilter-nightmare.zip"]}, {"name": "confusion", "desc": "reverse hard kernel windows\nAuthor: tomadimitrie\n\nI installed the driver for my printer, but my printer is still not working. However, some apps have started behaving weirdly, like the one I attached. It only works when the driver is running and is asking me for a… flag? What does that mean?\n\nNote 1: You need a VM with testsigning enabled. Do NOT do that on your host machine. Steps:\n\ndisable Secure Boot\nbcdedit.exe /set testsigning on\nbcdedit.exe /set debug on\nbcdedit.exe /set loadoptions DDISABLE_INTEGRITY_CHECKS\nreboot\nNote 2: Install the driver with devcon.exe install ConfusionKM.inf root\\confusionkm. You can get devcon by downloading the WDK and copying it from C:\\Program Files (x86)\\Windows Kits\\10\\Tools\\<version>\\x64\\devcon.exe. The WDK is safe to install on your host machine and devcon can be safely copied to the VM with no other dependencies required.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/rev/confusion/confusion.zip"]}, {"name": "rustricks", "desc": "Author: vektor8\n\nThis weird program encrypted files on my gaming rig. Please help.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/rev/rustricks/rustricks.zip"]}, {"name": "specifier", "desc": "reverse medium\nAuthor: tomadimitrie\n\nI tried to register my custom printf handlers, but the functions are soooo outdated...\n\nI found this new C++ library which makes it easier!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/rev/specifier/specifier.zip"]}, {"name": "wordleOS", "desc": "reverse hard os\nAuthor: tomadimitrie\n\nThey say you can build an OS for everything, so I built one that can play Wordle.\n\nWell, kinda, I am a bit colorblind, so I couldn't put the colored letters. They are all white (I think). But it should tell you when you get the word correct anyway.\n\nNote: Run with qemu-system-x86_64 -drive format=raw,file=wordle_os.bin\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/rev/wordleOS/wordle_os.zip"]}], "web": [{"name": "Archivist s Whisper", "desc": "web 0day\nAuthor: xseven\n\nWhispers hide in plain sight—a self-hosted vault born of TypeScript’s shifting shadows and Go’s unyielding steel. Every thought you entrust it is sealed behind your own cryptographic wards, its open-source heart daring you to probe its undocumented depths. Whispers speak of a final riddle, woven from dynamic reflections and static sentinels, that grants dominion over the archive’s hidden core. Will you dare light the way?\n\nDo note: the individual containers do not have external network access.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/Archivist_s_Whisper/archivists_whisper.zip"]}, {"name": "Archivist s Whisper Revenge", "desc": "Whispers? Amateurish shadows of thought, scattered without discipline. This is no playground for half-measures. The Archivist offers a self-hosted vault tempered in Go’s unyielding steel and tempered with TypeScript’s cunning, but only the clever survive. Your musings are locked behind cryptography you barely comprehend, and its open-source heart mocks every timid probe. Previous attempts? Laughable. The final riddle, woven from dynamic reflections and static sentinels awaits a mind willing to rise above mediocrity. Will you, at last, prove capable?\n\nDo note: the individual containers do not have external network access.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/Archivist_s_Whisper_Revenge/archivists_whisper_revenge.zip"]}, {"name": "Codename Neigh", "desc": "web beginner very easy\nAuthor: xseven\n\nBeyond the known chronometers lies the Temporal Nexus. Within its databanks, a desperate message echoes: a time traveler's plea for his lost companion, Neigh, vanished into the mists of history. Explore restricted archives, consult paradox guides, and perhaps, lend your eyes to a search that spans epochs.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/Codename_Neigh/codename_neigh.zip"]}, {"name": "Codename Neigh 2", "desc": "web easy\nAuthor: xseven\n\nBeyond the familiar chronometers lies the Temporal Nexus, where a desperate plea for the lost Neigh echoes through history. If the last trial felt light, prepare for forbidden archives, paradoxes, and enigmas that span epochs.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/Codename_Neigh_2/codename_neigh2.zip"]}, {"name": "Next Jason", "desc": "web easy\nAuthor: Stefan\n\nAt least JSON has only one pronunciation, unlike GIF. JWT too, I guess?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/Next_Jason/next_jason.zip"]}, {"name": "The Missing Letters", "desc": "Author: xseven\n\nIn the hollowed servers of a forgotten subnet lies a vault sealed behind layers of obsidian code. Its gates boast impenetrable walls—JWT-guarded authentication, militarized headers, and a sentinel that watches for intruders with the cold precision of machine logic.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/The_Missing_Letters/the-missing-letters.zip"]}, {"name": "ftp db", "desc": "web medium\nAuthor: tomadimitrie\n\nDatabases are overrated, I use FTP to store my stuff.\n\nNote: Use Firefox to test the exploit; it isn't anything Firefox specific, but Chrome might give you a hard time\n\nNote: Any (recent) Next.js CVE is not intended for this challenge. Even if it works locally, the remote server is patched.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/ftp_db/ftp-db.zip"]}, {"name": "seo blog", "desc": "web hard\ntomadimitrie\n\nPffff, developers nowadays don't know how to properly optimize SEO.\n\nBut don't worry, this blog will make it really easy to do so!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Null/2025/web/seo_blog/seo-blog.zip"]}]}