{"crypto": [{"name": "MPKC", "desc": "\n\nNow that you’re already in the back area, you decide to explore a little bit more. The database room was at the end of the hallway, but along the way you saw a couple of other rooms that piqued your interest. On your way back, you notice a scent you didn’t smell initially. It’s some fresh seasoning that you can’t place. Thyme?\n\nThe room turns out to be the librarian’s lounge. You step around the corner only to jump back in fright. There’s someone lying on the couch! You try to calm your racing heart as you process the fact that they’re sound asleep. Drool dribbles down the front of their shirt. As their chest rises, the room vibrates with a massive snore.\n\nYour eyes move past the couch to the back of the room. A small chest sits on the counter, and you can tell the smell is coming from there. Your stomach rumbles as you set to work getting it open.\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/MPKC/gen.sage", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/MPKC/output"]}, {"name": "dyrpto", "desc": "\n\nYou decide to return to the Carnival to see if you can find the fortune teller again. As you’re searching, you mull over the fortune teller's words, “swollen tongue… jumbled vision… burning rubber… a bark… waves passing…”, and you trip over a dog beneath your feet. It’s a black dog, pointy ears, a little scruffy. A scottish terrier! How cute.\n\nThe dog looks at you and you look back at the dog. It’s small and its tail is wagging. It seems not at all out of place among the hustle and bustle of Carnival. You squat down and reach your hand out.\n\n“Here doggy. Nice doggy.”\n\nThe dog comes forward and sniffs your hand, allowing you to give him a scratch on the head. As you continue to scratch, you feel something remarkably smooth. You wonder what it could be. You bend over to take a closer look and the dog senses your interest, tensing. Just as you’re about to pull a flag out of its collar, it pulls free of your grip and darts away.\n\n“Hey! Come back, doggy.”\n\nYou begin to chase after it, but lose the dog in the crowd. To your surprise, you discover a sheet of paper left in your hand. You see that most of it is torn off, but it looks like the beginning of something useful. Looking around again, you spot the scotty dog and dash after it.\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/dyrpto/generate_problem.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/dyrpto/message.proto", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/dyrpto/message_pb2.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/dyrpto/output.txt"]}, {"name": "sidhe", "desc": "Feeling a little down on your luck and wondering where the next flag is going to be, you sit down to take a break. You’ve made a lot of progress so far, but it seems like there’s still going to be a lot of flags left to find. You lower your head to rub it with your hands, and play with your hair a little. It’s easy enough to mess up, but you bought the auto-hair-fixer a while back in a moment of weakness.\n\n“Hello, dearest. You’re looking a little down. How can I pick you up?”\n\nYou look up and see no one. The voice sounded warm and friendly, but you can’t see anyone around. Out of the corner of your eye, you spot a fluttering bird. Except its wings are gossamer like those of a dragonfly. And its body looks like a tiny human.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/sidhe/pow.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/sidhe/run.sh", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/sidhe/server.sage"]}, {"name": "stegasaurus-scratch", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/stegasaurus-scratch/Makefile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/stegasaurus-scratch/run.sh", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/crypto/stegasaurus-scratch/stegasaurus.c"], "desc": "\n\nEntering the Inner Sanctum, the first thing that catches your eye is the very large dinosaur skeleton fountain right in the middle of the plaza, beyond the entrance gate. While your knowledge of dinosaurs is… mixed at best, the plates on its back immediately give it away as a stegosaurus.\n\nThat's cool and all, but what exactly does that have to do with Bovik? Besides the fact that he presumably loved dinosaurs, of course.\n\nOn further inspection, you notice some inscriptions on the stegosaurus's plates. They're very roughly engraved, like someone was using some kind of hand tool to etch them into the bone. Or maybe… claws? Whatever the case, it seems like too strange of a detail right at the entrance for it not to be important.\n\n"}], "pwn": [{"name": "back to the future", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/back_to_the_future/back_to_the_future", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/back_to_the_future/ld.so", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/back_to_the_future/libc.so.4.7.6"]}, {"name": "emojidb", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/emojidb/Dockerfile", null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/emojidb/emojidb.xinetd"]}, {"name": "ipppc", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/ipppc/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/ipppc/connman", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/ipppc/flag", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/ipppc/hashcash.py", null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/ipppc/server.py"]}, {"name": "mojo", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/chrome.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/flag_printer", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/mojo_js.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/plaidstore.diff", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/run.sh", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/server.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/mojo/visit.sh"]}, {"name": "sandybox", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/pwn/sandybox/sandybox"]}], "rev": [{"name": "reee", "desc": "\n\nTired from all of the craziness in the Inner Sanctum, you decide to venture out to the beach to relax. You doze off in the sand only to be awoken by the loud “reee” of an osprey. A shell falls out of its talons and lands right where your head was a moment ago. No rest for the weary, huh? It looks a little funny, so you pick it up and realize that it’s backwards. I guess you’ll have to reverse it.\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/reee/reee"]}, {"name": "thats a lot of fish", "desc": "\n\nThe hot sun relentlessly beats down on you as you stagger across the scorching sands of the desert. You've been walking for hours and the endless flat landscape hasn't helped the dizzying feeling you've felt from dehydration, but you had to keep moving.\n\nAfter escaping the sand prison, you opened up the map on your HUD to see where you were. Except there was no map. You were facing a blank screen. For some reason, even escaping the sand prison hasn’t helped with your HUD at all.\n\n\"This is fine. Everything is fine. I'm just gonna teleport back home then.\"\n\nThe dehydration is getting to you, and you’re talking to yourself. It’s a little hard with your tongue so swollen. You go back a few menus on the HUD to teleport to home. But nothing happens when you press the button. Starting to panic, you try to exit REFUGE, but that button doesn't work either. Frustrated, you try hitting all of the buttons a few more times, but don't get any feedback. So you pick a direction and start walking.\n\nAnd then you find out the hard way what happens when you try to teleport about 25 times during a lag spike. You see flashes of a whole bunch of different locations—your home, the carnival, the stegosaurus fountain at the entrance of the plaza, your house outside REFUGE, the HQB library—before your brain finally shuts off completely from sensory overload and you black out.\n\nYou hear a siren. Groggily, you lift your head, and find yourself in the middle of a towering city; but it doesn't look like one you've ever seen. It's not nearly nice enough to be one in REFUGE, not nearly dingy enough to be in the real world. Something feels very, very off here. Oh, and your HUD is gone, so that's cool.\n\nAfter a few moments, you hear a loud BANG! from a few streets over. A military convoy of some sort suddenly appears from one of the nearby cross streets. With no other ideas for how to proceed, you choose to follow.\n\nWhat you see there is... confusing. There's something that looks like Godzilla attacking a skyscraper, but it seems to be made completely of metal. Mechagodzilla? And the military force you followed here doesn't seem to have a whole lot of weapons. Instead, from the vehicles, you see them unload tons upon tons of fresh fish, amassing them into one giant heap in the middle of the road. Are they trying to distract a mechanical monster with food? That doesn't sound like a great plan to you.\n\nAn onlooker beside you that you hadn't noticed up to this point suddenly pipes up. \"That's a lot of fish,\" he states flatly.\n\nHe's not wrong, you suppose.\n\nAs you watch on, for just a moment, you see a corner of a flag sticking out of the pile of fish, before being covered up by some cod and salmon that are added to the top of the pile. Well, it's not like you have a better option, right? You run up to the smelly pile and plunge in your hands, desperately hoping to locate that flag you just saw.\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/thats_a_lot_of_fish/index.ts", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/thats_a_lot_of_fish/tsc.js.diff"]}, {"name": "watness2", "desc": "\n\nYou think you’ve found everything in the back of the library, so you head back to the front, and find yourself in a section far more traditional than the one in which you started. You’re not really sure where to begin, so you just pull a random book off the shelf to see if there’s any useful information inside.\n\nFlipping to the first page, you’re not greeted with words, but what you can only describe as a window to another location entirely. It looks like some kind of garden? You’re not completely certain, but for some reason you feel compelled to place your palm to the image.\n\nAt one moment, you’re in the library, holding a book. The next, you’re in a dark tunnel, with no books in sight. Confused, you wander towards the light, only to find the garden you were looking at only seconds ago.\n\nA few steps away, you see an older man dressed in plain robes running his finger against a panel. He seems troubled by something. Curious, you approach him.\n\n“Hi there”, you say.\n\n“Hello my friend”, he responds. He doesn’t look at you; he’s completely engrossed in what he’s doing.\n\nThe card in front of him has a grid on it, and he seems to be drawing paths along the edges to connect certain points. It looks like he’s almost done, but then he shakes his head and backtracks almost all the way to the start. There must be some rules you’re not getting here. But, you feel certain that if you can figure those rules out, a flag will be yours.\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/watness2/watness_2.sit"]}, {"name": "you wa shockwave", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/you_wa_shockwave/Dirapi.dll", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/you_wa_shockwave/Iml32.dll", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/you_wa_shockwave/Proj.dll", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/you_wa_shockwave/Projector.exe.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/you_wa_shockwave/Projector.ini", null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/you_wa_shockwave/msvcrt.dll", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/rev/you_wa_shockwave/you_wa_shockwave.dcr"], "desc": "\n\nFeeling stifled by the large crowd gathered in the entrance plaza, you open up your minimap and try to find somewhere to search far away from the entrance gate. Ah, perfect—there’s some kind of library on the other side of the Sanctum. A nice, quiet place to search alone for a bit.\n\nEntering the library, you find that your guess the library would be quiet was… rather faulty. As the door swings closed behind you, instead of a soft bell that one might expect to hear, you’re greeted with the wail of an electric guitar, quickly followed by some heavy drums. Perhaps not a great place to sit quietly, but at least it seems like you’ve got the place to yourself!\n\nYou find yourself drawn to a section labeled “anime” (perhaps this is some sort of multimedia collection?), and everything there is spinning and flashing and generally making your eyes hurt a little. But there’s got to be a flag hiding somewhere behind the seizure-inducing mess, right?\n\n"}], "web": [{"name": "ContrivedWebProblem", "desc": "\n\nYou decide that the only way you’re going to be able to get any rest is to be back in your own bed. You teleport to your house and pull on your PJs. Of course, as soon as you climb under the covers, the day’s events start replaying in your head. You can’t believe how lucky you’ve been so far in the challenges—every single flag has appeared naturally to you as the result of your own curiosity. You didn’t need to force any of them.\n\nYour thoughts were running too fast, so you decide to pull out your phone and scroll through some feeds. As you pull it out, something seems off. You could swear that you had chosen the green case at the store last week. And why is it so triangular? That’s the kind of phone that three-fingered iguana avatars use.\n\nYou close your eyes for a second; you really are tired. When you open them again, the phone’s blue. Huh? You close and open them. Red. Close, open. Square. Close, open. Purple and pointy. Who can use a phone like that?\n\nThe curious thing is that you’re still able to see your phone screen just fine. Maybe there’s a way to figure this one out, too.\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/web/ContrivedWebProblem/docker-compose.yaml", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/web/ContrivedWebProblem/services.dockerfile", null]}, {"name": "MoozChat", "desc": "\n\nAfter chasing the dog around and around Carnival, you decide to take a walk to cool off. The smell of fried dough wafts past you as you walk back through the rigged games section. Everything looks familiar, but the spot where you found the fortune teller is gone. It’s not like the fortune teller is gone; the spot itself is gone. The pinned throws and the spinning knives are right next to each other as if there was never anything between them. It’s not clear how this is possible, but somehow the world has warped to hide where the fortune teller once was. That’s weird.\n\nYou continue to puzzle over this as you continue on to the booths. The Westworld booth looks even more realistic and gruesome up close. You shudder and decide not to go into that one. You don’t need to be throwing around anybody’s brain. Right next to that one, you see one that tickles your fancy a little bit more. The people crowded around this booth are all dressed in silly costumes; dinosaurs, superheroes, robots, secret agents, and more. They all carry weapons and pickaxes of a multitude of designs. As you get closer, you see a bush shift… and then stand up! There was a person inside! The group is a cacophony of noise; each one is dancing to a different short clip of music. One furiously flosses while several dab. Should you join in?\n\nFurther along, you see a booth shaped like a giant goose. Around its neck hangs a sign, “Untitled”. You walk into the belly of the goose and see a gardener diligently tending his plants. You manage to steal the keys with your newly-formed beak. Having a neck this long is really handy. You open the gate and continue deeper into the booth…\n\nAs you leave the goose, you return to your original size. “Blegh. That tasted awful.” Having to constantly use your mouth to move things around isn't really what you were looking for when you thought of \"fun\". Looking for a change of pace, you see that Animal Crossing booth that caught your eye earlier. You walk in to see the familiar face of Isabelle, smiling at you and welcoming you to the island. You explore for a little while, catching an oarfish to the applause of those around you, before walking into one of the many houses around.\n\nThe inside looks oddly familiar. You puzzle over this for a moment, before realizing that it looks exactly like your house. You walk over to the full-length mirror to admire your Animal-Crossing-ified self. As you’re staring, your Nook phone buzzes. You pull it out, but the screen is blank. Puzzled, you look back up at the mirror, and see your regular face looking back at you. You (the other you) is trying to say something, but you (the not other you) can’t make it out.\n\n“... people are hack… REFUGE … safe …”\n\nThe other you looks frantic, and is getting more frantic as they can see that you aren’t getting it. Suddenly, the other you tilts sideways and your view of them splits in half. Bits and pieces of the other you move around, while some stay in place. In an instant, the fragmented world disappears and you’re left staring at your own reflection.\n\nYou decide to puzzle over your Nook phone to see if you can figure out how you triggered the vision.\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PlaidCTF/2020/web/MoozChat/mooz-server"]}]}