{"crypto": [{"name": "Secure Hash At Home", "desc": "Hash-then-Sign is a paradigm that stood the test of time for over 30 years. So, don’t let any of those fancy new primitives lead you astray!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/crypto/Secure_Hash_At_Home/crypto.shahome.zip"]}, {"name": "Temple of the Square", "desc": "Now you’re in trouble again! You just wanted to steal the mighty trophy from some ancient temple with your friend Cindiana Dones, but you seem to have lost your way. There are puzzling sentences written on the walls: “Don’t trust the ancients, they can only think and not speak” - “Drink more tea” - “Hail the Platypwny” - “The best passphare is pure randomness” - “The lord will save you” - “Cyber cyber” - “Speak WTWSACLCRYCRQESUVUMETN if you want to succeed”. You find the last one especially confusing. After all, who would want to speak WTWSACLCRYCRQESUVUMETN, that does not sound like anything you know.\n\nAfter some time you reach a large, circular room. It has holes in the walls and several corridors leading to different directions. In the middle is a square inscribed in the floor. As soon as you enter, all the corridors collapse, and you are trapped!\nE \tA \tC \tG \tU\nF \tM \tO \tZ \tY\nK \tD \tP \tW \tS\nL \tQ \tR \tV \tN\nB \tH \tT \tX \tI\n\nCindiana Dones immediately recognizes it and begins to take out his endless scroll of Wikipedia pages. Because it is only a scroll, he can only scroll in one direction. You immediately start thinking about how he could optimize his search for the right Wikipedia page.\n\nBut there is no time to think about that right now! Because a trapdoor just opened under Cindiana Dones, and he falls into a bottomless pit. He only has time to throw the endless scroll of Wikipedia pages to you. “You must find the cipher” - he calls - “it starts with a P”.\n\nYou feel a bit lost, all alone in the room. What should you do? Should you try to optimize Cindis linear search in the endless scroll of Wikipedia? Maybe some hash table approach could help? And what was that word you were supposed to speak? You sit down and decide that you can’t really do much. Hopefully the cipher is not too complicated, and you can solve it just in your head.\n\nNote from the author: To build the flag remove any X from the secret, as they are padding. Then use the usual format PP{...} where the dots are replaced by the secret words. All words are separated by _ and written in lowercase. The PP{} are the only characters in uppercase.\n"}, {"name": "lOTtery", "desc": "Fresh from an introductory lecture on MPC, I set out to make the world a better place using privacy-enhancing technologies.\n\nThe first place to start is, of course, my professional gambling career. I plan to make a fortune in the 6/49 lottery using the groundbreaking betting techniques I developed while not paying attention in my statistics class last semester. However, I am winning significantly less than my irrefutable analysis predicts.\n\nI have a feeling that the lottery managers are onto me. They know I can beat them in a fair and random game, so they intercept my tickets and manipulate their drawings to put me at a disadvantage.\n\nIf they were really honest, they would not be afraid to use my newly developed lottery system instead. It uses oblivious transfer to let me buy tickets without them knowing what numbers I have chosen. Only when they reveal the winning combination I do show them my ticket, but thanks to crypto, I cannot cheat either. At least not to the system, my strategy is of course still brilliant.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/crypto/lOTtery/crypto.lottery.zip"]}], "forensic": [{"name": "Deep Blue Sea", "desc": "Legendary pirate Bluebeard has travelled far and wide over the Deep Blue Sea and has seen every corner of it. The crew’s legendary ship, the Blue Pearl, is just as legendary. As is Bluebeard’s famous cutlass, and parrot, and eyepatch, and so on. Almost as legendary is Bluebeard’s ancient treasure map, on which parts of the Sea are said to be marked with blots of crimson ink. There, Bluebeard has buried countless treasures over the years. But the biggest treasure can only be found if all other stashes are discovered. Then, the legend goes, the Depth of the Sea at their locations points to where Bluebeard’s most enormous treasure lies, buried beneath the waves of the Deep Blue Sea itself.\n\nOr so they say. You, a renowned treasure hunter, have paid a lot for the soggy piece of parchment now lying in front of you. It smells of seaweed and rip-off. You decide that it’s time to slowly peel it open and see if the Sea has left over anything of Bluebeard’s notes.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/forensic/Deep_Blue_Sea/forensics.deepbluesea.zip"]}], "misc": [{"name": "Dancing Platypus", "desc": "This is just a happy, dancing platypus. Nothing to see here.\n\nIf you do happen to see something, use the usual flag format PP{...} where the dots are replaced by the secret words. All words are separated by _ and written in lowercase. The PP{} are the only characters in uppercase.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/misc/Dancing_Platypus/misc.dancingplatypus.zip"]}, {"name": "MyFirstCloud", "desc": "I always wanted to build my own cloud. After wasting some time on weird programming languages and frameworks, I finally found the perfect tech stack: .NET, Node.js and a bit of Bash. Sounds lovely, doesn’t it?\n\nFeel free to test my project. And don’t worry about your personal data. Everything is safe and will be deleted after one hour.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/misc/MyFirstCloud/misc.myfirstcloud.zip"]}, {"name": "Satan Himself", "desc": "This challenge was made by satan himself. He chose the worst of esoteric programming languages, just to see the world burn. Good luck exploring hell itself and don’t forget to halt here and there to feel the pain ;)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/misc/Satan_Himself/misc.satanhimself.zip"]}], "osint": [{"name": "Fall", "desc": "Which building can be seen in this pretty fall photo?\n\nThe flag should be entered like PP{nameofbuilding}, where nameofbuilding is the name of the pictured building in the language of the country it is in. There are only lowercase letters and no spaces, diacritics or other special characters in the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/osint/Fall/osint.fall.zip"]}, {"name": "Rise", "desc": "This picture was taken on a sunny Saturday sightseeing trip earlier this year. Do you know when exactly?\n\nThe flag contains information about day, month, hour (24-hour clock), and minute rounded down to five full minutes of the local time when the picture was taken. Additionally, there is the sun’s altitude and azimuth at that time, both given in radians and rounded down to two decimal places.\n\nIf the picture was taken on March 14, 20:17:25 local time with the sun’s altitude of 1.4142 rad and azimuth of 3.1415 rad, the flag would look like this: PP{03-14_20-15_1-41_3-14}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/osint/Rise/osint.rise.zip"]}, {"name": "Swing", "desc": "I’ve been hiking on a real premium trail lately and found this swing. Can you tell me where it is?\n\nThe flag consists of latitude and longitude coordinates of the swing’s location rounded to three decimal places, the name of the street (omitting any potential spaces, punctuation and diacritics), and the name of the town it belongs to.\n\nRegarding flag format, consider this example for one of our university’s buildings: PP{N52-516_E13-377_augustbebelstrasse_potsdam}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/osint/Swing/osint.swing.zip"]}], "rev": [{"name": "Antihash", "desc": "Hash functions are really just turning strings into shorter, more jumbled strings, right? So I made an antihash function, it turns strings into longer, more jumbled strings! Can you guess what my input was?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/rev/Antihash/rev.antihash.zip"]}, {"name": "Tinylock", "desc": "I found this tiny lock. Can you find the key for it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/rev/Tinylock/rev.tinylock.zip"]}], "web": [{"name": "Cash Puzzle", "desc": "💸 Puzzling puzzles 💸\n\nOk, now it is getting ridiculous. After not being caught at last years Platypwn, Catmaster420 has again infiltrated our infrastructure. We never found out how we were infiltrated last year, so we had proactively rewritten our entire codebase in go. It was supposed to be secure now :(. We had even developed the best challenge for you: You just needed to solve a 4x4 puzzle to get the flag. But it’s not that simple anymore, as Catmaster420 has inserted an if statement at a critical position in our code, so it doesn’t return the flag anymore. There might also be other traces of his doing in our codebase. Please, go forth and find out what is wrong with our code this year. You are our last hope at catching the Catmaster!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/web/Cash_Puzzle/web.cashpuzzle.zip"]}, {"name": "Notes", "desc": "What would be a CTF without a note-taking application web challenge? So of course we’ve got you covered!\n\nNotes is a cute, tiny, and modern huge Java app, featuring lots of cursed code on enterprise level. If you think that you could build an identical app with only half as much code using any other language, you are right. But then, the challenge would be only half as fun as it is now…\n\nYour task is simple: Read trough the roughly 600 lines of Java code (it would be a shame if I put all that effort into the challenge and no one enjoys my code), understand the application, find the vulnerability and snatch the admin’s cookie!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/web/Notes/web.notes.zip"]}, {"name": "Pretty HTML Page", "desc": "I made a pretty HTML page. It can even give you a flag if you write “flag”! But for security reasons, as soon as you write “flag”, your input will get redacted. Sorry for that :)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/web/Pretty_HTML_Page/web.prettyhtmlpage.zip"]}, {"name": "Secure sign on", "desc": "Last month, we hacked the authentication logic of the evil “Pustekuchen Corp.”. They have just updated their social media platform and have rewritten everything in safe rust. Also, there is this fancy super secure single sign-on solution and every employee account is migrating to it.\n\nWe already tried to phish some employers yesterday. Good news: Everyone clicked on headlines containing “Cat videos” - but they just entered garbage into our password forms as a distraction! Grrrr.\n\nNow, you need to help us. We identified one individual who clicked on our cat videos, and now you need to hack her.\n\nSomeone we only know as “christine-catlover[at]pustekuchen.platypwnies.de”. Apparently, she is not registered on their social media platform, but she was the first one who clicked on our cat videos. Rumours have it that she is head of security at “Pustekuchen Corp.”. Hilarious…\n\nIndeed, she bragged about building it via a telegram and told everyone that no one could ever steal the flag from her single sign-on account. Can it really be that there are no soundness holes in the new authentication logic? Well, let’s find out.\n\nNote: this challenge takes some time to load, so please be patient (1-2 min).\n\nCAT\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/web/Secure_sign_on/web.securesignon.zip"]}, {"name": "TeXnically Insecure", "desc": "Note: It may be a good idea to test your exploit locally first. However, if you manage to break the challenge, simply restart it.\n\nAfter starting my studies, I wanted to play around with LaTeX. So I built a web-based editor! Unfortunately, people have tried hacking it, so I needed to blacklist some commands. But I’m sure it’s 100% secure now! :) I also made the app restart if it crashes, I just hope that people can’t abuse that for something. But hey, it’s just a restart, right? What could possibly go wrong?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2024/web/TeXnically_Insecure/web.texnicallyinsecure.zip"]}]}