{"blockchain": [{"name": "Coin Flip", "desc": "Maybe you can win, but you need to get really lucky…\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/blockchain/Coin_Flip/blockchain.coinflip.zip"]}, {"name": "Rigged", "desc": "Playing unregulated online casino games on the blockchain where everyone is trustworthy is a surefire way to lose all your money. Or is it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/blockchain/Rigged/blockchain.rigged.zip"]}, {"name": "Thanks", "desc": "Tighten your seatbelts and get ready to embark on an exhilarating journey through the world of blockchain technology! This intro challenge will help you get started.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/blockchain/Thanks/blockchain.thanks.zip"]}, {"name": "Unfair Trade", "desc": "You found this smart contract deployed on the Ethereum blockchain. It looks unfair, or does it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/blockchain/Unfair_Trade/blockchain.unfairtrade.zip"]}], "crypto": [{"name": "Cognitive Reminder Call", "desc": "The server seems to be forgetful :(\n\nCan you help it remember?\n\nCover\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/crypto/Cognitive_Reminder_Call/crypto.cognitivereminder.zip"]}, {"name": "German PuDDIng", "desc": "Das ist ein authentisch deutsches Produkt, empfohlen vom BSI. Die Beweise, Kurven und Standards sind alle lokale Spezialitäten!\n\nPackage of pudding powder by Dr. Schnorr\n\nThis is an authentically German product, as recommended by the BSI. Proofs, curves, standards are all local specialties!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/crypto/German_PuDDIng/crypto.pudding.zip"]}, {"name": "rejected", "desc": "Time to learn some post-quantum crypto!\n\nThe signing procedure of Dilithium uses rejection sampling to generate a signature, and the authors give the following reasoning:\n\n“If\nz\nz were directly output at this point, then the signature scheme would be insecure due to the fact that the secret key would be leaked. To avoid the dependency of\nz\nz on the secret key, we use rejection sampling. […] The first check is necessary for security, while the second is necessary for both security and correctness.” [1]\n\nNow, it’s your task to prove this.\n\ndiff --git a/ref/sign.c b/ref/sign.c\nindex 7d3f882..39fbad2 100644\n--- a/ref/sign.c\n+++ b/ref/sign.c\n@@ -158,7 +158,7 @@ rej:\n   polyvecl_invntt_tomont(&z);\n   polyvecl_add(&z, &z, &y);\n   polyvecl_reduce(&z);\n-  if(polyvecl_chknorm(&z, GAMMA1 - BETA))\n+  if(!polyvecl_chknorm(&z, GAMMA1 - BETA))\n     goto rej;\n\n   /* Check that subtracting cs2 does not change high bits of w and low bits\n⚠️ Warning: We provide the complete source code running on the server and a docker-compose.yml file for local testing. Please solve the challenge locally before starting a remote instance. If your solution does not work locally, there is no point in trying it on remote. Not only do you have debug capabilities on a local deployment, generating the signatures only if you need them also spreads out the resource spikes for us, increasing your chances of stable infra ;) So please avoid using remote until you have a verified working solution.\n\n[1]: Shi Bai, Léo Ducas, Eike Kiltz, Tancrède Lepoint, Vadim Lyubashevsky, Peter Schwabe, Gregor Seiler, and Damien Stehlé.CRYSTALS-dilithium, algorithm specifications and supporting documentation, 2021. https://pq-crystals.org/dilithium/data/dilithium-specification-round3-20210208.pdf.\n\n(dilithium disapproves): z_inf >= gamma_1 - beta / (dilithium approves): z_inf < gamma_1 - beta\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/crypto/rejected/crypto.rejected.zip"]}, {"name": "saCReT texts", "desc": "they always had the solution, but this time…\n\nEvery time I type in “RSA crypto ctf challenge” into the search engine, I get this one PDF that always has the solution. But this time, it doesn’t. Can you solve this challenge, regardless?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/crypto/saCReT_texts/crypto.sacrettexts.zip"]}], "forensic": [{"name": "Key Conversation", "desc": "Someone managed to eavesdrop on some super secure communication and sold you the data. They told you there’s value in those bits and bytes. You just need to find the ones that are valuable.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/forensic/Key_Conversation/forensics.keyconversation.zip"]}, {"name": "Operation Lost Data", "desc": "Briefing: Agent: Agent P (a.k.a. Perry the Platypus) Subject: Recovered backup — suspected to belong to Dr. Heinz Doofenshmirtz Objective: Extract and analyze critical intelligence fragments before they self-destruct (metaphorically, we hope).\n\nDuring a recent OWCA operation, Agent P recovered a backup from a damaged device belonging to Dr. Heinz Doofenshmirtz. The phone itself is beyond repair, but traces of data remain. Analysis suggests Doofenshmirtz intentionally scattered three hidden fragments across different parts of his system. His final voice memo offers only riddles — a frozen memory, a restless idea, and in resting thoughts. Your task: extract all fragments before whatever he was planning comes to life.\n\nCover image of the challengeCopyright by Disney\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/forensic/Operation_Lost_Data/forensics.lostdata.zip"]}, {"name": "Stalking as a Service", "desc": "Content warning: Digital Violence Warning: This challenge uses functional malware! Do not install anything on a physical device! This challenge uses third-party domains not part of the ctf! This challenge is solvable offline!\n\n“SOFTWARE INTENDED FOR LEGAL USES ONLY” This seems to be the notice that renders hacking tools legal. Your local women’s shelter knows about the use cases of such software. They captured the network traffic of the mobile device of a victim of digital violence in relationships and seek technical aid in analyzing it. Can you help them?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/forensic/Stalking_as_a_Service/forensics.platyspy.zip"]}], "misc": [{"name": "Copy Pasta", "desc": "pasta pasta pasta pasta\n\nYou have been invited by a friend to join a very special safari. The trip will go through the magical land of pasta, which is surrounded by alpine mountains. A beautiful journey, that’s for sure. But you are unsure whether you want to go. You have heard rumors of the dangerous copy pasta, which appears in the moment you least expect it to. But your friend is sure that this place is totally safe. Are you?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/misc/Copy_Pasta/misc.copypasta.zip"]}, {"name": "Lost in Sauerbraten", "desc": "*NOISE* … Hel…lo? Is anyonee the…re? Do you … *NOISE* copy??? II seem to be lost in so…oome kind of weird maze. *STATIC* … *EVEN MORE STATIC* … The waals are to high to c…climb over. I am stucccck in here! *LOUD STATIC* … If anyone finds this message … don’t try to slve the maze! *STATIC BURST* …\n\nA maze you say? Hold my Spezi! Solve our custom maze map by finding the hidden flags and prove you are a worthy Sauerbraten player!\n\nTo connect to the server build the custom Sauerbraten client from the provided Dockerfile in the challenge files. We have added some useful stuff to load our custom map and to make connecting easier. We also have upgraded our Sauerbraten server to extend functionality and prevent cheating! (This might result in you getting kicked from the server)\n\nHave fun playing some Sauerbraten!\n\nOfficial Sauerbraten Website\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/misc/Lost_in_Sauerbraten/misc.sauerbraten.zip"]}, {"name": "Strin GO Matic", "desc": "It took me quite a while to decide whether I should name this challenge “Strin-Go-Matic”, “strinGOmatic”, or rather “[Strin(g]-o)-Matic”.\n\nLuckily, I had a tool for those case conversions at hand…\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/misc/Strin_GO_Matic/misc.stringomatic.zip"]}], "osint": [{"name": "Bench", "desc": "Last year we had a swing, this year it is only a bench where you can sit down and rest a bit from all the challenging challenges. Where was this photo taken?\n\nBrute force is neither necessary nor allowed to solve this challenge. Do not attack the location picker tool. The tool is rate-limited to three tries per minute, so be careful when you submit. A full-resolution version of the image is available for download.\n\nA bench\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/osint/Bench/osint.bench.zip"]}, {"name": "Ditch", "desc": "The challenge author has found a nice ditch, so they took a photo of it including the signpost with its coordinates on. But what is that! A Platypwny has eaten up the coordinates!\n\nLuckily, you can still find the coordinates again, right?\n\nBrute force is neither necessary nor allowed to solve this challenge. Do not attack the location picker tool. The tool is rate-limited to three tries per minute, so be careful when you submit. A full-resolution version of the image is available for download. This is not a forensics challenge.\n\nA nice ditch.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/osint/Ditch/osint.ditch.zip"]}, {"name": "Flag Submission System", "desc": "For this Platypwn, we thought about a new and super secure Flag Submission System! To make it easier for you, we made a tutorial video where you can learn how it works.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/osint/Flag_Submission_System/osint.flagsubmissionsystem.zip"]}, {"name": "Mean kitty", "desc": "Anonymous sources have provided us with some mysterious threats towards us. Can you track down the mean kitty and protect our flags?\n\nScreenshot of kitty's message\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/osint/Mean_kitty/osint.meankitty.zip"]}, {"name": "Men at Work", "desc": "Follow the challenge author around on even more adventures! This time, they found lots of train tracks and some working men. Can you find the location and the date on which this was taken?\n\nBrute force is neither necessary nor allowed to solve this challenge. Do not attack the location and date picker tool. The tool is rate-limited to three tries per minute, so be careful when you submit. A full-resolution version of the image is available for download.\n\nTrain tracks and working men\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/osint/Men_at_Work/osint.menatwork.zip"]}], "rev": [{"name": "Password Check", "desc": "I forgot my password, can you help me remember?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/rev/Password_Check/rev.passwordcheck.zip"]}], "web": [{"name": "Break the DOM", "desc": "Note: this challenge may take up to two minutes to deploy.\n\nYou have been studying for this moment for the past three months: the final contest of the competitive programming lecture at your university is scheduled to start in three days. However, to your dismay, the integrity of the contest seems to have been damaged: a fellow student already has access to the problem statements and has been working on their solutions ahead of time! You know the teaching team and you trust that they didn’t share the problems, so the only fragile component is the platform the competition is hosted on: DOMJudge.\n\nOf course, being a competitive programmer, you need to win this competition. And for this, you too need access to the problem statements – ASAP! Luckily, the DOMJudge config is available on the chairs GitLab, so you’ll only need to find a way in.\n\nDid the admins mess up the setup, or is there a problem with the platform itself?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/web/Break_the_DOM/web.breakthedom.zip"]}, {"name": "HTTP 1 must die", "desc": "I had some free time and started building a little reverse proxy in python, just for the fun of it. But man HTTP/1 is weird. Anyway, I think my proxy mostly works and it allowed me to skip implementing authentication on my server cause I can just block routes there. Pretty cool, no?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/web/HTTP_1_must_die/web.http1mustdie.zip"]}, {"name": "Platytours", "desc": "Join your fellow platypuses on a tour to the heart of this litte Django application. Can you collect enough rewards to unlock the flag?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/web/Platytours/web.platytours.zip"]}, {"name": "Quark", "desc": "What happens when you mix LaTeX and Markdown? Could that be secure? Is it utterly broken, cause LaTeX? Well, time to find out!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2025/web/Quark/web.quark.zip"]}]}