{"crypto": [{"name": "Non Zero Knowledge Proof", "desc": "To protect against dishonest users, this service implements the latest zero knowledge proof technology for all parties. This is a safe technology, as stated by our knowledgeable consultants. Only real users may obtain the securely encrypted flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/crypto/Non_Zero_Knowledge_Proof/server.py"]}, {"name": "OFficial Business", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/crypto/OFficial_Business/MSG_FORMAT", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/crypto/OFficial_Business/TRANSCRIPT"], "desc": "We intercepted an encrypted incoming transmission at a rogue employee's workstation. We suspect that there is a second troublemaker working alongside them. There is a high chance that secret data has been exfiltrated during the recorded communication. We will provide you with the communication transcript of ciphertext and IV pairs. The suspect likely used AES-128 with a common block cipher mode. Additionally, we have provided you with our format for inter-agency communication, we expect the original messages to have included 1 TRANSMISSION STATUS: BEGIN BLOCK line for every 4 lines of 32 byte messages. Check the format file for an example.\n"}, {"name": "Pairing Analysis", "desc": "There is a notorious cyber gang that threatens the peace in Dasdorf, known only by their public keys. Our law enforcement agents have recently acquired a database containing secret keys, however the data has been scrambled. We also fear that the criminals have anticipated this action and have planted diversions accordingly. Can you restore law and order to this keypair mess?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/crypto/Pairing_Analysis/go.mod", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/crypto/Pairing_Analysis/main.go"]}], "forensic": [{"name": "Coffee break", "desc": "Last Monday, my colleague had the weirdest computer problems. First, his new 10 TB USB flash drive did not work at all at the work PC. Next, when he came back from a coffee break, his screen showed a cryptic message to pay someone money to get back files, with red blinking skulls. Even after a restart, there was no way he could work on our spreadsheets. The IT people said they want to give him a new computer and saved all his settings to speed up the process, but our crucial spreadsheets are still behind schedule.\n\nCan find out what happened to the old system?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/forensic/Coffee_break/settings.file"]}, {"name": "Digital censorship", "desc": "We have searched in our archives and were able to restore an old and dusty document. Evidently, experts for the digital transformation of the German admistration forged a 100-day-plan to create a digitalized future.\n\nHowever, my assistent mistakenly took it for spam, and just censored it completly according to our high-security protocols. Are you able to recover it? The future of digitalized Dasdorf is depending on it!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/forensic/Digital_censorship/challenge.pdf"]}, {"name": "Good Weather", "desc": "A few years ago we have installed some weather stations around the town and the surrounding country side. Unfortunately, the project leader left us last year, so now we have the data but don't know what to do with it. Maybe you can find something interesting in the data?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/forensic/Good_Weather/weather_stations.zip"]}, {"name": "Missing Pages", "desc": "We looked into our recycle bins. This pdf seems off, our parsers told us. It is a bit crinkled, but the quality should be okay-ish. Our intelligence officers found out, that it contains juicy digitization information from 2021! This document might be crucial in achieving our strategies against the DDDs.\n\nHowever, the officers implied, that there might be something missing. Where could it be? Please find it out, asap!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/forensic/Missing_Pages/challenge.pdf"]}, {"name": "Secure Transfer", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/forensic/Secure_Transfer/Application.eml"], "desc": "It's been a tiring day but you're almost done with work for today. Just as you're about to pack your stuff, a colleague approaches you with a weird problem. They sound rather confused but tell you it has to have something to do with an email attachment ...\n"}], "misc": [{"name": "Message from a new world", "desc": "As you open the department's communication platform, a message catches your eye. Has a DDD person tampered with your colleague's sanity (or with their setup)?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/Message_from_a_new_world/Screenshot.png"]}, {"name": "Riscs of Assembler", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/Riscs_of_Assembler/.dockerignore", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/Riscs_of_Assembler/Dockerfile.public", null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/Riscs_of_Assembler/nodemon.json", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/Riscs_of_Assembler/package-lock.json", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/Riscs_of_Assembler/package.json", null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/Riscs_of_Assembler/tsconfig.json", null], "desc": "The Digitalization Department of Dasdorf got some interesting information: The daring digitization delinquents prefer writing their exploits in RISC-V assembler! They even operate their own web platform to train their new members. This could be a chance for Dasdorf! For sure, also the daring digitization delinquents have to make a mistake sometimes. Maybe, this platform allows you to regain some information stolen by the daring digitization delinquents...\n"}, {"name": "platycat", "desc": "Your new colleague Doris operates a fileshare on DDD activity info. You requested the password for it a while ago, and today you received her answer:\n\n    Hello dear!\n    I'm terribly xorry that this took me so long! I've attached the password, but for security reasons I've encrypted it with my personal key. Oh, and there's platypus pictures! I've also encrypted them for fun :)\n\n    Since I can only append one file, I've joined them with a revolutionary tool to join cute animal pictures (it came preinstalled on my computer!). And of course I also can't send you the key ;)\n\n    Best, Doris\n\nCan you find the password for Doris' fileshare?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/misc/platycat/omglook.png"]}], "net": [{"name": "Ping Pong", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/net/Ping_Pong/PingPong.pcapng.xz"], "desc": "After your successful investigation of previous breaches you're tasked with looking into another one. The somewhat competent admin you've made friends with has already looked into it and told you that there was nothing to be found. Yet, you insist on taking a look yourself, which may prove to be a good idea.\n"}, {"name": "Watchful Eyes", "desc": "After noticing your talent with \"digital stuff\", you've been assigned a new task today. Donas Dittrich hopes that you can figure out what data has been stolen in an attack yesterday. So you begin your arduous journey of asking way too many people until you finally end up finding an admin that accidentally implemented some \"logging\". He provided you with the following file which is your only chance to make sense of this mess.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/net/Watchful_Eyes/Watchful_Eyes.pcapng.xz"]}], "rev": [{"name": "dont call me", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/rev/dont_call_me/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/rev/dont_call_me/example_user_program.S", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/rev/dont_call_me/os.img", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Platypwn/2023/rev/dont_call_me/start-qemu.sh"], "desc": "Meet the Dasdorf super secure OS (DAS SOS)! In our Digitisation Department, we are not using this Silicon Valley OSs... nope! We use our own stuff. And we're very proud. Of course, we took the OS-101 course before writing our operating system.\n\nThis challenge requires reverse engineering the given software. Familiarize yourself with the boot process of a virtual x86 machine. We recommend using Ghidra to get an insight into the operating system. Play around with user programs.\n"}]}