{"crypto": [{"name": "A Pale Violet Light", "desc": "e= 5039\n\nN = 34034827\n\nC = 19902111 794016 9266203 12476679 383032 28541973 24685051 2020015 28847040 32708295 7444571 28541973 33115072 6428289 32532872 2236440 18261085\n"}, {"name": "Missing and Missed", "desc": "A little cerebral fornication to round out the crypto challenges.\n\n++++++++++[>+>+++>+++++++>++++++++++<<<<-]>>>>++++++++++++.-.------------.+++++++++++++++++.--------------.+++++++++++++++++++++.------.++.----.---.-----------------.<<++++++++++++++++++++.-.++++++++.>>+++++++++.<<--.>>---------.++++++++++++++++++++++++.<<-----.--.>>---------.<<+++++++++.>>---------------.<<---------.++.>>.+++++++.<<--.++.+++++++.---------.+++++++..----.>>++++++++.+++++++++++++++.\n"}, {"name": "Unquestioned and Unrestrained", "desc": "First crypto challenge so we have to keep it easy. Here's the flag, but it's encoded. All you have to do is figure out which method was used. Luckily, it's a common one.\n\ncG9jdGZ7dXdzcF80MTFfeTB1Ml84NDUzXzQyM184MzEwbjlfNzBfdTV9\n"}], "forensic": [{"name": "A Petty Wage in Regret", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2023/forensic/A_Petty_Wage_in_Regret/DF2.jpg"], "desc": "Here is a very interesting image. The flag has been broken up into several parts and embedded within it, so it will take a variety of skills to assemble it.\n"}], "misc": [{"name": "This Fellow is Dancing Mad", "desc": "Cipher text: 4]†*3{,1,:_6#3_[#4#7$_#8#3#38_#8#1#7#7#3¶_#8‡_#7(#3_#4#2#4‡#79#1#4}\n\nTo decode the flag you will need to reverse three levels of encryption.\n\n1) My last step is your first. You see the cipher text that results. Unique character set, no? The only problem is I had to call out which characters were actual numbers and which weren't. Then there's those pesky delimiters. That's the only clue you'll get, except that you should observe that the stories told are all about money-seekers, not about money-finders.\n\n2) We cross paths on the second step. DO NOT call Vinnie at 742-7264 and he'll tell you what you need to know for the last step.\n\n3) My first step is your last. Another polyalphabetic substitution cipher. I learned this technique while studying under Dr. Bronckhorst at Gronsfeld. He liked to post little puzzles for students to consider on the blackboard but would never actually explain how to solve them. Apparently he never realized it's not enough to just look at a problem, you have to say a thing or two about it as well. Unless you can get two for one (or even three!), most things in life come better in pairs. Consider the key to this last step, for example: 13211321322119\n"}], "pwn": [{"name": "A Guilded Lily", "desc": "Years ago there was this neat little bug discovered in OpenSSL, which became known as \"Heartbleed\". The world's first bug with a name. Heck, it even had a logo! I have attempted to recreate something thematically similar to Heartbleed here for you.\n\nThere are plenty of ROP gadgets here, but not a single \"/bin/sh\" string. Darn it! Maybe you could put \"/bin/sh\" somewhere in memory yourself, as you send the payload? If so it sure would be convenient if one of the registers was already pointing to it. If you could only find some ROP gadgets to shuffle that register's value into RDI...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2023/pwn/A_Guilded_Lily/exploit2.bin"]}, {"name": "My Friend A Loathsome Worm", "desc": "In November of 1988 the internet changed forever when the very first self-propagating worm, the Morris Worm, began spreading like wildfire. This clever little program took advantage of week passwords, as well as a buffer overflow vulnerability in the BSD fingerd service to spread. Here's the actual vulnerable source code that the Morris Worm was able to exploit! Do you see the bug?\n\nhttp://www.retro11.de/ouxr/43bsd/usr/src/etc/fingerd.c.html\n"}, {"name": "Time is but a Window", "desc": "Think small, and simple. No fancy ROP chains or shellcode necessary, a single byte should be sufficient.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2023/pwn/Time_is_but_a_Window/exploit3.bin"]}], "rev": [{"name": "A Tangled Web We Weave", "desc": "The flag has been hidden in these assembly instructions, except I forgot how to decode it... If you figure it out you get the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2023/rev/A_Tangled_Web_We_Weave/re2.asm"]}, {"name": "Easy as it Gets", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2023/rev/Easy_as_it_Gets/RE1.ps1"], "desc": "It doesn't get much easier than this when it comes to reverse engineering. Here we have a \"secure\" PowerShell script. All you need to do is figure out the super secret passphrase to decrypt the flag.\n"}, {"name": "Sunshine on Filth is Not Polluted", "desc": "Log in with a valid username and PIN code, and this program will give you a shell. The username is easy to identify, but the PIN code is randomly generated!\n\nTo get the flag, you will need to exploit the binary on a live system. The binary is running on 34.123.210.162 port 20231 and the flag can be found in the /home/re3 directory when you get a shell.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2023/rev/Sunshine_on_Filth_is_Not_Polluted/re3.bin"]}]}