{"crack": [{"name": "A Hard Row to Hoe", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crack/A_Hard_Row_to_Hoe/Crack400.kdb"], "desc": "This summer I had a chance to meet up with some future cybersecurity professionals. Young people that have an interest in cybersecurity and plan to enter the field when they grow up. One of them told me something I've heard here and there in the community. \"Password length doesn't matter. It's all about complexity.\" Let's put that to the test. Here we have a kdb. The password for it is no greater that eight characters. Upper, lower, 0-9, and special characters. Maximum complexity. Minimal effort.\n\nRight Click, Save As... Download KeePass Database\nMD5 checksum: 7E2999FC8FFBB3047A766494B68492C8\n\nA hint has been released for this challenge during Wave 3. Crack 400 Hint 1\n"}, {"name": "Gently Down the Stream", "desc": "You might have noticed by now that I've been throwing in a lot of tricks for the crack challenges. Not this time. This time we're getting back to basics. Kindergarten stuff. If you've never done a challenge like this before, don't be intimidated. This is all about learning the ABCs of password cracking. It's just four simple steps, repeated twice. What you learn here might not apply to all password cracks, but it will at least get you through this one.\n\nA. Always read up on your cipher. Research is the most important step. Do this twice because it's proven that repeated exposure improves learning.\nB. Be prepared. Download a good wordlist. It doesn't hurt to do that twice, too, since the first one might get worn out if it takes a long time to crack.\nC. Calibrate your password cracking rig. I use an RKO King Kong for mine. Then calibrate your other cracking rig. My backup is a Kempe Gowda 3.\nD. Dead chicken. In the 90's, there was an idiom in the computer world: \"Wave a dead chicken.\" The idea being that you do everything to prepare and at a certain point all you can do is pray the thing works. Well, you might as well wave two dead chickens, because all you can do now is wait for it to finish.\n\nBelow is a diagram to help you understand the cipher.\n\nI'll also tell you that the password uses only A-Z. You'll also need the ciphertext, obviously:\n71 81 13 f7 f7 b2 87 bd c6 77 68 67 25 ae fd 99 00 6e 2e 53 e6 60 50 50 ae a8 0f 9b 0a\n"}, {"name": "Guffaw of the Jackdaw", "desc": "Boy, these Crack challenges... You know, I seriously considered not including them this year. They're so dull. Like watching paint dry. I spent a lot of time trying to think of ways to make them interesting. You know the worst part is that they don't really teach very practical skills? Social engineering is more reliable, and a little recon is usually better for building tailored dictionaries. Just look at the most common password lists - sports, cartoons that were popular when they were kids, food, sex, family members, pets, birthdays, all regularly appear as popular choices. Things we know, things we like. In fact, let's put it to the test...\n\nHere's Jack. He loves monster trucks. Like, REALLY likes them.\n\nHe loves them so much, his monster truck is his daily driver.\n\nEvery chance he gets, he goes out to jams and exhibitions.\n\nJack is a man that likes BIG things only. Sliders? No, Jack likes the burger that weighs a full kilo. Petite fours? Jack says he's a grand fours man. Little Italy? Get out of here with that. Jack will have a worldwide Italian empire or nothing at all!\n\nJack recently asked me for advice. He's required to change his password every year at work. Well, he forgot it! He wanted to know if he should use a password vault to avoid this in the future since he tends to just add numbers to the end of his password and increment them each time they need to be changed. The answer is certainly yes, but I bet you can figure out his password just based on this information alone. If you figure it out, use it on this file. I'm sure you recognize this icon, so I don't need to tell you what to do with it.\n\nMD5 checksum D97BDBF47999D3D78E9BF317244D663A\n"}, {"name": "Hunter Too", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crack/Hunter_Too/Crack100-3.7z"], "desc": "A simple archive with the flag inside. The password is not on a common wordlist, but it can be brute-forced. That should keep you busy for a while. That's it... It's that simple.\n\nOk, I admit it. I'm being petty. I'm going to make you work way too hard for \n\nRight Click, Save As... lol. lmao, even. rofl, one might say.\nMD5 checksum 8465033f08f5de2c8371d83bbd9304b0\n"}, {"name": "I Have Written Down My Secrets", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crack/I_Have_Written_Down_My_Secrets/Crack100-2.pdf"], "desc": "Summer breaks are great, but I can't stand the downtime. I need to keep my mind occupied. I need a project, a puzzle, a challenge. It's not about staying productive, per se. I just need to keep this mind moving or I'll get bored. I've found the hobby that is presently perfect without being too invested: Learning languages. Simple, no-pressure, infinitely valuable, and a great intellectual challenge. This summer I went a little overboard and overindulged in Duo's offerings. I spent at least a few hours every day learning Spanish, French, German, Italian, Russian, Mandarin, Arabic, Finnish, Hindi and Swedish. I know, that's obviously way too many languages to attempt at once, but it's easy to over-commit and spread myself thin when there are so many wonderful options available. French was actually my focus this summer. I had so much fun learning that I would over-zealously do extra lessons. Is Duo the best way to learn? Non! Am I really learning all that much in the end? Occupez-vous de vos oignons! After a summer of learning am I able to even communicate at all in French? Absolument pas! Je te dis, c'était mieux que de mater les JO à Paris cet été.\n\nClic Droit, Enregistrer Sous... Crack100-2.pdf\nMD5 checksum: 978A017C772FAA17A0DBFC25561A499D\n"}, {"name": "No Thing Lasts Forever", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crack/No_Thing_Lasts_Forever/Crack100-1.zip"], "desc": "Hold on... This can't be right...\n\nMy notes say this is supposed to be a \"normal\" crack challenge? So... I spend twelve weeks throwing these oddball cracking challenges at you, and after all that time we go back to wordlist and wait?\n\nKind of a jerk move, if you ask me.\n\nRight Click, Save As... EZ PZ\nMD5 checksum 2F93B714D2E4391A90CC231630F20317\n"}, {"name": "Now You See Me", "desc": "Another Crack challenge, and I'm going to make this tricky by giving you a series of cryptic clues, then it'll be up to you to work your magick and find the flag. Here are two images. One is a key. The other you can't see because it's encrypted, but it's the flag.\n\nMD5 checksum 0AA46A2867C4339EBDBC4955B3BD237D\n\nMD5 checksum B9DFD8F6D8101A2C32B5C28277B43CB5\n\nOk. Here are your clues:\n1) [A-Z0-9]{10}\n2) The password is somewhere in this text.\n\nX3G7B9J2LQM5K8N1T4ZVP0D2S9C6JHF7Y3L8M1QWH4J6K2Z8N9Q9L1T3D6X2A8S5F2G7H1B3C6D9E2R4N0M5L7K3J8V6W2E4R8Y1U1I2O3P4A5S9D8F7G6H5T4Y3U2I1O0E6R5T4Y3U2G7H8J9K0L1Z3X4C5V6B7M8N7B6V5C4L2K3J4H5G6F1D2S3A4Q5W6E7R8T9Y0U9I8O7P6A5S4D3F2G1H0J9K8L7M6N5B4V3C2X1Z0A1S2D3F4G5H6J7K8L9M0N1B2V3C4X5Z6A7S8D9F0G1H2J3K4L5M6N7B8V9C0X1Z2A3S4D5F6G7H8J9K0L1M2N3B4V5C6X7Z8A9S0D1F2G3H4J5K6L7M8N9B0V1C2X3Z4A5S6D7F8G9H0J1K2L3M4N5B6V7C8X9Z0A1S2D3F4G5H6J7K8L9M0N1B2V3C4X5Z6A7S8D9F0G1H2J3K4L5M6N7B8V9C0X1Z2A3S4D5F6G7H8J9K0L1M2N3B4V5C6X7Z8A9S0D1F2G3H4J5K6L7M8N9B0V1C2X3Z4A5S6D7F8G9H0J1K2L3M4N5B6V7C8X9Z0A2S3D4F5G6H7J8K9L0M1N2B3V4C5X6Z7A8S9D0F1G2H3J4K5L6M7N8B9V0C1X2Z3A4S5D6F7G8H9J0K1L2M3N4B5V6C7X8Z9A0S1D2F3G4H5J6K7L8M9N0B1V2C3X4Z5A6S7D8F9G0H1J2K3L4M5N6B7V8C9X0Z1A3S4D5F6G7H8J9K0L1M2N3B4V5C6X7Z8A9S0D1F2G3H4J5K6L7M8N9B0V1C2X3Z4A5S6D7F8G9H0J1K2L3M4N5B6V7C9X0Z1A2S3D4F5G6H7J8K9L0M1N2B3V4C5X6Z7A8S9D0F1G2H3J4K5L6M7N8B8V9C0X1Z2A4S5D6F7G8H9J0K1L2M3N4B5V6C7X8Z9A0S1D2F3G4H5J6K7L8M9N0B1V2C3X4Z5A6S7D8F9G0H1J2K3L4M5N6B7V8C9X0Z1A2S3D4F5G6H7J8K9L0M1N2B3V4C5X6Z7A8S9D0F1G2H3J4K5L6M7N8\n"}, {"name": "Return of the Mack", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crack/Return_of_the_Mack/Crack300-2.pem", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crack/Return_of_the_Mack/Crack300-2_flag.txt.enc"], "desc": "Sterling Archer. Code name: Duchess. Known from Berlin to Bangkok as the world's most dangerous spy. So, for us, this is... How you say? A good get. But not so good for you, Mr. Archer. Because you have information that I want. And this may be an old cliche but... We have ways of making you talk.\n\nThe message below was recovered from Sealab's master computer in 2021. We know that it is a secret transmission between Mr. Reed and Dr. P. Haze. We also know that you know the code to this private key to decrypt it. You will give us that code. No games, Archer, 6 characters, A-Z and 0-9 only.\n\nRight Click, Save As... Encrypted Message\nMD5 checksum 81EBBB5BBEC7049980850F84957E060E\n\nRight Click, Save As... Private Key\nMD5 checksum 01C257F8955C360196235EFDE6097E77\n"}, {"name": "Undocumented Outrage", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crack/Undocumented_Outrage/Crack200-2.docx"], "desc": "There's a lot to like about where I live. There's beautiful wilderness. You're never more than thirty feet from a tavern, bank, and fast food restaurant. And thanks to the university there are some unique opportunities. When I was in high school I started learning Russian. My choices were French, German, Spanish, or Russian. Most school districts in the USA only offer the first three, if they have any foreign language programs at all. I picked Russian because I thought it would be the hardest and I am a total fool. But I stuck with it. I was determined to learn and Госпожа Демовидова was determined to teach me. I ended up taking it longer than I technically had to. Two years in high school and four years in university.\n\nAnyway, there's plenty to dislike about where I live, too. Like the cold. I realize that many of you might be from cold climates, but I'm taking cold. As in below zero for many weeks most years. So cold that if you throw a cup of water in the air it will be frozen solid by the time it hits the ground. So cold that if you take some rolls right out of the oven they'll be delicious and hot. Set them near an open window to cool and they will be cold in seconds. And no one likes cold rolls. Cold rolls steal all the joy warm bread brings.\n\nI suppose I'm rambling enough. We should probably get to the challenge. Here's an encrypted doc file. I seem to have forgotten the password, but I'm sure you'll find it as long as you can stay cool under pressure.\n\nRight Click, Save As... Пока железо холодное, куй\nMD5 checksum 4AAC3FAF34C758C5B4351D187F0475E3\n"}], "crypto": [{"name": "A Question of Perspective", "desc": "You have been hired by a tech company to assess the security of thier quantum communication system. The system uses the BB84 protocol for key distribution. During your assessment, you've intercepted some qubits and their bases during an exchange between Alice and Bob, but some of Bob's measurements are incorrect at every third qubit due to an eavesdropping scenario. Since this is a new system still in testing, the seed space is restricted to positive integers between 1 and 100.\n\nQubits = [0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1]\n\nBases = ['R', 'R', 'D', 'R', 'R', 'R', 'R', 'R', 'D', 'R', 'R', 'R', 'R', 'R', 'R', 'R', 'D', 'R', 'D', 'D', 'R', 'R', 'D', 'D', 'D', 'R', 'R', 'D', 'R', 'R', 'D', 'R', 'D', 'D', 'D', 'R', 'D', 'R', 'D', 'R', 'D', 'D', 'R', 'R', 'R', 'R', 'D', 'R', 'R', 'R', 'D', 'D', 'D', 'D', 'R', 'D', 'D', 'R', 'D', 'R', 'R', 'R', 'R', 'D', 'D', 'D', 'R', 'D', 'R', 'R', 'R', 'D', 'D', 'D', 'R', 'R', 'D', 'R', 'D', 'D']\n\nMeasurements = [0, 1, ?, 1, 0, ?, 1, 1, ?, 0, 1, ?, 0, 1, ?, 0, 1, ?, 1, 0, ?, 1, 0, ?, 0, 1, ?, 0, 1, ?, 1, 0, ?, 0, 0, ?, 0, 1, ?, 0, 1, ?, 1, 1, ?, 1, 0, ?, 1, 0, ?, 0, 1, ?, 0, 1, ?, 0, 1, ?, 1, 0, ?, 1, 0, ?, 0, 1, ?, 0, 0, ?, 0, 1, ?, 1, 1, ?, 1, 1]\n\nEncrypted Message = [0x23, 0x59, 0x86, 0x1e, 0x60, 0xcf, 0xdc, 0x4e, 0x6a, 0x0b, 0x0c, 0x50, 0xd4, 0x5a, 0x71, 0x87, 0xdb, 0x0c, 0x46, 0x1d, 0x63, 0x44, 0xba, 0x5e, 0x37, 0xd3, 0x9a, 0x4b, 0x77, 0x4b, 0x3d, 0x4b]\n"}, {"name": "Everyones Friend", "desc": "iykyk, amirite? rsa af. gl, hf. poctf2024.\n\np = 61\nq = 53\nn = 3233\ne = 17\nc = 264,889,119,374,559,357,870,453,4ce,264,77,a5d,87a,170,77,87a,b5a,a5d,119,87a,87a,b5a,2b2,170,96c,70a,77,7aa,870,b5a,6ed,170,5ec\n"}, {"name": "For All the World to See", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crypto/For_All_the_World_to_See/Crypto100-3"], "desc": "In an ancient Babylonian city, archaeologists are busy working to uncover an ancient palace complex. Along the way they discover a stone outhouse. Curiously, the two-seats are adorned with carved figures that could be some form of language, and the base has several lines of similar figures. I have provided a copy of the sketches taken by those present for the discovery. At the bottom of the outhouse they uncover an ancient VeraCrypt container, which no doubt holds the secrets of the former inhabitant of this ancient palace.\n\nRight Click, Save As... An Ancient VeraCrypt Container\nMD5 checksum E090EAC2DC961FBE98CAC79431AAD6C3\n"}, {"name": "Knuckle Buster", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crypto/Knuckle_Buster/Crypto200-1_flag.txt.enc"], "desc": "In this challenge, two individuals—Alice and Bob—are communicating in secret. They use the Diffie-Hellman key exchange protocol to protect their communication. I will provide you with enough information to decrypt a message intercepted between them. All you need to do is calculate the shared secret and decrypt it to get the flag.\n\nHere is the encrypted flag. It was encrypted using AES-256-CBC, with SHA-256 for key derivation and a prepended 16 byte IV.\n\npublicA\n-----BEGIN PUBLIC KEY-----\nMIGaMFMGCSqGSIb3DQEDATBGAkEAiBB/FlC3W8aPLJxYGXzKsnpEmPKIKR4JetlA1ky+TKTYofXUKSFucGxtrmWlVFjnLZUqJFjj0bVDKSiYOfod1wIBAgNDAAJAN3YrjXtIssyugO9tQ3BRy2TN92Qkhkp/VP5zfLEMQg1AE/YofkCIc/KSZOBpuroiQoCK0qTNkD4HzCzDa7ap5Q==\n-----END PUBLIC KEY-----\n\nprivateB\n-----BEGIN PRIVATE KEY-----\nMIGcAgEAMFMGCSqGSIb3DQEDATBGAkEAiBB/FlC3W8aPLJxYGXzKsnpEmPKIKR4JetlA1ky+TKTYofXUKSFucGxtrmWlVFjnLZUqJFjj0bVDKSiYOfod1wIBAgRCAkBSsgvp3xivPK6Wp2X+SIjGllg1MT4zJdEoyUjV6iDLGytdeLpokYOO6xsGIiVb8b6A/5onnopra2iXBb0dS5rn\n-----END PRIVATE KEY-----\n\ndhparam\n-----BEGIN DH PARAMETERS-----\nMEYCQQCIEH8WULdbxo8snFgZfMqyekSY8ogpHgl62UDWTL5MpNih9dQpIW5wbG2uZaVUWOctlSokWOPRtUMpKJg5+h3XAgEC\n-----END DH PARAMETERS-----\n\nRight Click, Save As.... Encrypted Flag\n"}, {"name": "Overall a Flop", "desc": "In this challenge, you are given an ECC public key and an encrypted message. The encryption was done using a weak ECC private key, and your task is to break the encryption by recovering the private key and decrypting the message. The parameters of the elliptic curve used are also provided to assist you in your task.\n\nname: secp256r1\nkey_size: 256\n\n-----BEGIN PUBLIC KEY-----\nMFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEgDCfhbX0SZnIrsFjH+7pCD65Fi7E\netLPQEmkdmDYMJ2hvXIdGvqNtf4b78vCI6tElddaCw+21+IRiOevSS4G3g==\n-----END PUBLIC KEY-----\n\nc: 8a258a3a8a368a218a338a2e8a208a228a268a258a0a8a238a618a648a398a0a8a658a338a0a8a648a328a3b8a658a278a618a3b8a368a668a28\n"}, {"name": "Put Down Thy Wrath", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crypto/Put_Down_Thy_Wrath/Crypto300-3_homomorphic_encryption.py"], "desc": "In this challenge, you are given a public key and an encrypted message that was encrypted using a flawed implementation of homomorphic encryption. Your task is to analyze the encryption algorithm, identify its weaknesses, and use them to decrypt the message and reveal the flag. The provided file contains the encryption implementation, and here is the public key and the encrypted message. Good luck!\n\nC:\n79,74,3f,0f,5a,27,21,3a,36,48,64,51,64,0f,79,7e,1a,64,64,03,33,0f,64,64,57,21,27,3f,0f,2c,4a,3a,3f,24,27,3f,0f,7e,64,79,1a,64,2c\n\nPublic Key:\n\nNOTE: A deployment error has rendered this challenge arbitrary. No modifications will be made to this challenge.\n\nRight Click, Save As... Download Homomorphic Function\nMD5 checksum: 4AE1F620789BC30B12B520A8D7B0FB69\n"}, {"name": "Rechance Meeting", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crypto/Rechance_Meeting/Crypto200-2_flag.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crypto/Rechance_Meeting/Crypto200-2_hashfunc.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/crypto/Rechance_Meeting/Crypto200-2_words.txt"], "desc": "Full disclosure... I can't even remember what this challenge was supposed to be about. See, I do development of the contest over the summer, and I also have a lot of other things going on. Mostly birthdays. It seems like almost everyone in my life has a summer birthday. You'd think that there would be an equal chance of any given day being someones birthday, but I'm afraid it just doesn't work that way.\n\nI'm just going to give you the files and hopefully you can figure it out. Looks like I wrote a hash function. And this other thing looks like a word list. I definitely remember putting the flag in the archive. I also definitely remember that the password for the archive was two words from the list mashed together. As in, if the two words on this were \"like\" and \"this\" then the password for the archive is the two of them together \"likethis\"\n\nSo... uh, good luck! I guess!\n\nRight Click, Save As... The Best Hash Function I've Ever Written\nMD5 checksum aec8f43f5049a42abf511111b6db3a94\n\nRight Click, Save As... All of the Words I Know\nMD5 checksum cb411ae1f50b4896bc7809149a9c37dd\n\nRight Click, Save As... Crypto200-2_flag.zip\nMD5 checksum 172a89c93131bbe28113bd13a5af4e40\n"}, {"name": "The Symmetry of Nature", "desc": "Consider these tales of brothers...\n\nYou've probably heard of the constellation Gemini. Most people hear that they're identical twins, but that's actually not true. One, was the son of a mortal, the other the son of Zeus. Can you imagine what it would be like to be Castor, the mortal one? If you guessed they would end up enemies, you'd be wrong.\n\nThere was another set of brothers that went by the same names. I'm speaking, of course, of the award-winning film Face/Off where Castor (played by Nicolas Cage) would be considered the leader of the two, though the brother in that case is definitely the brains of the operation. Both brothers die in that film and it seems to me they were both pretty mortal.\n\n84150717615789492248{688795176222681450_8273783252253178253147624750271202558794588687556525149_25153414179812378489258473}\n\nx-.x-.x-.x\n"}], "forensic": [{"name": "A Flat Circle", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/forensic/A_Flat_Circle/DF100-2.png"], "desc": "Time is a flat circle. Our lives begin on the edge of that disc and we revolve around and around. I hope you like the view from where you're sitting, because you're going to see it again and again. But history doesn't repeat - it only rhymes. Each revolution brings us around to where we were again, except we've moved a bit. We have the experience of the journey, and can see where we were on our last trip around. We can look back out of the circle back to the edge where we began to see the beginnings of others. Our journey from the edge to the center as we orbit it... That's a spiral. A shape we see often in nature. In fact, you probably see it every day. I know I do. As I stand at the sink and watch the water flow around into the dark void of the drain. And so, in essence, we're all circling the drain. Enjoying our trip around and around until we also return to the dark void of the Great Hereafter... We cannot correct our errors. They have already been made. If you choose to leave the world a better place than you came to it, then all you can do is examine those errors. See them for what they really are. Then leave a message for those earlier in their journey. But this is easier said than done. Perspective is difficult to maintain. The truth is often right in front of us, but we miss it because we're blinded by... Pick your poison. Hubris. Fear. Righteousness. Or just the petty distractions we create to avoid the existential crisis that comes, when left alone too long with our thoughts, with the irresistible urge to turn around to look at how quickly we're nearing the edge of the drain and how deep and dark the void really is...\n\nCheck out this cool optical illusion I found!\n\nMD5 checksum 5C210367D7F4AA13C834EC73AE947994\n"}, {"name": "A Record of Events", "desc": "Here's a simple forensics challenge for you. An old flash drive that was lost on the streets near campus one day. I intended to find the owner and return it, but unfortunately I couldn't work out exactly who it belonged to. It hadn't been connected to any campus computers, so that was a dead end. Seems like it might have belonged to one of the missionaries we get on campus sometimes but that doesn't narrow it down much. So I set it in my safe with the intention of taking it to the lost and found, but I forgot about it for about twenty years instead. I only found it again when I was cleaning out my safe. I suppose it's time to dispose of it, but let's throw a challenge on here before we send it to the great by-and-by.\n\nDownload... DF100-1\nMD5 checksum D5D26D43D20BB67D4D52F539D179F6EE\n\nhttps://uwspedu-my.sharepoint.com/:u:/g/personal/cjohnson_uwsp_edu/EZ8KXiGBIGxOrN1lhymI81gB2CaRXdaL2vOkySuzvIcz3Q?e=XjHifH\n\n"}, {"name": "Daily Doses", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/forensic/Daily_Doses/DF300-2.pcap.xz"], "desc": "You know what I find most frustrating about digital forensic work? The attention to detail. It never fails that I look over a piece of evidence again and again and still somehow miss something. Well, this challenge is more of a test of your powers of detection than your technical acumen. Still, this is exactly the kind of thing I've missed over and over again. Most people miss the forest for the trees. Some people miss the trees for the forest.\n\nRight Click, Save As... DF300-2.pcap\nMD5 checksum e45708991b2fd69adfc6b415a4decbed\n"}, {"name": "Hooper Hollar", "desc": "Learning memory forensics, as I recall, was a painful process. Not because it was difficult, but because when it was difficult it was very difficult, and when it wasn't it was very easy. I'd find myself over-thinking things a lot. Mapping out memory and taking copious notes when the truth was right there for the taking if I'd just thought to look before diving in.\n\nRight Click, Save As... If You Don't, Remember Me\nMD5 checksum CE7C8C5609F34561860CEFA19F87DCDE\n\nhttps://uwspedu-my.sharepoint.com/:u:/g/personal/cjohnson_uwsp_edu/EU0BFDviyvRPjVo5KIRfamYBA0ipJHNOYF3k6A5elJWfHA?e=pBwhsn\n\n"}, {"name": "Im a Stranger Here Myself", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/forensic/Im_a_Stranger_Here_Myself/DF300-3.pcap.xz"], "desc": "I was inspired to create this challenge after a real case I worked. In my experience, actual steganography is pretty rare and typically signifies a subject with advanced domain competency in counter-forensics. Most subjects will use encryption or basic obfuscation because you get similar results with less hassle. Only the most sensitive of evidence and most paranoid of subjects encrypt and hide their data.\n\nI was contacted to reexamine evidence in a criminal case. It was an alleged criminal conspiracy with multiple subjects. Five, to be exact, and it was suspected that there was a sixth. The only problem was that there was no solid evidence directly linking this sixth member to the conspiracy. I took a look and discovered a situation that is crudely reproduced in this challenge.\n\nNOTE: The flag for this challenge uses a '1' in place of both the 'i' and 'l' characters. You can submit the flag as found, or using the character set in the rules. Either will be accepted.\n\nRight Click, Save As... DF300 Pcap\n"}, {"name": "Known Unknowns", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/forensic/Known_Unknowns/DF200-2.wav.xz"], "desc": "So, I was laying in an open field with my super sensitive directional mic, trying to listen to stars like I do every Saturday night. You know, normal stuff. It was going fine and I was jamming out to the sounds of Saturn when I hear this sound coming through. I'm guessing it's the sound of swamp gas reflecting off Jupiter.\n\nRight Click, Save As... Alien Rock and Roll\nMD5 checksum: D6DC86EF24773511E55F9CA167D47C7E\n"}], "misc": [{"name": "A Coward Dies Twice", "desc": "This challenge involves an anagram. Arrange the letters from the string below to assemble the flag.\n\nA Denk Rotton Hate\n\nHints: The flag is the name of a poem. There are four words in the flag's quote. No words use the same letter twice. No words have more than five letters and no fewer than three letters. The first word is \"the.\"\n\nConvert each word in the phrase to leetspeak and insert it into the flag format:\npoctf{uwsp_7h3_ _ _ }\n"}, {"name": "Anything Worth Doing Wrong", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/misc/Anything_Worth_Doing_Wrong/Misc200-3.png"], "desc": "Autumn in the Midwest USA brings about many strange traditions. Hay wagon rides, corn husk dolls, numerous inedible gourds strewn about the place (I assume to ward off ghosts), and let's not forget the corn field maze. Well, it may not be corn, but here's a maze for you to solve while I try to find out where all these gourd are coming from before they take over. They're like tribbles. It's insane.\n\nNOTE: Your solution will produce a phrase using normal English words. You will need to format it as a flag before you submit it per the rules on flag formats on the contest website.\n\nMD5 checksum 891D3E4FE45F8B299F5F45803EB7CA26\n"}, {"name": "Beneath the Pea Beneath the Pillow", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/misc/Beneath_the_Pea_Beneath_the_Pillow/Misc300-2.png"], "desc": "As a kid in school we used to do something called \"study hall\" where you basically sat in the auditorium for an hour doing homework or whatever. I used to intentionally fail a course every year so I could test out of it within the first two weeks of the following semester and get an extra hour of study hall. Weird policy, I know, but I did it every year from middle school to the end of high school.\n\nWell, that gave me plenty of time to sit there quietly reading or whatever, but mostly just staring off into space. The auditorium walls were brick, and I spent a lot of time just looking at them letting my imagination run wild. Eventually I devised ways to spell out secret messages using them. For example, see below. Don't forget to convert to leetspeak using the alphabet in the rules!\n\nMD5 checksum 2e838ce450d3ca850b28d4b48f0f3931\n"}, {"name": "Could It Be the Winter", "desc": "An easy level challenge... How about a couple simple little logic puzzles? Here are twelve problems. Their solutions should all be in hexadecimal format. I'm sure you know what to do from there, right? Good!\n\n1. 0x67, 0x70, 0x73, 0x76, ___\n\n2. 48 = ___\n\n3. 80, 85, 96, 101, 112, ___\n\n4. Let f(x) = 2*x^2 + 3*x - 5 and g(x) = (x + 4) / (x + 5) and solve for: f(g(20)) + 10 * ((e^3 - 20) / 3) + 95 = ___ Where: e is 2.718.\n\n5. 0x64 + 15 = ___\n\n6. 41, 0x38, 69, 0x50, 89, 0x60, 101, ___\n\n7. f(x)=(x*2)+10 x=___ where f=114\n\n8. 1, 17, 33, ___\n\n9. Asset Value = $50,000, Exposure Factor = 60%, ARO = 0.0036667, ALE = ___\n\n10. 17, 19, 23, 29, 31, ___\n\n11. min(max(0.3*100+0.3*50+10,0.1*150+1.0*50+47))\n\n12. MTTC = {40, 28, 35, 42, 30}\n\nNOTE: The solution will produce the flag in the form of an English quote or phrase using the alphabet in the rules for flags. If your solution produces a choice of characters, the correct answer is the one that is part of the character set, or completes the proper phrase.\n\npoctf{uwsp_[01][02][03][04][05][06][07][08][08][04][09][02][10][04][11][07][12][12]}\n"}, {"name": "Embrace the Suck", "desc": "💁‍♀️ Lily: so… ignoring me this weekend huh 👀\n🧑‍💻 Ben: what? nooo lol. just got this big ctf thing, super hyped for it 😅\n💁‍♀️ Lily: right. the *ctf*. didn’t know i was competing w ur hacker obsession 🙄\n🧑‍💻 Ben: it’s literally just a weekend. chill. i’ll text u, keep u updated n stuff\n💁‍♀️ Lily: “updated” so i get like... play-by-plays? 🥱 “flag captured,” “firewall bypassed”? thrilling.\n🧑‍💻 Ben: lmaoo stoppp 😂 ok how bout this: i’ll send u clues. lil secrets\n💁‍♀️ Lily: ok now ur talking. spill 👀\n🧑‍💻 Ben: alright, first one: *hub 0bbv1 cw hub jr0n*. see if u can crack it 😏\n💁‍♀️ Lily: …is that supposed to mean something to me?? 😑 or just some nerd code to keep me quiet while ur off “capturing flags” or whatever\n🧑‍💻 Ben: idk maybe it does 😏 or maybe i just know u hate unsolved mysteries\n💁‍♀️ Lily: omg. yeah, maybe u just don’t wanna talk to me 😒 mystery solved\n🧑‍💻 Ben: c’mon don’t be like that 😅 it’s one weekend. i’ll text u, drop hints, keep u close\n💁‍♀️ Lily: u better. bc if all i get is “hub 0bbv1” and zero actual texts, i’m taking my “flag” somewhere else 😈\n🧑‍💻 Ben: haha chillll. u know ur the only flag i’m tryna capture ❤️ gimme a lil luck?\n💁‍♀️ Lily: whatever. good luck w ur nerd stuff 🖤 just remember who’s actually running the game 👋\n"}, {"name": "I Never Knew Glory", "desc": "A famous phrase from a famous play,\nSpoken before the Franco-fray,\nFive words that stir the English heart,\nTo make the soldiers play their part.\n\nPart one of third of Harry Five\nThe very first words of kingly drive\nDear friends, once more - you've gone too far\nBeyond Harfleur is where you are\n\nHumble words to leet of speak\nThen claim the flag and don't be meek\nCelebrate your grasp and reach\nOf once more, dear friends, unto the breach\n\npoctf{uwsp_ _ _ _ _ }\n"}, {"name": "My Name is Human", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/misc/My_Name_is_Human/Misc200-1.png"], "desc": "poctf{uwsp_[8][6][3]_[5][7][1][2][4]}\n"}, {"name": "My Synthetic Friend", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/misc/My_Synthetic_Friend/Misc400.png"], "desc": "If you played in last year's contest, you might recall that there was one challenge that was infamously difficult. Just a real pain to solve. The kind that makes you just want to give up and go home. It was awful for everyone involved.\n\nSo, let's do that again!\n\nThe cipher text below is triple encrypted. I will give you clues on each step, and you will need to work out the puzzle to move on. The problem is that you'll only get the next ciphertext and won't know if you've made a mistake along the way until you get to the end!\n\nMy last step is your first. You'll need the grid below, and hang onto it because you'll need it again later. And no cheating. I have a real problem with cheating because my brother used to lie when we played Battleship and I'd be sitting there calling out hits and he'd be like, \"No, dude, that's a miss\" and it's like COME ON but you can't look to see if he's lying because then YOU'RE the cheater!!\n\nCiphertext: poctf{uwsp_ABDA_BDDADDBEBEABDABE_EEDEEB_EAEDBEBDDEEB}\n\nWe pass by each other on the second step. Now you get to make your own grid! One thing you might notice about ciphers is that a lot of them, historically, were devised by brilliant people in administrative positions. After all, no one needs to keep secrets more than power-brokers. This one is no different. This method was developed by a master of diplomacy and strategy that navigated the complex world of court politics with ease, often serving as the voice of authority behind the throne. His talent for administration and negotiation earned him wealth and prestige, though his success bred many enemies. Despite his brilliance, his fortunes were tied to the favor of the ruler he served. When the tides of power shifted, his downfall was as swift as his rise. His legacy remains one of both extraordinary achievement and the fragility of influence in the volatile arena of royal politics. Oh, and you'll need a key for this one. It's a single word and your clue is 🕛 + 🍽️\n\nMy first step is your last and.... Wait... This can't be right. MORE grids? That doesn't make sense. How many grid ciphers could there possibly be?? Hmm... Oh, ok this one also has transposition. So we get a little of that flavor, too. Well, you know who else, historically, has created lots of ciphers? Nerds. Nerds working for the military, generally. Geniuses, really, and like all geniuses they are rarely appreciated in their time. The developer of this cipher faced his share of criticism in his day, but is now well-regarded as one of the great code-breakers that bridge the gap between classical and modern methods. To solve this, you'll need some letters from a number... Just a second my random number generator in my brain is running... Ok, I am thinking of a number. If you double it and subtract 15, you get 31.\n\nThat should be it. If you made it this far you should have the flag.\n"}, {"name": "The Hollow Howl of Foreign Winds", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/misc/The_Hollow_Howl_of_Foreign_Winds/Misc300-1.png"], "desc": "Business is not my forte. I can't even say the letters MBA in succession without drifting off half-way through. In my experience, business is for Important People doing Important Things because they are Important. A lot of talk, a lot of taking people's useful work and ruining it with efficiencies and bureaucracies, and not a lot of actually doing. And the jargon... How can anyone talk so much and say so little? And that's coming from someone in academia, where talking for the sake of talking is a competitive event!\n\nThat said, I do have respect for people that are shrewd in business. You have to be smart to work the system and get everyone pulling the same direction.\n\nYou might be asking how I reconcile this cognitive dissonance? Well, if you look at the chart below, you'll see how at the end of the day, it's all about creating synergistic alignment to leverage our core competencies and maximize ROI. We need to circle back on the low-hanging fruit and figure out how to move the needle while we take this offline to ensure we're not boiling the ocean. It's critical to peel back the onion and drill down into the granular details to optimize our operational workflow and streamline efficiencies. We must embrace blue-sky thinking that positions us as thought leaders in our industry. Before we reinvent the wheel, let's ensure we're not creating analysis paralysis, because the goal is to achieve paradigm-shifting outcomes with a focus on value-added deliverables. By maintaining laser focus on our strategic imperatives, we can drive engagement, create stakeholder buy-in, and ensure the right people are in the right seats. Let's keep our north star in mind and ensure we're future-proofing with a proactive, rather than reactive, mindset to ensure we have the bandwidth to pivot when the goalposts shift.\n\nMD5 checksum 6EDCBFF31225FDBC9348948325D00C8F\n"}], "osint": [{"name": "A Tangle a Jingle", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/A_Tangle_a_Jingle/OSINT200-2.webp", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/A_Tangle_a_Jingle/OSINT200-2_flag.zip"], "desc": "Sometimes I like to try to find the exact location where a photo was taken. A little OSINT exercise I do sometimes to keep my skills sharp. This image was posted to a social media platform last year. I was able to find where it was taken, and if you can too then you will see that there is a business just out of frame, across the street from the building on the corner, to the left of the bollards. The phone number on their sign is the password to the archive (no spaces or special characters.)\n\nRight Click, Save As... A Little to the Left\nAlternate Link OSINT200-2\n"}, {"name": "Down Like This", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Down_Like_This/OSINT300-2.jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Down_Like_This/OSINT300-2_flag.zip"], "desc": "You ever look around at the things you see every day, and think about how what is mundane for you would be novel and interesting for others? Take the following image, for example.\n\nA perfectly normal street in a perfectly mundane place for many people, but when I look at it, I see all these little details that cause it to differ from my own version of mundane. The script, the bikes left unsecured near what looks to be an ATM in broad view of the sidewalk (unlike the one next to it with a privacy screen), the format of the telephone numbers, and on and on... It looks exactly like scenes I have viewed many times, and in fact it is a place much like those places I've been. But it's those subtle differences - exotic spices on a familiar food.\n\nThe really incredible thing about living in our time is that we don't have to travel to see these things. We can go to a map and drop the little dude on the blue line and take a look around at (most) places in the world. But that's not it - we can not just see a place, but we can sometimes go back in time. See it how it was years ago.\n\nIf we went to this place, for example, we might see the comings and goings of people throughout time. Let's pay a little more attention to that. At one point, there was a white van parked on the street in front of this location. The license plate is obviously blurred, but the fax number on the back is not. That is your target. The archive below contains the flag. The password for this archive is the fax number on the back of the van parked in front of this location. Do not include spaces or special characters - just the numbers and all of the numbers you see there.\n\nRight Click, Save As... OSINT300-2.zip\nMD5 checksum 7137DDF0E8D4F33FF4CF568D2BCF052A\n"}, {"name": "Grifting Lonesome Widowers", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Grifting_Lonesome_Widowers/OSINT200-3.png"], "desc": "You don't get to where I am without making a few enemies. I've had to climb over a lot of heads to reach the mountaintop. I'm referring, of course, to my 2021 win at the $2,500 No-Limit Deuce to Seven Draw Tournament at the World Series of Poker in Vegas. So yeah, I'm pretty good at poker.\n\nWell, when people can't take you down a peg or two at the table, they're going to try to get you another way. That's me, though. It's the only way they'll get me, because I know when to hold'em and when to fold'em. So I wasn't surprised when I saw this message posted at me. No idea who this person is, but this pic is from the last 4th of July BBQ. That's me and the missus right there.\n\nTo be honest, I don't remember much about this day after this picture was taken. The Tito's was a-flowing and I had a couple-three mocktails on top of that. All I know is I checked my camera roll the next morning, and let's just say if there's even a chance that this person has any of the other pics then I'm scared. They might be airballing, but I can't go all in on that.\n\nGet out there and prove this donkey's just clicking buttons with this bluff.\n\nNOTE: Photo credit goes to David LaChapelle Recollections in America. CBIR will not help you.\n"}, {"name": "Intimidation by Ecolocation", "desc": "You objective for this challenge will be in three parts.\n\nPart 1 - Find the user. Do not contact anyone regarding this challenge, as there may be legitimate users with this moniker (unlikely though that may be.) The account used in the challenge is not monitored, so you'll get no help anyway. The username is 0tYGJH2E\n\nPart 2 - Find the location of the flag. You'll need to find the right URL.\n\nPart 3 - Find the password to access the flag by finding the location indicated in the image. There is a sign at the place indicated by the arrow, and those words are the password (no spaces or special characters.) For example, if the sign reads, \"Employee Parking Only\" then your password is \"EmployeeParkingOnly\"\n"}, {"name": "Not All Secrets Are Exciting", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Not_All_Secrets_Are_Exciting/OSINT300-3", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Not_All_Secrets_Are_Exciting/OSINT300-3_1.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Not_All_Secrets_Are_Exciting/OSINT300-3_2.jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Not_All_Secrets_Are_Exciting/OSINT300-3_3.jpg"], "desc": "Wasn't last year's multi-part OSINT challenge a blast? Let's do that again! Attached to this challenge is a VeraCrypt container. The password for this container is in three parts and you're going to need to do some searching to assemble them.\n\nLet's start with this one. The first part of the password is the full name of the cat. Make sure it's capitalized to put some respect on it.\n\nAdd a dash (-) to separate the next part, which is the last name of the artist that makes these awesome sculptures. Make sure it's capitalized to put some respect on it.\n\nAdd a dash (-) to separate the next part, which is the street number and five-digit zip code of the building where this picture was taken. For example, if the address is 1234 Main St. Nowhere, US 54321-4321 the solution would be 123454321.\n\nRight Click, Save As... Capitalized To Put Some Respect On It\nMD5 checksum: F2FFA49768EA2D4F6A1FAB9852F1648D\n"}, {"name": "Novel Means of Lying", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Novel_Means_of_Lying/OSINT100-2.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Novel_Means_of_Lying/OSINT100-2.zip"], "desc": "It's nearly Halloween (for those countries that celebrate it.) Naturally, I'm also a bit of a fan of the horror genre so this is a great time of year for me. In this challenge, I'd like for you to track down a series of people that seem to have a similar fascination. It will require multiple steps.\n\nFirst, reverse the distortion on this image. Find out who these people are, and what they have in common.\n\nThis month (October 2024) was a very special anniversary. They even held a modest event to commemorate it with a keynote presentation.\n\nIt looks incredibly interesting! The password for the archive that contains the flag is the work phone number of the speaker exactly as you find it (special characters and all.)\n\nRight Click, Save As... OSINT100-2.zip\nMD5 checksum 4082504430A19F02E9496A4ACB017D56\n"}, {"name": "Seen and Then Forgotten", "desc": "I really had to commit to pull this one off. That's right - your subject on this one is me, Prof. Johnson. However, I'd really rather not have all of you phish my dentist for my patient records and such, so I'll tell you that your trail starts on Discord and you will find the flag out on the public Internet - no stalking, social engineering, or blackmail required! That's good news for both of us! Mostly me!\n"}, {"name": "Something to Say About It", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Something_to_Say_About_It/OSINT200-1_first.jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Something_to_Say_About_It/OSINT200-1_flag.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Something_to_Say_About_It/OSINT200-1_second.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Something_to_Say_About_It/OSINT200-1_third.png"], "desc": "I have a dynamite idea! Let's go on a little snake hunt. Now, where do you find snakes? That's right, in snake pits! How do you find snake pits? By following the clearly marked signs to the designated snake dumping pit locations, of course! Surely you've seen those around your city, right? They probably look a little like this one:\n\nI'll even give you a little help by zooming out a little. You're not xanthophobic, are you?\n\nYou know, while we're here, I'm going to grab a fresh password for the archive that contains the flag. As a memento to remember our hunting expedition. The phone number on the sign back there should do. Numbers only, no parenthesis, no spaces, no dashes.\n\nRight Click, Save As... There's a Snake In My Boot\nMD5 checksum B0752B12B005DC132CA4BA2C90F06629\n"}, {"name": "Who Can It Be Now", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/osint/Who_Can_It_Be_Now/OSINT100-1.jpg"], "desc": "A trip through time through the power of open-source intelligence! Start by finding the location in this image:\n\nBoy, I bet it's changed a lot in a century or so. You should find out. If you do, you'll see a business on the corner with a rustic chic style. Convert the words on the awning closest to the intersection into a flag using the alphabet in the rules and accept your daily bread. (i.e. poctf{uwsp_ _ _ })\n"}], "pwn": [{"name": "A Finer Token Never Was", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/A_Finer_Token_Never_Was/Exploit100-1", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/A_Finer_Token_Never_Was/Exploit100-1.c"], "desc": "Here's a simple exploit challenge for you. There's a little bit of a twist to make sure it's not too easy, but it's otherwise a straight-forward challenge.\n\nHere's your target: 35.184.182.18 32002\n\nRight Click, Save As... Source Code\nMD5 checksum: F164C0EEFEEF937BB3DE95195963D5EF\n\nRight Click, Save As... Exploit100-1\nMD5 checksum: 9F8B157B7DC0EED10A60E66E84B6529F\n"}, {"name": "Empress of What", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Empress_of_What/Exploit300-1"], "desc": "The first time I successfully built a ROP chain, I thought the guy teaching me was a wizard. It felt like Prometheus personally delivering fire to light up the room. I'm not sure why. Something about it is just so cool to me. Taking little bits and pieces and assembling your own narrative. It opened up a whole new world of possibilities. It's something I'm glad I get to share with my students every year, and something I'm glad I get to share with you now. Enjoy.\n\nYour target is 34.123.210.162 on port 32006\n\nRight Click, Save As... Let's Just Say I'm Empressed\nMD5 checksum f892b3d740d4e1584387228b8f005569\n"}, {"name": "Heroes and Zeros", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Heroes_and_Zeros/Exploit100-2.bin.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Heroes_and_Zeros/Exploit100-2.exe.xz"], "desc": "The Professor needs to power up before the evil Raucus Ruckus comes to Earth with his army of slimeballs! Help The Professor fill up his magic meter to prepare for the final confrontation with the forces of evil!\n\nThe Professor needs 10,000 power points or Earth is doomed, but be careful as his magic meter will slowly drain without your help! Don't worry - you can save your progress and come back to finish later!\n\nDownload... Pointer Clicker (Win x86_64)\nMD5 Checksum: C4DC2DD4ACD48E1D8CB7C2E72C3CAB23\n\nRight Click, Save As... Pointer Clicker (Linux x86_64)\nMD5 Checksum: 13E04A3B14064BE40B07173DE5DF89B7\nNOTE: Linux version seems to be buggy, but functional for the purposes of the challenge.\n"}, {"name": "Imperfect Impermanent and Incomplete", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Imperfect_Impermanent_and_Incomplete/Exploit400.c"], "desc": "All things in this universe are imperfect, impermanent, and incomplete. It's what makes many jobs necessary, including cybersecurity. Anything ever created has flaws and all things degrade, erode, and become obsolete. Our job is to patch the holes. Find the bugs. Stand watch. Clean up the mess. Tend the fire. It's a job that is endless and often thankless. I've known a lot of colleagues that got overwhelmed by it. The constant vigilance and need to absorb yourself in cybersecurity news and learning on a daily basis causes stress until they burn out.\n\nWell, I've developed a little helper. I call itt Secret-Keeper! A program that those people can interact with for therapeutic purposes. The perfect secret-keeper that will take those stressful thoughts and store them away forever. Give it a try, but please keep in mind that it is also imperfect, impermanent, and incomplete. You might need to stumble through a learning curve.\n\nYour target is 35.184.182.18 on port 32005\n\nldd (Ubuntu GLIBC 2.39-0ubuntu8.3) 2.39\ngcc -o /usr/bin/Exploit400 /Exploit400.c\nRight Click, Save As... Source Code\nMD5 checksum 319BF904162A1A87CF46AB38919F1831\n"}, {"name": "Make of It What You Will", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Make_of_It_What_You_Will/Exploit200-3_clean"], "desc": "When I was first introduced to the subject of software exploits, it always amazed me how just one tiny little mistake could lead to complete disaster. Honestly, it killed any desire I might have had to become a software engineer. Luckily for me that this morbid curiosity contributed to my future career.\n\nAs a cybersecurity professional, I'd occasionally hear colleagues talk down about programmers writing spaghetti code and not understanding secure coding practices. I feel this is the wrong attitude. The truth is that anyone can make a mistake and no one can know everything.\n\nLet's also take a moment to appreciate just how hard of a job it is to write something functional for the 200lbs hyper-primate dumbly pushing buttons on the other end. Sometimes it seems like some users will go out of their way to provide some insane edge-case input. Ask them to enter a letter? You get a number. Or space. Or ?. Or two letters. Or an order for 50 bags of concrete. Or \u0093, \u0087, or the dreaded  (apologies for the foul language.) Or 50,000 words of copypasta. Or a Ж.\n\nLuckily we are all super-sophisticated and extra cool cybersecurity professional people, so we're way too smart for that.\n\nYour target: 35.184.182.18 on port 32004\n\nRight Click, Save As... Sanitized For Your Protection\nMD5 checksum 99E81FAA1A45745D3FA4B9B9644FBC62\n"}, {"name": "Overrun and Outdone", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Overrun_and_Outdone/Exploit200-1_source.txt"], "desc": "Ohayoooo, Hacker-senpai!! Welcome to the ultimate kawaii exploit challenge, \"Senpai's Secret Debug Mode\"! It appears that Senpai has hidden some special privileges for their \"super-duper admin\" friends, and you must figure out how to access them! (^▽^)\n\nBut, alas, the debug mode is locked for guests, and the admin account is \"totally locked, desu~!\" Will you be able to find a way to bypass the restrictions and open a bash shell? You are not a super-duper admin by default, but with your 1337 skills, maybe you can convince the program otherwise! (≧ω≦)\n\nTarget IP: 35.184.182.18\nTarget Port: 32001\nRight Click, Save As... Source Code\nMD5 checksum: 9B1B735170D78CCBAE64B90419BE9C0F\n\nGood luck, Hacker-senpai! ٩(◕‿◕｡)۶\n"}, {"name": "Smack Stashing", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Smack_Stashing/Exploit100-3", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Smack_Stashing/Exploit100-3.c"], "desc": "This challenge is near to my heart. Picture this: It's the mid-90s. I'm a teenager and my mother just bought us a Packard-Bell and I am just enamored. It ran Windows 3.1 and was already an outdated model, but I didn't care (or know the difference, to be honest.) I'm trolling fools on Compu-Serve, I'm reading the newsgroups, I'm making crude pictures in Corel Draw. I get into learning everything I possibly can about the world because now it's right there for the taking. I start reading Phrack, and one day there this article in #49 written by Aleph One titled, \"Smashing The Stack For Fun And Profit\"\n\nNow, I was in Junior High School and I was just taking my very first BASIC programming class. I had accidentally set a BIOS password on the Packard-Bell and I had to read the manual to pull the jumper to wipe it. That was the full extent of my experience with these subjects. But when I read that article, it gave me a hint of another world. Well, I just had to try it.\n\nI'm sure if you're reading this then you know all about this topic, and you've probably already done this exploit many times, but I'm going to include this challenge for nostalgia's sake. Here we have a faithful reproduction of the code I wrote over the week after I read the article. It took me a long time because I had to teach myself C syntax and compiling to do it. It's not much, but I've always had a soft spot for this.\n\nHere's your target: 35.184.182.18 32003 and the target address for the running binary is 0x401162.\n\nRight Click, Save As... Exploit100-3\nMD5 checksum 19917A23A17C69FAD54AED0E54536865\n\nRight Click, Save As... Source Code\nMD5 checksum A2611B6D1B66747CBFEA0BBC8D8A4521\n"}, {"name": "The Trash Heap Has Spoken", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/The_Trash_Heap_Has_Spoken/Exploit300-2"], "desc": "The title of this challenge is a reference to an old TV show. Most participants in this contest are probably a little too young to know it, but that's ok. To be honest, I've never really been one for nostalgia. The show was brilliant for my young self and I remember it fondly, but all things have their time and place. I've always felt bringing old things back from the past just made it feel all the more unremarkable. Like a pale imitation of itself. It doesn't help that far too often nostalgia trips, comebacks, and reboots are little more than cynical cash grabs these days. Once things are done - let them be done, I say.\n\nOn a not completely unrelated note, there is another item from my youth that seems to be ready for a comeback. Oregon Trail. When I was a kid I used to play for hours. Today, with the popularity of open-world survival games, I'd say it's time for an Oregon Trail reboot. In fact, I think I'll work on it myself and make a mint. Here's my first prototype. It's got a long way to go, obviously, but it's never too early to get feedback. One thing I can be sure of - it is 100% secure.\n\nYour target is 34.123.210.162 on port 32017\nldd (Debian GLIBC 2.31-13+deb11u11) 2.31\n\nRight Click, Save As... You've Died of Dysentery\nMD5 checksum b3618c4c8de46a34a75567499a921807\n"}, {"name": "To Finish and Flounder", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/To_Finish_and_Flounder/Exploit200-2.exe.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/To_Finish_and_Flounder/Exploit200-2_key.bin"], "desc": "It might be the company I keep, but I rarely see good old bin patch challenges in CTFs these days. It might be because they tend to be a bit on the simple side, but in my day they were essential skills. It's not much, but is honest work. I'd wake up every morning after the preamble and JMP to wherever the work was that day. I'd PUSH and POP until the cows come home then I'd MOV on to the end of the day until work JLE 0 then NOP out of there and RET home to finally HALT.\n\nHere's a chance for you to give it a try for yourselves. There are other ways to solve this one, sure, but I reckon the easiest way is to just bypass the password request. You'll need the key file to decrypt, and this time you'll be working with a PE instead of an ELF to give the challenge just a little more of that down-home country flavor.\n\nMD5 checksum A214C217EA345C6586C11A62ED4218F4\n\nKey File\nMD5 cucksum 0CEF1FB10F60529028A71F58E54ED07B\n"}, {"name": "Watchful Heavens Waiting", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/pwn/Watchful_Heavens_Waiting/Exploit300-3.iso"], "desc": "This exploit challenge was almost the 400-level challenge, but I swapped it out because I wasn't confident that it was accessible. I'm really curious to see how you do, and if it goes well I might be using a similar setup for my Software Exploit course!\n\nHere's the premise: I'll provide you with a VM. I have created a user called 'ctf', password 'ctf'. And I have placed the flag in the root directory. All you need to do is get to it. To help you with that, this VM has a kernel module that has a couple problems. I've provided you with the source code (I have even notated the problematic statements for you) and Makefile, just so you can see how the sausage was made.\n\nThe module should load when you boot it up, but you can check if its running with lsmod | grep Exploit300-3\n\nISO - Source and Makefile\nMD5 checksum 47DE99ECA0575016C43930791C07F483\n\nQCOW2 Image\nMD5 checksum 777B3F89959F4CC337E115F3C41C7FC8\n\nhttps://uwspedu-my.sharepoint.com/:u:/g/personal/cjohnson_uwsp_edu/EZ9_AapV805DvNvpGSS_PQwBQR_OoanD21C5HcQdhBvymg?e=aRMKAH\n\n"}], "rev": [{"name": "Beef Witted Mushrumps", "desc": "For this challenge, I wanted to do something in the vein of simplified memory operations in a simulated virtual machine, and I ended up with this. The binary here takes in custom bytecode, executes it, and prints the output. It won't look like much if you run it, but that doesn't matter for this type of challenge.\n\nWave 15 update: I've updated the binary. Same operations, but now the program decodes the first five characters of the flag before it halts.\n\nRight Click, Save As... Reverse300-3\nMD5 checksum d67817d4e95cbebe55d741663bf57aa7\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Beef_Witted_Mushrumps/Reverse300-3"]}, {"name": "End of the Line", "desc": "I got into CTFs a long time ago. Despite that, I remember how tough it was. It seemed impossible to solve all of the challenge. Heck, it seemed impossible to solve one. I remember how intimidating it was, but I also remember how amazing it felt to solve my first challenge and submit my first flag.\n\nLooking back, it wasn't a tough challenge, but it was a start. Well, here's your chance. This is a recreation of the very first CTF challenge I solved. If you manage to solve this one, just remember that this is where I started, too.\n\nRight Click, Save As... Reverse100-2\nMD5 checksum 36C41D981AFBF5965FAFBF9ABE4757DC\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/End_of_the_Line/Reverse100-2"]}, {"name": "Forjeskit Sair with Weary Legs", "desc": "Aye, gather aroon, ye codin' minds,\nA challenge waits, its path entwined.\n\"In Forjeskit Sair,\" the whispers say,\nWi' weary legs, ye find yer way.\n\nO, Were My Love Yon Lilac Fair, and I a Bird to Linger There\nMD5 checksum 62664de9b2f04deb59244d495fe4d987\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Forjeskit_Sair_with_Weary_Legs/Reverse400.exe.xz"]}, {"name": "Planned Obsequence", "desc": "In the lower-level RE challenges, I typically leave the flag or an encoded version in the code for participants to extract. This time, I've redacted the flag in the original code. If you look, you'll see it there. But don't worry, the obfuscated flag is there, buried in a variable somewhere. If you want to get it back, find the encoded flag and reverse the encoding process. It's a two-step process before you convert it back to ASCII so you will know if you're on the right track after just a few characters.\n\nRight Click, Save As... Reverse200-1\nMD5 checksum 2A51B3362A4813567E757B57AAC6BE4E\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Planned_Obsequence/Reverse200-1"]}, {"name": "Separating the Firmament", "desc": "I think it's time to mix things up a little bit. This time, I'm going to give you an application that will reveal the flag. All you have to do is guess the right key. Shouldn't be too hard - 22 characters, A-Z, a-z, 0-9, !-*\n\nI know what you're thinking. \"This isn't a crack challenge.\" I know, but I'm out of ideas for challenges and I'm phoning this one in. Just crack the stupid key. Your only other choice is to either decompile and reverse engineer the key (boring), or grab it from the running process when it validates (impossible.) Cracking passwords is way more fun (sigma gigachad move.)\n\nRight Click, Save As... Reverse300-1\nMD5 checksum 139B0E82E45789C704A385726802782E\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Separating_the_Firmament/Reverse300-1"]}, {"name": "Think Different Be Similar", "desc": "Honestly, I thought this one might be too easy for a 300-level challenge, but I ultimately decided to go for it. What we have here is a very simple application that actually does the work for you. When you run it, it will fetch the flag for you and let you know if it succeeded or not. It would, obviously, be much more handy if it actually displayed the flag, but that's just a little technicality for someone with your skills.\n\nRight Click, Save As... Descriptive Derscription\n\nMD5 checksum 935FA5EFF8BF6F7D8D4B0FC52E1D68B1\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Think_Different_Be_Similar/Reverse300-2.exe.xz"]}, {"name": "Understanding Nonsense", "desc": "Oh, boy... Only Wave 2 and I'm already exhausted. Whatever the issue, I just can't be bothered to finish putting this challenge together. Here, this what I have so far. Started working on the decode function and gave up. You go ahead and do the rest and the flag is yours! And if Prof. Johnson asks, tell him this was really well done or I'll get in trouble.\n\nRight Click, Save As... Reverse100-3\nMD5 checksum: 3529E3DBB1BCE1D758A6CF98AB81332A\n\nRight Click, Save As... Reverse100-3 Source Code\nMD5 checksum: 070ACC3692C77BF8B136C4A231A7D1A1\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Understanding_Nonsense/Reverse100-3", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Understanding_Nonsense/Reverse100-3.c"]}, {"name": "We Do It Live", "desc": "You know what I really hate? Challenges where you need to breakdown a function and then script your own solution. Who has time for that?? Anyway, let's do that! Luckily this should be a pretty quick one because I have got so much TV to catch up on.\n\nRight Click, Save As... Reverse200-2\nMD5 checksum 6E47FD3C22AA1FC517EF16A2572381C6\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/We_Do_It_Live/Reverse200-2"]}, {"name": "Well Said but Poorly Heard", "desc": "So there I was, knee deep in wet newspaper, a puppy under each arm, and a lion hovering over me on the back of a giant dragonfly. Only one thing separating me from certain death at the hands of the President of Murder was the Sphinx and its riddle.\n\n\"Ask your riddle, Peptopotamus!\" The puppy under my right arm commanded. Its stone face moved, kicking off ancient dust, turning its glowing eyes to us. It spoke its riddle.\n\n\"True to false and false to true\nWhat you did before, now undone,\nAnd when you're wrong, reverse your sight.\nWhat am I?\"\n\nThe lion laughed, but he did not know what I knew. He did not know that I created the attached program when I was only 18 months old, and not only did I know the answer to his riddle - I was its master. Now, I give the program to you, so you too can be prepared if you find yourself in a similar situation.\n\nSphinx of black onyx, judge my vow.\nMD5 checksum: 97B8F5278456DB0F6F5956FD71D42E7E\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/rev/Well_Said_but_Poorly_Heard/Reverse100-1"]}], "steg": [{"name": "Everything and Nothing", "desc": "Happy end-of-the-year, sigmas! I think by this point of the contest we've weeded out all the betas and are down to only those big dawgs able to hang with the pack. Still, lots of contest left to go and plenty of time to delta out of here before the big gamma burst brings omega.\n\nLet's take this challenge, for example. You have here an image. There are so many places to hide data in images, but hiding data in a greyscale image is actually a lot harder than a color image because you're cutting out all but the luminescence channel and that's a huge reduction in data. The question is, what is grey? Or, more importantly, what appears grey?\n\nMD5 checksum 309eba0a4f350f5fd66c0809234ce473\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/Everything_and_Nothing/Stego300-2.png"]}, {"name": "He Pretends to Be a Boor", "desc": "Oh my god... Have you seen the things Prof. Johnson hsa been saying in Discord? I'm telling you, the guy is losing it. It's getting worse and worse. I would say the pressure of the contest is getting to him, but it actually started way before the contest. I remember during the summer when we were developing the challenges he burst into the lab one day waving this picture in the air and shouting, \"I HAVE IT! DON'T YOU SEE!? IT'S ALL CONNECTED!!\" We tried to get him to explain but he just shoved the doors open called back to us with a, \"IT'S A GAME WITHIN THE GAME!!\"\n\nNOTE: The flag is quite fragile. Make sure your image matches the checksum or it may not be recoverable.\n\nMD5 checksum: CC3F73A1F26BB85C77781D3B8A4D38D6\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/He_Pretends_to_Be_a_Boor/Stego400.jpg"]}, {"name": "Little Things Matter the Most", "desc": "In a world of chaos and clutter, it's often the little things that hold the greatest secrets. Little things also tend to add up. I've always thought of the truth as being like Seurat's A Sunday Afternoon on the Island of La Grande Jatte, where you get only little dots of truth, but if you get enough of them you can back up and see the big picture. I tried to have AI generate my own version of this, but it is unable to come close to the original. I'm not really surprised, and there is a part of me that is glad that, at least for now, the care and creativity of humans is unassailable.\n\nMD5 checksum 309C5245084ED083FEB279E0A72525D6\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/Little_Things_Matter_the_Most/Stego200-2.png.xz"]}, {"name": "Observing Arming", "desc": "You might have heard that I had aspirations of making a movie about the contest. Well, we've managed to create a trailer for it, but it hasn't been going very well. It's hard work! Watching the budget, hiring a competent crew, dealing with writers that all think they're the modern Mark Twain. It's ridiculous. But the worst part - dealing with those actors. They all think they're the center of the universe. They're not. It's not about them... ... ...\n\nIt's about me! I deserve the best lines. I should be on camera about 90% of the movie and there better be a plate of Cheese Nips arranged in four neat little rows with a glass of 8.6oz of 14C water waiting for me at the craft services table, because that is in my contract! You know what? I can't work under these conditions! I'll be in my trailer...\n\nRight Click, Save As... Aliens Riding Horseback Picking Carrots\nMD5 checksum CF9D0A7CE079101A909CE06A6FD653EE\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/Observing_Arming/Stego300-1.mkv.xz"]}, {"name": "Reading Between the Lines", "desc": "Good news, everyone! I've decided it's time to write my memoirs. After a lifetime of interesting experiences, I think it's time the astounding story of my life be recorded for the benefit and advancement of humanity. I can tell everyone about the time that I... Hmm... Ok, maybe my life isn't so interesting after all...\n\n...But it can be! I'm going to throw in a couple interesting details! Give it a little something extra! No one will notice if I embellish a little as long as I don't change it too much. I can always just put a disclaimer on it that its only based on true events - a little transparency is a good thing.\n\nRight Click, Save As... The Astounding Tales of Prof. Johnson\nMD5 checksum 209BC06EB2AC6B37C1A7E58346489CE8\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/Reading_Between_the_Lines/Stego100-2.txt"]}, {"name": "Things Done and Undone", "desc": "You know, I can't help but feel like the Stego challenges have been missing something. Like, it's almost as if several of the challenges contained clues that hinted that a certain method was employed, and then it turns out that they actual indicated some other method. It's honestly starting to bother me. It's like knowing that something is just a little bit off but not being able to identify it. Like there's unfinished business to tend to. I normally wouldn't let something so insignificant bother me, but I just can't leave things undone like this.\n\nMD5 checksum 2876292ECFD2A6C588E356956C519B32\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/Things_Done_and_Undone/Stego200-3.png"]}, {"name": "Things Said and Unsaid", "desc": "So there I was connected to the free McDonald's Wi-Fi hackin' the ISS nav computer as it passed by from orbit and I intercepted a still image from one of the onboard camera feeds. Something about it just seems a little odd, but I can't quite place it... Then again, it might just be my face-blindness acting up!\n\nRemember, this is a Stego challenge. A password will be required to solve the challenge, and that means the password will also be hidden somewhere in the challenge.\n\nMD5 checksum: AB65380D6CA297FE995E368FB4C42ADD\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/Things_Said_and_Unsaid/Stego100-3.jpeg"]}, {"name": "Things Seen and Unseen", "desc": "One of my first jobs in cybersecurity was at a major retailer in the USA. A multi-billion dollar, Fortune 500, international corporation. You'd think a business like that would have all kinds of resources invested in IT, but that wasn't the case.\n\nThe whole company hinged on an inventory system. If it went down the company started treading water immediately. This inventory system was released in 1986 and was written in Cobol. The original programmers were kept on retainer to handle problems when they cropped up, and these people were well in to their golden years.\n\nI used to think about how untenable this was, and wondered to myself about what the company would do when their time finally came. By the time I came around, there were only three of them left, and only two of those had worked on the most important portions of the program. The last one only did code reviews on the least significant bits, and even he was part of the eternal work of maintaining this single program!\n\nI asked DALL-E to whip up a representation of the lengths the company would go through to avoid change. Enjoy!\n\nMD5 checksum: 010DE000B3998A602B82E38AEC358FB7\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/Things_Seen_and_Unseen/Stego100-1.png"]}, {"name": "You Never Liked My Music", "desc": "Did I ever mention that I used to want to be a professional musician? It's true. It never really worked out. Probably because I wasn't very good. Still, for a good portion of my 20's I did the whole thing with garage bands and trying to get recognized and everything. I really wanted to make a mark on the world, but didn't really have any means to do it. So I did the next best thing and I made a lot of noise to be heard. Never seemed to work, though. Always fell on deaf ears. I gave up the dream after I entered university and discovered my next passions, and that brings us together today!\n\nStill, I've always had an affinity for music. Even as the years of loud music take their toll on my poor ears. I'm luckier than some since my hearing is still pretty good. Still I get tinnitus ringing in my ears more often now and I know when that happens that it means that I'm waving goodbye to another frequency of sound. The only bonus is that now I can play annoyingly high pitched sounds to irritate the youngsters and it doesn't bother me a bit!\n\nAnyway, I managed to find an old recording of my jazz drummer days to share with all of you. Oh, the dreams of a desperate kid. Enjoy!\n\nRight Click, Save As... Dig That Rhythm Daddio\nMD5 checksum 9C6CA614164743A7DF6CAF2299DB278A\n\nNOTE: To assist participants in this challenge, I have provided a few files demonstrating the basic principles of the task. These files do not contain the flag for this challenge, and are not required to solve it.\nRight Click, Save As... File 1 - Original message\nMD5 checksum 9C6CA614164743A7DF6CAF2299DB278A\n\nRight Click, Save As... File 2 - Transformed message without cover\nMD5 checksum A7F537FE11108A727F64F948C8DFCD62\n\nRight Click, Save As... File 3 - Audacity file post processing\nMD5 checksum 969C7434FC339B60429C78A02B2D5690\n\nAn image showing the post-processed transformed message compared to the original.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/You_Never_Liked_My_Music/Stego200-1.wav.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/You_Never_Liked_My_Music/Stego200-1_practice.aup3.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/You_Never_Liked_My_Music/Stego200-1_practice.mp3.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/You_Never_Liked_My_Music/Stego200-1_practice.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/PointerOverflow/2024/steg/You_Never_Liked_My_Music/Stego200-1_practice.wav.xz"]}]}