{"crypto": [{"name": "Cand1esaNdCrypt0", "desc": "5.0      2 ratings\nYour friend's birthday is in one hour now It is 11 PM sharp! You try to order a cake from CandlesCake Shop, but their online platform is completely broken. The approval system is stuck, and every transaction gets rejected unless it's properly signed. You're running out of time. Can you figure out how to get the cake delivered before midnight? The clock is ticking…\n\nGood luck! Happy Hacking!!!!\n\nflag format: p_ctf{...}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/crypto/Cand1esaNdCrypt0/public.pem", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/crypto/Cand1esaNdCrypt0/server.py"]}, {"name": "Dor4 Null5", "desc": "4.083333333333333     24 ratings\nAs usual, Blind Dora cannot see the treasure map the television remains struck.So Only the Administrator can guide her. If you are truly the Administrator, help Dora find Her treasure And Your Flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/crypto/Dor4_Null5/challenge.py"]}, {"name": "R0tnoT13", "desc": "4.2     5 ratings\nDuring a security audit of a custom cryptographic module, you obtain partial diagnostic logs from a faulty randomness subsystem.\n\nThe subsystem maintains an internal 128-bit state derived from AES, which is periodically inspected for integrity using bit-rotation consistency checks.\n\nFor specific, preconfigured rotation offsets k, the firmware records the value:\n\nS ⊕ ROTR(S, k)\n\nwhere S is the internal state at that time. These checks are intended only to verify hardware wiring correctness and were never meant to be exposed.\n\nDue to a logging misconfiguration, only a small subset of these diagnostic frames was captured before the system crashed.\n\nGiven:\n\n-Several leaked diagnostic frames of the form S ⊕ ROTR(S, k)\n\n-The corresponding rotation offsets k\n\n-Two anchor bits of the internal state\n\n-A ciphertext encrypted using the internal state\n\nReconstruct the state and recover the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/crypto/R0tnoT13/challenge.txt"]}], "forensic": [{"name": "HarDl4u6H", "desc": "The Joker left only one thing at the crime scene this time: a single file named smile.bin.\n\nNo threats, no riddles, no recordings — just that one file and a smear of blood on the wall that read:\n\n“A joke’s only funny when you get it.”\n\nGCPD’s cyber forensics division believes the file contains a hidden message, but every attempt to inspect it has turned up nothing but noise, corruption, and formats that make no sense together. It’s almost as if the Joker stitched different pieces of evidence into one corpse of a file, daring someone to pull it apart.\n\nIf there is a message buried in there — in the static, in the distortion, in the silence between the bits — you’ll have to find it yourself.\n\nThe clock is ticking. He’s waiting for someone to laugh.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/forensic/HarDl4u6H/smile.bin"]}, {"name": "Plumbing", "desc": "4.875      8 ratings\nWe found a Docker image that was already built and shipped. Something sensitive might have slipped through during build time, but the final container looks clean?? Analyze the image and recover what was lost. flag format: p_ctf{...}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/forensic/Plumbing/app.tar"]}, {"name": "epstein files", "desc": "4.25     4 ratings\nYou are provided with a PDF file related to an ongoing investigation. The document appears complete, but not everything is as it seems.\n\nAnalyze the file carefully and recover the hidden flag. !!! flag format : pctf{...}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/forensic/epstein_files/contacts.pdf"]}, {"name": "whoami", "desc": "4.5     2 ratings\nAn internal investigation flagged an anomalous access event involving a restricted internal resource. The activity blends in with routine network traffic and appears to have relied on valid credentials, rather than exploiting a software flaw.\n\nA packet capture was taken during the suspected time window.\n\nYour task is to analyze the capture and determine:\n\nThe identity of the account responsible for the access\n\nThe credentials used during the incident\n\nOnly one account successfully reached the restricted resource.\n\nflag format: p_ctf{username:password}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/forensic/whoami/capture.pcap.xz"]}], "misc": [{"name": "Catch The Train", "desc": "3.0    4 ratings\nYou were supposed to get down one stop earlier. Now the train has stopped… and you have no idea where you are.\n\nFlag Format p_ctf{station_name} Use lowercase letters only If the station name has multiple words, split them using an underscore\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/misc/Catch_The_Train/somerando.png"]}], "pwn": [{"name": "Blind Record Entry", "desc": "Our intern tried pushing this horrible record entry to production. Useless junk can't even read an entry. Might have left some holes in the code too...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/Blind_Record_Entry/chal", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/Blind_Record_Entry/ld-2.35.so", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/Blind_Record_Entry/libc.so.6"]}, {"name": "Dirty Laundry", "desc": "4.541666666666667      24 ratings\nThe washing machine doesn't seem to work. Could you take a look?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/Dirty_Laundry/chal", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/Dirty_Laundry/ld-2.35.so", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/Dirty_Laundry/libc.so.6"]}, {"name": "Talking Mirror", "desc": "3.75     4 ratings\nThis cursed mirror just repeats everything I say. I asked it for the flag and it just mocks me...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/Talking_Mirror/challenge"]}, {"name": "pCalc", "desc": "4.433333333333334     30 ratings\nJust a super secure calculator, making sure no funny business goes on except math homework...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2026/pwn/pCalc/chal.py"]}]}