{"crypto": [{"name": "FakeGM", "desc": "Any ol' brazier can smelt the ore , but can your limit tend to perfection ,like pure gold? The previous ones left some traces , make sure that doesnt happen again\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/FakeGM/enchantment.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/FakeGM/scroll.log.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/FakeGM/scroll.txt"]}, {"name": "TinyBunnie", "desc": "TinyBunnie\n\nI have been working on my very own blockchain , seems like i got it working. Took a lot of inspiration from microsoft as well , just to make sure things dont go wrong :)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/TinyBunnie/custom_block.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/TinyBunnie/tiny.py"]}, {"name": "TooMuchCrypto", "desc": "TooMuchCrypto\n\nMultiple blocks may appear random, but they dance in cohesion for the right numbers and rhythm. It’s not just one layer of security, but multiple layers ensuring that nothing can be extracted from the box. It’s not merely impossible—it’s impossible wrapped in layers of security. We’ve given you a clue; can you trace it back to its origins ?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/TooMuchCrypto/hash_h.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/TooMuchCrypto/hashing.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/TooMuchCrypto/output.py"]}, {"name": "sECCuritymaxxing", "desc": "In a significant breakthrough in law enforcement, authorities have arrested the infamous crime boss, known for orchestrating a sprawling illegal business network that has plagued the city for years. As authorities began to sift through the extensive evidence collected during the raid, they quickly realized that the case against him would require more than just physical evidence. As sources say the government has made deals with an black hat hacker who is in jail, to mimic him and take down his network in turn leading him to freedom...\n\nWould you take the deal?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/crypto/sECCuritymaxxing/server_obf.py"]}], "forensic": [{"name": "Chamber of Echoes", "desc": "You find yourself trapped in a strange, unfamiliar room, with only the echoes of past actions to guide your way. Every move feels like a shadow of something that came before, urging you to follow closely. But be warned—if your bullets run out, you might find yourself in more trouble than you bargained for.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/forensic/Chamber_of_Echoes/fullready.pdf", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/forensic/Chamber_of_Echoes/test_chal4.bsp"]}, {"name": "Checkmate", "desc": "Checkmate\n\nA legendary chess grandmaster decided to hide his secret strategy within his favourite portrait. He spent all his life studying chess & encryption. Its upto you now to unravel his secrets .\n\n    Flag format for this challenge is : pctf{your_flag_here}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/forensic/Checkmate/hex.jpg"]}, {"name": "Memoria Obscuria", "desc": "Memoria Obscura\n\nAlex Raynor, a brilliant but eccentric mathematician, vanished without a trace after claiming he had cracked an unbreakable code. When investigators combed through his last known workstation, they found a memory dump filled with fragments of his work. Whispers of a protected archive and a script capable of unlocking secrets spread among those curious enough to dig deeper. It’s said Alex loved puzzles, layering his secrets in ways only the cleverest could uncover. Can you follow his trail and reveal the truth he tried so hard to hide?\n\nhttps://drive.google.com/file/d/1eM0Q6B-eYOzW41S2eg2Eknv4sqlYtECV/view?usp=sharing\n"}, {"name": "Operation Cipherlock", "desc": "Operation Cipherlock\n\nAs the world inches closer to the brink of World War III, intelligence agencies are racing against time to secure critical information that could alter the course of the impending conflict. A seasoned operative, Agent Johnny, recently transmitted confidential intelligence. However, it was intercepted by a formidable counterintelligence agency determined to unlock its secrets. Agent Pacheco, your mission is to decipher the intercepted message and uncover the crucial information that could prevent a global catastrophe.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/forensic/Operation_Cipherlock/broken_transmission.pcapng.xz"]}], "misc": [{"name": "Size Does Matter", "desc": "Size Does Matter\n\nSometimes the smallest of keys can open the largest of doors\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/misc/Size_Does_Matter/capture.pcap.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/misc/Size_Does_Matter/pkt.out", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/misc/Size_Does_Matter/zsh_history"]}, {"name": "The Laughing Cipher", "desc": "Batman intercepts an encrypted message from Joker on a compromised GCPD server:\n\n\"Oh, Bats! A little surprise is wired to Gotham’s power grid. Tick tock!\"\n\nBatman discovers that there is a deactivation code, and hopes to find it in the Joker's network traffic.\n\nBatman plants this in the bashrc file :\n\n    export SSLKEYLOGFILE=/home/gotham/logs/keys.log\n\nBatman sneaks back inside the Joker's lair to retrive the logs but it seems corrupted. With the Joker's henchmen around the corner, he checks for running scripts and copies this file along the log. Help Batman save the city.\n\nReturn the flag as p_ctf{FLAG}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/misc/The_Laughing_Cipher/batman-usb.zip"]}], "pwn": [{"name": "Dupocalypse", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/pwn/Dupocalypse/Dupocalypse.zip"], "desc": "The world is in chaos, and only the bravest challengers dare to navigate the abyss. The stack has spoken—its words are cryptic, its nature unstable. Can you harness the forces at play and seize control of your destiny? The answer lies in your next move.\n"}, {"name": "Heap Of The Brave", "desc": "The gates of Valhalla stand open, where the fallen can rise again, but only to those who control their fate. Master the cycle of life and death, and the power of the past will reshape the present.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/pwn/Heap_Of_The_Brave/The_Heap_of_the_Brave.zip"]}, {"name": "Interesting", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/pwn/Interesting/Interesting.zip"], "desc": "\"Can you say something truly interesting and unpack what’s hidden?\"\n\nThings are wrapped up tight, but the right input might just break it open. Can you find a way through?\n"}, {"name": "Size Doesnt Matter", "desc": "A tiny binary with a big secret. Can you break through its small facade and prove size doesn’t matter?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/pwn/Size_Doesnt_Matter/chall"]}, {"name": "Vault of Lost Memories", "desc": "\"You stumble upon an mysterious vault on an old, forgotten server designed by a notorious hacker. The legendary hacker has stored his life's memories in it. Rumor has it that one who acquires his memories will access the ultimate hacking techniques, blueprints of epic heists and the raw confessions of a master of the digital underworld.\"\n\nCan you pwn the memory vault and acquire all the secrets?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/pwn/Vault_of_Lost_Memories/Vault_Of_Lost_Memories.zip"]}], "web": [{"name": "Birthday Card", "desc": "woah! this birthday card generator, isn't this cute!!!!!!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/Birthday_Card/app.py"]}, {"name": "Deathday Card", "desc": "you could have done some work around for birthday but not this...........\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/Deathday_Card/app.py"]}, {"name": "File Vault", "desc": "FileVault is a old file storing webapp, they still use old versions of Apache, and I feel like admin has some secrets with him in his webapp, which i definetly need to see what it is, please dont ask me why ;).\n\nFlag format for this challenge is:  PCTF{your_flag_here}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/File_Vault/fileVault.zip"]}, {"name": "Finding X", "desc": "We are a software company providing intelligent solutions.We have got several awards for being the best forwarding company locally. Can you find the missing part to complete this challenge\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/Finding_X/data.xml"]}, {"name": "Phantom Params", "desc": "My friend introduced me to this file-sharing platform that he created by himself, but he kept mumbling about hiding a secret in it. I love peeking into others’ secrets ;), though. Can you help me find it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/Phantom_Params/src.zip"]}, {"name": "Spelling it out", "desc": "I work in a company which has some kind of a old HR website (seems like they never update it tho) and I somehow found how to access it, and I overheard some informations like they hide some secret informations about that company, you know i love peeking into people's secret ;), soo..... lets find it tho\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/Spelling_it_out/spell-it-out.zip"]}, {"name": "Super Secret Notes", "desc": "My new notes app which i believe is very secure but is it ?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/Super_Secret_Notes/bot.js", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Pragyan/2025/web/Super_Secret_Notes/index.js"]}]}