{"crypto": [{"name": "ENIGMA M3", "desc": "Welcome to the Enigma challenge! Your task is to decrypt the given ciphertext using the Enigma M3 settings provided below. The flag is hidden within the decrypted message.\n\nEnigma Settings: Rotors: I, II, III Ring Settings: D, D, D Initial Rotor Positions: A, B, C Reflector: B Plugboard Connections: A ↔ G, B ↔ H\n\nCiphertext: ymnjp znmjo gteqj cjwwh qljtd nprmp g\n\nNote: You will have to rearange the letters and bring it in flag format QUESTCON{seperate_space} Also remember to replace space to _\n"}, {"name": "Old Connections", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/crypto/Old_Connections/Old_connections.pdf"], "desc": "Check out following pdf for more information!\n\nFlag format: QUESTCON{something}\n"}, {"name": "Visual Heist", "desc": "Challenge Description: \"Money Heist - Visual Cryptography Heist\"\n\nIn this challenge, the notorious Professor has developed a highly secure communication technique using Visual Cryptography to hide critical information about the next heist. Your task is to uncover the secret message that holds the exact plan for the heist by decrypting two visually scrambled images.\n\nScenario: The Professor has left behind two seemingly random images—one labeled \"layer1.png\" and another called \"layer2.png.\" Both images seem incomprehensible at first glance, but together, they contain the key to the highly confidential heist plan.\n\nYour mission is to use Visual Cryptography to decrypt these images and reveal the hidden message that the Professor encoded.\n\nQUESTCON{HIDDENMESSAGEHERE}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/crypto/Visual_Heist/layer1.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/crypto/Visual_Heist/layer2.png"]}], "forensic": [{"name": "Something Missing", "desc": "Professor got an image from Raquel, but the Intelligence did something! Author: TheProfessor\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/forensic/Something_Missing/SomethingMissing"]}, {"name": "The Timestamp", "desc": "Scenario:\n\nThe Professor and his crew have pulled off their biggest heist yet, but the police are hot on their trail. During their digital forensics investigation, the authorities have stumbled upon a critical file, malware.exe, on a suspect's computer. The timestamps on the file could reveal key details about the heist timeline, but it seems that the crew has altered them to cover their tracks!\n\nThe investigators suspect that Berlin, the mastermind behind the digital side of the operation, used a tool called Timestomp to manipulate the timestamps and throw the authorities off their trail. But with the right tools, you, as a digital forensics expert, can uncover the truth.\n\nThe $MFT (Master File Table) has been exported from the system, and the police have analyzed it using the AnalyzeMFT tool. Now it’s up to you to figure out whether Berlin tampered with the file's timestamps and uncover the real modification time of the file.\n\nFlag:  QUESTCON{YYYY-MM-DD_HH:MM:SS}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/forensic/The_Timestamp/analyze_mft_output.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/forensic/The_Timestamp/malware_mft.json"]}, {"name": "Tokyos Hidden Transmission", "desc": "Tokyo has left an encrypted message within an audio file, disguised under the noise of a loud, busy background. The file may sound like a regular conversation, but hidden beneath it lies the key to the heist's next move. This transmission is cleverly split into two channels—left and right. The loud audio on the left is just a distraction; the real clue is hidden in the soft, almost imperceptible sound on the right channel.\n\nMission Objective: Separate the channels and focus on the quieter right channel. Increase the volume, and you will notice something familiar—Morse code. Decipher the hidden message embedded in the dots and dashes to unlock the next stage of the plan. QUESTCON{hiddenmessage} (lowercase!)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/forensic/Tokyos_Hidden_Transmission/tokyo.wav.xz"]}], "osint": [{"name": "California Dreamin", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/osint/California_Dreamin/California_dreamin.png"], "desc": "The Professor has uncovered a critical piece of evidence: a dashcam photo retrieved from a hostile subject’s car, suspected of planning an infiltration at a nearby military installation. Your task is to utilize OSINT skills to stop this threat before it's too late.\n\nAnalyze the dashcam image to determine the exact coordinates where it was taken. Identify the nearest military installation to this location . Find the distance by road (in miles) from the exact coordinates of the dashcam image to the military installation. Round off the mile count to the nearest whole number.\n\nFlag format: QUESTCON{<Name of airforce base>-<rounded off mile count>} The name should be one word and lowercase\n"}, {"name": "Not another heist", "desc": "Professor's Log: A valuable project involving microsatellites—worth millions—is at risk of being stolen. An asset has snapped some excellent photos of a key suspect. The intel reveals the suspect is targeting a project under development in the Department of Ecology at an unnamed university. This is our only lead to intercept him before the heist goes live. WE NEED HIM RED HANDED.\n\nMission: You need to identify the postal code of the university where the project is being developed. Use the provided hints about microsatellites, ecology research, and location clues to uncover where the suspect's target lies.\n\nFlag format: QUESTCON{POSTALCODEHERE}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/osint/Not_another_heist/snapshots.zip.zip"]}, {"name": "The Big Fish", "desc": "Professor has retireved this image which was taken at the time and at the very place of a cyberattack from the dashcam of our suspect's car. Find the organization(1 word) that was attacked and also figure out when. A big amount of money was stolen in this attack. The figure is XX crore rupees. Flag format: QUESTCON{name_of_organization-year_of_attack-XX}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/osint/The_Big_Fish/dashcam_capture_20180811.png"]}, {"name": "The Flight", "desc": "“Team, focus up! Six years ago, a high-stakes flight carried critical loot that could change everything for us today. The Professor has uncovered intel suggesting that the key to unlocking this treasure lies in the departure time of that flight.” Briefing: The plane arrived at its destination six years ago, but the exact departure time from its origin remains a mystery. We’ve got an image file provided by an asset at the airport. Somewhere in that file, the answer is hidden. It could be buried within the metadata, encrypted in visual clues, or disguised through other means.Also intel suggests that there was a Golden Retriever on the plane which was reported injured. Only the sharpest minds can uncover it. Objective: Extract the departure time from the provided image. Submit the flag in the format: QUESTCON{YYYY-MM-DD-HH-MM}. (YYYY-MM-DD and HH-MM are respectively the date and the updated time when the flight departed)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/osint/The_Flight/airplane_photo(1).jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/osint/The_Flight/airplane_photo(2).jpg", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/osint/The_Flight/airplane_photo.jpg"]}], "rev": [{"name": "Twice the Trouble", "desc": "The Professor has hidden a secret within a simple number comparison script. Two numbers, a special condition, and a flag locked behind encryption. The trick is to trigger the hidden logic—if you can find it.\n\nSolve the puzzle, decrypt the flag, and prove yourself. Can you outsmart the Professor, or will this be twice the trouble?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/rev/Twice_the_Trouble/magnitude.py"]}, {"name": "Unlock the Encrypted Flag", "desc": "You’ve stumbled upon a secure system that hides its flag behind an encrypted file. A Python program is provided, allowing you to check if a password can decrypt the flag. Your mission is to reverse-engineer the program to find the correct password, use it to decrypt the flag, and present the solution in the correct CTF flag format. Can you find the password and unlock the encrypted flag? (Run this Python program in the same directory as this encrypted flag.)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/rev/Unlock_the_Encrypted_Flag/encrypted.flag.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/rev/Unlock_the_Encrypted_Flag/flag.txt.enc"]}, {"name": "Unlock the Safe", "desc": "You’ve lost the key to your digital safe, but there’s a program available to help retrieve it. The program uses a password, but instead of comparing it directly, it encodes the input into Base64 and compares the result with a hardcoded Base64-encoded string. Your task is to figure out the correct password by analyzing how the program processes the input. Once you discover the correct password, you’ll need to format it into the correct CTF flag format to unlock the safe.\n\nExample: QUESTCON{password_to_the_safe}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/rev/Unlock_the_Safe/safeopener.java"]}], "steg": [{"name": "Long way to go", "desc": "Something hidden in professor's own quest. Can you find the mole? Author: TheProfessor\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/steg/Long_way_to_go/challenge.docx"]}, {"name": "The Bank Of Spain", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/QUESTCON/2024/steg/The_Bank_Of_Spain/Bos.jpeg"], "desc": "The professor is inspecting hidden tunnels to get out! Can you find one for him? Author: Professor\n"}]}