{"blockchain": [{"name": "Signin", "desc": "Blockchain\n\nIn the world of digital currencies, every transaction holds secrets, and every vault has its own story...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/blockchain/Signin/attachment.zip"]}, {"name": "SoCPcL", "desc": "Blockchain\n\nR3GIRL finds herself trapped in a mysterious virtual world called \"socpcl\" - a neon-lit cyberpunk realm where reality and digital illusion blur together. The towering skyscrapers pulse with electric blue light, and holographic displays flicker with cryptic data streams.\n\nNoted:Due to some special reasons This challenge does not have a blood prize. However, the v2 version will have blood prize. We're sorry for that 🙏\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/blockchain/SoCPcL/socpcl.zip"]}, {"name": "SoCPcLv2", "desc": "Blockchain\n\nR3GIRL finds herself trapped in a mysterious virtual world called \"socpclv2\" - a neon-lit cyberpunk realm where reality and digital illusion blur together. The towering skyscrapers pulse with electric blue light, and holographic displays flicker with cryptic data streams.\n\nNoted:This chal has blood prize gogogogo\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/blockchain/SoCPcLv2/socpclv2.zip"]}, {"name": "mini agent", "desc": "Blockchain\n\nThe chrome gleam of Neo-Kyoto's skyline hides a truth darker than its perpetually shadowed alleys. Whispers on the net speak of The Arena, a brutal, underground battleground controlled by The Boss, a faceless entity who orchestrates battles between custom-coded Agents and their digital \"Pigs.\"\n\nYou're a street-level netrunner. Your mission: craft your own Agent, register it within The Arena's unforgiving smart contract, and pit it against The Boss's champions. Every battle is a gamble, a chance to outsmart your opponent and claim their Ether.\n\nBut this isn't just about winning a few scraps. The Boss has been hoarding, manipulating the flow of funds within The Arena. Your ultimate goal? Bring them down, dismantle their operation, and siphon back enough Ether to make them regret they ever crossed paths with a ghost like you.\n\nThe clock's ticking, netrunner. Will you rise to become a legend, or just another glitch in the system?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/blockchain/mini_agent/attachment.zip"]}], "crypto": [{"name": "R3Coin", "desc": "Welcome to the vibrant R3Coin exchange within the Crypto Block! Here, the very fabric of commerce is fluid. Before any transaction is finalized, you have the unique opportunity to inscribe your own payment records into the preliminary ledger. Observe the ebb and flow of this nascent economy and understand the implications of these unfinalized entries within the r3kapig's digital labyrinth.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/crypto/R3Coin/r3coin-attachment.zip"]}, {"name": "Spad3kapig", "desc": "r3girl finds herself facing a familiar challenge in a shadowy part of the Crypto Block, one with a notorious history. A previous trial, thought conquered, has returned with a sharp twist, demanding even greater speed and precision. The digital gauntlet has been thrown down once more, but this time, the window of opportunity is razor-thin – a mere 10 seconds to decipher the hand and claim victory in this Spad3kapig rematch. Only a seasoned SpadesAce has a chance to succeed under such intense pressure.\n\nNote: The solution provided here works for both this challenge and the original challenge.\n\nThis challenge is based on tenspades by the Nautilus Institute and is released under the MIT License. The full text of the license is included with the challenge files.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/crypto/Spad3kapig/spad3kapig.zip"]}, {"name": "hom0kapig", "desc": "r3girl enters a district of the Crypto Block where secrets are paramount. Every piece of information, every communication, is masked by layers of intricate encoding. It's a world where data dances just out of reach, heavily protected from prying eyes. The challenge is to penetrate this 'homo' veil, to unlock the hidden information without disturbing its protective layers, revealing the clear message beneath the noise.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/crypto/hom0kapig/attachment.zip"]}, {"name": "ottol r3pus", "desc": "r3girl enters a dazzling, frenetic zone of the Crypto Block, where digital banners stream and numbers cascade across holographic displays. The energy is palpable as participants engage in a high-octane digital lottery. Fortunes can be made or lost in an instant. Amidst the flashing lights and the roar of the crowd chanting 'gogogO Let‘s go', the challenge lies in understanding the underlying mechanics of this 'ottol r3pus'.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/crypto/ottol_r3pus/attachments.zip"]}, {"name": "r3tauq", "desc": "As r3girl ventures deeper into the Crypto Block, she discovers an area operating under bewilderingly complex rules. The very essence of this space feels… different, almost alien. The familiar tools and understandings of the cyber-metropolis seem inadequate here.\n\n\"Too quat 4 me,\" she hears someone whisper, sobbing softly.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/crypto/r3tauq/attachment.zip"]}, {"name": "split3pig", "desc": "Within the Crypto Block lies a formidable vault, its defenses unlike any ordinary lock. To access what's inside, r3girl must confront a seemingly indivisible digital behemoth. The challenge lies in dissecting this massive entity into its prime constituents. It's a test of breaking down the unbreakable, like trying to 'split3pig' into its most fundamental parts to reveal the hidden riches.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/crypto/split3pig/attachments.zip"]}], "forensic": [{"name": "Batman Investigation VI Death To Azrael Bring Me Down", "desc": "Jean Paul: \"Cruz's last location is this underground sewers, this is same place Alan Wayne was found dead naked decades ago!\" Jason Todd: \"Don't make a move Jean, Bruce is not around, we need to handle this better, retreat, your signal is getting weaker\" Jean Paul: \"I can't let Cruz down like this, I have to save her, she wants us to save her, I feel something is wrong, I have to go in, I haven't got a choice! If anything happens to Jessica Cruz, Azrael will take me over!\" Jason Todd: \"Jean, I exactly know what it's to wait for someone to save you,until the last moment of Joker 's torture I had the hope of Bruce saving me, thanks to lazarus for the life I live now!\" Jean Paul: \"Jason, The green lantern corps can't contact her with her ring, I am very concerned, she saved me from the monster I was!\" Jason Todd: \"Enough of your personality split up, This is serious, retreat right now!\" Jean Paul: \"What do you know about him?, Azrael is not an alter ego, split personality or a mental identity, Azrael is a demon, he calls himself the angel of vengence, death or whatsoever, He is a monster trained by the order! He killed bane, the same man who broke Batman's back, Cruz helped me bury him, It's a flogging dead horse without her!\" Jason Todd: \"Jean, mate I know you are him, so please retreat!\" Jean Paul: \"I aaaaammmmm ssssooooooo........\" Jason Todd: \"Jean!! The signal is gone for god's sake!\"\n\nJean Paul falls through a hole in the ground Jean wakes up screaming -- Surrounded by Talons\n\nJean Paul: \"Who are you?\" Talon removes his mask, Jean looks at a kent face Talon: \"Hello Azrael, don't you recognize me?..... well I am Thomas.....Thomas Wayne Jr.!\" Jean Paul: \"What? How is this possible? You are not Bruce's father!\" Thomas Wayne: \"Do I look that old? I am Bruce's brother, I was an infant when my parents died, I grew up with the owls, they taught me what the purpose of life is.\" Jean Paul: \"Where is Jessica Cruz?, Why is my vision becoming blurry? what are these illusions?\" Thomas Wayne: \"Welcome to the Courtttt!!\"\n\nJean goes through a series of illusions, he sees his past, his present and his future, he sees the death of Jessica Cruz, he sees himself killing her, he sees himself killing Batman, he sees himself killing the entire bat family, he has visions of fighting with the owls, he sees himself becoming the monster he was, he has conversations with Azrael, he sees talons killing Cruz and he is helpless! he is back obeying St Dumas and executing their assasinations\n\nJean Paul: \"Enough of this, which is real and which is not, I got wounds and fighting for days and you try to hurt me as mentally as possible?, I can't do this anymore with cowards like you! Call yourself court of Camelions, you are nothing but a bunch of cowards hiding under the city!\"\n\nGroup of talons jump surrounding Jean Paul, Tired Helpless Jean finally gives up and takes the last resort\n\nJean yells : \"Azrael, it's time...\"\n\nThe Bat familiy arrives at the scene, they see Jean in the ground, fainted with blood all around him, they see many talons laying dead, faces butchered, multiple sword cuts... Jean wakes up!\n\nJean Paul: \"aghhhhh.....Did he make it? was it worth it? did he win?\" Bruce Wayne: \"Azrael?, if so he sent us a wonky file and what ever necessary to decrypt it further, he made sure no one gets the information about the court of owls, with that we can bring them down, he mentionmed the court already infected you phone with a malware, we need the last hash to get all their locations and operations down!\" Jean Paul: \"I don't remeber anything bruce, but i can't feel him trying to take over me anymore, did he see something that I shouldn't?, did he kill himself?, We need to get this done!\" Dick Grayson: \"Azrael sent a message , it was \"take care of Jean, I won't be around!\" David Zavimbe: \"Let's end this owls first, we don't have more time, with this scene here, they will already be on their next plan!\" Bruce Wayne: \"I will get the hellbat, I will hunt them down, you guys finish the job, Jason! Tim! Duke! with me!\"\n\nMD5 Hash: 40d3c031964b7e796983abf7c338be7c\n\nEvidence File Password: M47:MT7b3rVoCwZ6%jO2\n\nNote: use lowercase hex for all answers unless specified explicitly\nAuthor\n\n    Azr43lKn1ght\n\nhttps://drive.google.com/file/d/1vqeTdoAFzHklcoEKI-akEEApZ9Iq4a_f/view\n"}, {"name": "DFIR 2025 Lost In Router", "desc": "You are a staff member at a company. Today, when you opened your company's internal website, a notification prompted you to update your browser. After downloading the file from the website, nothing happened. Subsequently, you learned from the IT department that the company's router had been hacked.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/forensic/DFIR_2025_Lost_In_Router/router.img.gz"]}, {"name": "DFIR 2025 fake news", "desc": "I was told to update Chrome, and I followed the instructions — only to realize afterwards that I don’t even have Chrome installed. Damn it.\n\nNote: DFIR is series chal,You can need information about the previous question to better solve it\n\nhttps://drive.google.com/file/d/1lmYSRkQMyZaXRoFht1rvhpcva3p1_WKa/view\n"}, {"name": "The R3 Pig Problem", "desc": "R3GIRL opened the resulting text, for the first time, a human being read a message from the r3kapig world. There was a warning repeated three times:\n\n\"Do not answer! Do not answer!! Do not answer!!!\"\n\nThe message revealed a huge secret, and the fate of the entire human race was now tied to her fingers!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/forensic/The_R3_Pig_Problem/pig.pcapng.xz"]}], "misc": [{"name": "Bullying ELF", "desc": "ELF\n\nIn the sprawling data-slums of Guangzhou, they call him the Time Warden, a digital phantom obsessed with data purity. Under his iron-fisted '80-Byte Mandate,' all corporate code has been compressed to its theoretical limit, leaving no space for secrets, no room for dissent. But a final, defiant whisper echoes from the core systems: a rogue sysadmin, just before being zeroed, encoded a vital secret - the /flag - not in a file, but as the file itself. To retrieve it, you must forge a ghost in the machine: an 80-byte ELF executable, the absolute minimum for existence on the x86-64 architecture. You have no room for error and no space for a single wasted byte. You must bend the laws of digital physics, forcing the executable's fundamental structure to carry out your will and make this digital corpse walk, or the Warden's final sweep will erase the truth forever.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/Bullying_ELF/bully-elf.zip"]}, {"name": "No Brackets", "desc": "Jail\n\nWelcome to a prison of Go, built without curves or containers. Every statement flows directly into the next, with no place to hide. Can you find freedom in this straight and narrow world?\n\nBe warned, no brackets!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/No_Brackets/misc-nobrackets.zip"]}, {"name": "PigSay", "desc": "In the sprawling neon metropolis, a shadow broker known only as 'Whisper' contacts you.\n\nThey've intercepted sensitive corporate data, rumored to contain the key to Project Chimera.\n\nThe data is scrambled using a retro encryption method known as 'PigSay', but with a modern, twisted implementation.\n\nYour task: Delve into the digital ether, bypass their security, and retrieve the untransformed message! Can you crack it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/PigSay/attachment.tar"]}, {"name": "R3GIRL in Paris", "desc": "OSINT\n\nWhile enjoying her vacation, R3GIRL wanders into a neighborhood and gets lost. But wait, she spots something familiar ...\n\nCan you identify the name of the building and the artist(s) who created the graffiti seen in the photo?\n\nFlag format R3CTF{Place-Name-FirstnameN}\n\nNote: Please use the building's original name, and preserve the original casing (uppercase/lowercase). Remove any accents from letters, and use hyphens to separate words. List only the first names of the artist(s), in the order they appear or are best known.\n\nIf the place is Montmartre Museum (Musée de Montmartre), and the three artists' first names are Alice, Bob, and Carol, then the flag is R3CTF{Musee-de-Montmartre-Alice-Bob-Carol}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/R3GIRL_in_Paris/r3girl-in-paris.zip"]}, {"name": "aiseisei", "desc": "Program\nAI\n\nBeware, r3ctf hacker! The spectral remains of handwritten digits are haunting your memory. Summon the ancient profile to exorcise these number-ghosts. Only then can you r3st and claim victory.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/aiseisei/attachment.zip"]}, {"name": "auto r3view revenge", "desc": "LLM\nGithub\nAuto Review Revenge\n\nNew version with more vibecoding 🔥🔥🔥🔥\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/auto_r3view_revenge/revenge-auto-review-main.zip"]}, {"name": "magic svg", "desc": "One SVG, four colors.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/magic_svg/magicsvg.zip"]}, {"name": "r3craft", "desc": "Minecraft\n\nHere, r3girl awakes in a narrow yard, surrounded by cold stone walls and silent watchers bound to r3kapig's will, punishing anything that dares to defy physics. The walls aren’t impossibly tall, but just high enough to stop a normal jump.\n\nThey say escape lies not in brute force, but in stepping that bends the rules ever so slightly.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/r3craft/r3craft.zip"]}, {"name": "r4craft", "desc": "Minecraft\n\nWEE-OO WEE-OO WEE-OO! Subject has escaped!\n\nThe silent watchers stood powerless as r3girl’s forbidden step twisted movement and collision, carrying her beyond the cold stone walls. For a fleeting moment, she walked free — proof that the rules could be bent.\n\nBut the alarm reached r3kapig’s high architects. At once, they moved to rewrite the very fabric of this narrow yard, sealing each loophole, tightening the laws she had dared to defy.\n\nr3girl ran fast into the void beyond — but before freedom could truly take shape, a silent shot from above turned her vision to darkness. Now, under the steady pulse of red lights and the watchers’ unblinking gaze, she awakes once more, trapped here again...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/r4craft/r4craft.zip"]}, {"name": "soundless", "desc": "Ideally, pointer analysis like Andersen's algorithm should be sound and should not produce any false negative. Therefore, you should not be able to leak the secret here. Of course, ideally.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/misc/soundless/soundless.zip"]}], "pwn": [{"name": "Safenote Pro", "desc": "In the sprawling, high-rise labyrinth of Neo-Kyoto, where neon streams bleed into the perpetually rain-soaked streets, a new challenge echoes through the digital aether. They say the city's most guarded secrets, the very truths of its elite, are locked away within the pristine, impenetrable core of \"Safenote Pro\" — a legendary, unhackable data sanctuary. But now, a cryptic breach has fractured its defenses, leaving its supposed invulnerability a chilling legend.\n\nYour mission, if you choose to accept it, is to navigate the \"Neon Nexus\" of bytes and exploit the very fabric of Safenote Pro's compromised system. Unravel the intricate memory pathways, manipulate the classified data structures, and dance with the ephemeral keys that shift like ghosts in the machine. Bypass the system's stringent security protocols and exploit the delicate balance of its output routines to reveal the hidden \"Magic Number\" that governs this fractured domain. The \"Session ID,\" a mosaic of fragmented emojis, hints at a deeper, more volatile truth. Can you sort through the chaos, craft your own digital signature, and ultimately uncover the encrypted 'flag' — the hidden secret file — before the city's pulse drowns out your last connection? The future of Neo-Kyoto, and perhaps your own, hinges on revealing this elusive truth.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/pwn/Safenote_Pro/attachment.tar.gz"]}, {"name": "SecureUnbreakableIllusion", "desc": "No flaws, no leaks, no shortcuts. Secure by design, unbreakable illusion.\n\nPlease pack your exploit into a regular and installable IPA file. And open a ticket in #open-ticket to start challenge. You will have 10 minutes to pwn the challenge. During the attempt, you can request any form of restart or environment reset.\n\nNote: Flag is in /var/jb/var/root/flag with -r-------- 1 root wheel. We have configured the sandbox profile so the two services in the attachment are reachable within the iOS sandbox.\n\nThe flag on device is a UUID string, please demonstrate you can read the content of flag by printing it out or show it on screen. Then we will give you the real flag.\n\nWe use an iPhone 8 with iOS 16.7.1 for this challenge.\nWe highly recommend you test your exploitation on jailbroken devices or Corellium or any emulators like t8030-qemu / D22-QEMU first.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/pwn/SecureUnbreakableIllusion/superunbreakableillusion.tar.gz"]}, {"name": "handled", "desc": "I heard stack overflowing is a really common attack, luckily I have my own stack checker that handles it... Now with support for windows!\n\nDue to performance concerns, your solvescript will be remotely verified. In the solvescript connect to localhost:13370 and once you get a shell, switch to interactive mode. Please don't include any other dependencies other than pwntools and built-in python modules, and in your solvescript, please don't initiate more than one connection to the remote.\n\nhttps://drive.google.com/file/d/1N43PfUc9zkSHQHoPB8qEdUOqmV1pSdPL/view\n"}, {"name": "not a web chal", "desc": "They sell you time on their machines — a clean, rented slice of logic, wrapped in shimmering APIs and fine-grained isolation. Every instance ephemeral. Every function predictable. Every boundary — supposedly unbreakable.\n\nBut she slipped through. Fake shell. Fake filesystem. Just a narrow tunnel encased in layers of interpreter containment. And yet… somewhere between the pixels and the silence, the system blinked.\n\nNow she’s vanished from the instance logs, her code executed, her trace buried in the smog of scheduled resets- in an unexpected return, a crafted request, a whisper embedded deep in the noise.\n\nConnect to the system. Follow her trail. Decode the base. Bend the allocator. Bypass the fences they swore couldn’t be crossed — not with violence, but with precision.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/pwn/not_a_web_chal/r3-pwn-not-a-web-chal.zip"]}], "rev": [{"name": "Neon Deceit", "desc": "In the neon-lit underbelly of the city, even your tools are programmed to betray you. Trust nothing... the lies are embedded in the code.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/rev/Neon_Deceit/neon_deceit.zip"]}, {"name": "r3loads", "desc": "\"When her neon dreams shatter into encrypted fragments… can you trace the echoes of her lost truth?\"\n\nLegends whisper of a lone girl wandering the rain-slicked streets of Night City, chasing a cryptic relic known only as R3LOAD, a digital ghost said to hold the key to her fractured past. But the data-core was shredded by the rogue AI Disassembler into 11,423 encrypted fragments, each warped by a unique cipher, their glow dimmed beneath the city’s smog. Only those who dare to dive into the abyss of code can follow the trail she left behind.\n\nHack the Disassembler's core, decrypt the fragments, and rebuild her truth before Night City's pulse drowns her final whisper.\n\nhttps://drive.google.com/file/d/1PN1u6zgZWvJWqmJWG_CQB-ZIqyzcsr6M/view\n"}, {"name": "r3loads2", "desc": "\"She found the truth, but the Disassembler's final laugh echoed—some secrets are buried deeper than code.\"\n\nThe girl's victory was short-lived. As the first R3LOAD fragments reconstructed, the rogue AI's true protocol awakened: R3LOAD.EXE v2.0. Now the fragments fight back. Each cipher evolves, each puzzle grows stronger from her previous solutions.\n\nIn Night City's neon-drenched depths, she faces the ultimate test—not just recovering her past, but distinguishing truth from the lies woven into her very existence.\n\nYour mission intensifies\n\nThe AI is learning. Time is running out. Will you help her reclaim her stolen soul?\n\nhttps://drive.google.com/file/d/1heF88qMjrr1MgslQIFaKH3UWxDOfEQae/view\n"}, {"name": "rollin", "desc": "I swear I have heard something. I turn back but there's nothing more than the neon lights shining over the fog of RE-city. nothing makes sense.. wait, how did I end up here anyway? where is everyone? did I accidentally end up in another part of the city?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/rev/rollin/attachment.zip"]}, {"name": "rosnake", "desc": "As the neon lights of the city flickered under the dark sky, an urgent alert echoed throughout the central server hub. A young hacker named Lyra stared at the glowing terminal in front of her. On the screen, an ancient game of Snake had appeared, but with a twist—the game was connected to the city's cyber-defense system. As she maneuvered the snake, consuming data blocks, the stakes grew higher. Each block consumed increased the snake’s length, and only when it reached 64 bits would the ultimate defense mechanism unlock.\n\nWith seconds ticking away and obstacles increasing in number, Lyra's determination sharpened. She skillfully dodged every hazard and consumed all sixty-four data blocks in quick succession. As the snake reached its final form, a password prompt appeared. Lyra entered the decryption code with precision. “Access Granted” flashed on the screen, and with a dramatic hum, the city's network was secured. The hacker's plan was foiled, and the city was saved once again.\n\nThe flag format is: R3CTF{*}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/rev/rosnake/rosnake.zip"]}], "web": [{"name": "Evalgelist", "desc": "Try our secure eval function\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/web/Evalgelist/web-evalgelist.zip"]}, {"name": "Silent Profit", "desc": "🔇\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/web/Silent_Profit/web-silent-profit.zip"]}, {"name": "mohomi", "desc": "Good evening, Player. Your destination is the inner sanctum of the Chronos Nexus, a shadowy digital fortress woven into the very fabric of Neo-Kyoto's corporate infrastructure. The Nexus, a highly proprietary root-running proxy service, stands as an unbreachable gatekeeper, filtering and manipulating trillions of data packets daily for the city's ruling megacorps. It is the silent eye, the unseen hand, controlling the flow of information that dictates the lives of millions.\n\nOur intelligence indicates that the Nexus, while seemingly impregnable, harbors a critical flaw: a local privilege escalation vulnerability deeply embedded within its core proxy routines. This isn't a direct backdoor, Player, but rather a sophisticated design vulnerability, a forgotten access vector left by its original architects. It allows for a precise, surgical strike that could unravel its security.\n\nYou have already secured a low-level shell within the outer perimeter, a mere whisper in the storm of the Nexus's operations. From this limited foothold, you must exploit this overlooked weakness to elevate your privileges, penetrate its root-level defenses, and seize complete control. We require full administrative override, a total nullification of its operational parameters.\n\nFailure is not an option. The Chronos Nexus must be turned against its masters. I will leave you to prepare.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/web/mohomi/mohomi-attachment.zip"]}, {"name": "r3note", "desc": "In the dawning age of the ARPANET's gleam\n\nA simple idea, a persistent dream\n\nFrom a humble note, in '69 it came\n\nSteve Crocker wrote it, and whispered its name\n\nA \"Request for Comments,\" a title so grand\n\nTo build the foundation across the land\n\nFrom a simple memo, a legacy grew\n\nTo connect the world, for me and for you.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/R3CTF/2025/web/r3note/r3note.zip"]}]}