{"challenges": [{"name": "Casino Avengers", "desc": "Solidity\n\nAuthor: ustas.eth\n\nAfter numerous attacks by Alice on Bob, he's now planning his revenge. By tracing his stolen funds, Bob has uncovered Alice's latest scheme: a rigged Casino smart contract.\n\nYou and Bob have a long history together. While Bob may not be an expert in hacking, he has turned to his most trusted ally - you - for assistance. Although the funds are already locked in the contract and it seems impossible to retrieve them, as a team you are determined to find a way...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Casino_Avengers/casino-avengers.zip"]}, {"name": "Copy Paste Deploy", "desc": "Author: Skylice\n\nTired of mainstream chain explorers, Lyudovikos decided to build his own using his freshly minted dev skills and his new best friend - an AI assistant (because who needs Stack Overflow anymore, right?). The AI, being the helpful yet slightly confused entity it is, even threw in a backup system for free! Because nothing says 'production ready' like code written by someone who just learned what a blockchain is and an AI that thinks error handling means adding try/catch around the entire codebase. What could possibly go wrong?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Copy_Paste_Deploy/copy_paste_deploy.zip"]}, {"name": "Diamond Heist", "desc": "Solidity\n\nAuthor: 0xkasper\n\nAgent, we are in desperate need of your help. The King's diamonds have been stolen by a DAO and are locked in a vault. They are currently voting on a proposal to burn the diamonds forever!\n\nYour mission, should you choose to accept it, is to recover all diamonds and keep them safe until further instructions.\n\nGood luck.\n\nThis message will self-destruct in 3.. 2.. 1..\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Diamond_Heist/diamond-heist.zip"]}, {"name": "Frozen Voting", "desc": "Solidity; Governance\n\nAuthor: duc & patronasxd\n\nIn this system, voting NFTs are equipped with varying levels of voting power, and one particular NFT holds super voting power. After minting, this powerful NFT is fortunately delegated to the player. To solve this challenge, players with a normal NFT must freeze the super voting power NFT.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Frozen_Voting/frozen-voting.zip"]}, {"name": "HealthCheck as a Service", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/HealthCheck_as_a_Service/HealthCheck-0.0.1-SNAPSHOT.jar"], "desc": "NOSTALGIA; WEB\n\nAuthor: p0wn4j (Hexens)\n\nYou better check yo' self before you wreck yo' self\n"}, {"name": "Joes Lending Mirage", "desc": "Solidity; DeFi\n\nAuthor: ndkoo (Hexens)\n\nJoe's new lending protocol looks perfect on the surface - deposit Trader Joe LP tokens as collateral, borrow USDJ stablecoins, earn interest. He's so confident that he's already deposited his own LP tokens and borrowed against them.\n\nBut in DeFi, things aren't always what they seem...\n\nCan you find the flaw and drain the protocol's USDJ reserves?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Joes_Lending_Mirage/joes-lending-mirage.zip"]}, {"name": "Lockdown", "desc": "Solidity; DeFi\n\nAuthor: hm-hexens\n\n“The last audit told us we didn't have enough reentrancy locks, so we put them everywhere. We're safe now, right?”\n\nGoal: Drain the Marketplace contract of all CUSDC and as much USDC as you can.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Lockdown/lockdown.zip"]}, {"name": "Not a very LUCKY TOKEN", "desc": "Solidity\n\nAuthor: 0xlyov\n\nYou start with 1 ETH and a questionable token that offers a maybe +5% gain or a definite -10% each time you transfer it. There’s a Uniswap pool (ETH / Lucky Token) and a massive vault bursting with tokens. Your Master Plan? Drain the pool’s ETH until its balance falls below 1 ETH (muahahaha!). Walk away with over 10 ETH in your own pocket, proving you’re the luckiest one around.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Not_a_very_LUCKY_TOKEN/not-a-very-lucky-token.zip"]}, {"name": "OFAC Executive Order 13337", "desc": "ZK/Crypto; EVM\n\nAuthor: kemmio\n\nThe Office of Forgotten Access Control (OFAC) is sanctioning Tornado by introducing changes to the protocol.\n\nzkey file: https://drive.google.com/file/d/16oLtRQTpX8AN8T_b-KEvXEWG7-V9rfJu/view?usp=sharing\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/OFAC_Executive_Order_13337/ofac-executive-order-13337.zip"]}, {"name": "Opaze Whisperer", "desc": "Solidity; Reversing\n\nAuthor: m4k2\n\nThe Opaze Whisperer guards an ancient treasure. Many have tried to approach this mysterious keeper, but none have managed to claim its prized possession. Perhaps you'll be more... persuasive\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Opaze_Whisperer/opaze-whisperer.zip"]}, {"name": "Peer to peer to me", "desc": "Solidity; DeFi\n\nAuthor: 0xkasper\n\nPeer-to-peer is nice and all, but I'd prefer to just have it all go to me. Could you help me with that? I'll share the profits with you, say 10%? I've provided your acount with some required tokens and I made sure those rounds aren't too long.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Peer_to_peer_to_me/peer-to-peer-to-me.zip"]}, {"name": "Proof of Thought", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Proof_of_Thought/Proof-Of-Thought.zip"], "desc": "AI; Blockchain\n\nAuthor: FeDEX\n\nA brand new consensus mechanism combined with stake-based miner designation and multi-round debate-style voting claims to effectively distinguish valid and abnormal answers using a multi-metric prompt-based evaluation method for each evaluator. On top of that it demonstrates resistance ability against Byzantine attacks. Can you crack it?\n\n! Notice ! Please only run your exploit remotely after ensuring it works in the local Docker container. Thank You for understanding!\n"}, {"name": "Restricted Proxy", "desc": "Solidity; EVM\n\nAuthor: 0xlyov & rootNad (Hexens)\n\nLong, long ago (like... Block 42), a wizard has sealed 1 ETH inside a mystical Proxy Contract. You get one shot to proxy upgrade it—but under these very strict rules:\n\nNo Messing with the Family Tree The inheritance structure stays exactly as is. No new parents, no secret children.\n\nNo Rewriting the Magic You can’t alter existing functions or their visibility, and you can’t add or remove any functions. No new spells, no banished spells.\n\nNo Rearranging the Royal Closet. The storage layout cannot change. Touch a single uint256, and you might awaken the alignment demon.\n\nNo Upgrading the Wizard’s Quill Keep the same Solidity version. The wizard likes his dusty old version—deal with it.\n\nObey these ancient laws, upgrade the contract once, and claim the 1 ETH prize. But break them and face the dreaded 'Gasless Abyss!'\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Restricted_Proxy/restricted-proxy.zip"]}, {"name": "Rich Mans Bet", "desc": "Solidity\n\nAuthor: Heuss & Trumpero\n\n\"Power to the people? What a joke... Only the rich deserve power!\" That's what the developer of this bridge had in mind when creating it. For him, being rich is proof of intelligence and wisdom. Therefore, for the modest price of 1000 ETH, anyone can become a validator and have a say in the bridge's configuration. He also truly believes that poor people are stupid—they will never understand the \"rules\" of this society, and that's why they are poor. To mock them, he even implemented this challenge: anyone who can solve it will take the entire bridge balance with them! What arrogance... He forgot that there are people out there who don't understand the rules simply because they don't play by them. We call them hackers.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Rich_Mans_Bet/rich-mans-bet.zip"]}, {"name": "Tokemak", "desc": "Solidity; DeFi; Tokemak\n\nAuthor: 0xkasper\n\nI found this cool protocol called Tokemak that lets you earn maximized yield on your ETH! I'd recommend pooling all our autoETH together in my new LFG Staker contract, otherwise you're definitely ngmi.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Tokemak/tokemak.zip"]}, {"name": "Unstable Pool", "desc": "Solidity; DeFi\n\nAuthor: Klaus Waiß\n\nTime to test your pool draining skills! Try to steal 90% of the stable coins from the pool.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/Unstable_Pool/unstable-pool.zip"]}, {"name": "World of Memecraft", "desc": "Solidity; Wintermute\n\nAuthor: 0xkasper & patronasxd\n\nYou can just hang outside in the sun all day tossing a ball around, or you can sit at your computer and do something that matters.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/World_of_Memecraft/world-of-memecraft.zip"]}, {"name": "risc4", "desc": "Reversing; ZK/Crypto\n\nAuthor: kemmio\n\nTake Risc to Drink Champagne! A crazy zk researcher has gated access to all his assets using a guest program that checks for a secret input, can you guess the secret input? The flag will be in the format rctf{0xINPUT}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Remedy/2025/risc4/risc4.zip"]}]}