{"crypto": [{"name": "Dastardly Evil Scientists", "desc": "Oh no! A brilliant scientist with questionable ethics has encrypted Anthony's important research. Luckily, the scientist who did this was overconfident, and gave us both the encrypted research and the contraption used to encrypt it. Can you get Anthony's research back before it's too late?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Dastardly_Evil_Scientists/server.py"]}, {"name": "Failed File Transfer", "desc": "Hello, Investigator,\n\nWe have intercepted a transmission that was sent to the thief of Anthony’s invention. We believe it may contain information pertinent to your investigation! Additionally, the sender accidentally failed to encrypt the file with the thief's most recent provisioned key, requiring them to resend the message. I am not sure why, but the keys don’t seem all that different… There may be a vulnerability with the provisioning process. Nevertheless, we have provided you with all attempts captured in transmission and the keys used for posterity. Good luck!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Failed_File_Transfer/file1.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Failed_File_Transfer/file2.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Failed_File_Transfer/file3.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Failed_File_Transfer/pk1.pem", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Failed_File_Transfer/pk2.pem", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Failed_File_Transfer/pk3.pem"]}, {"name": "MEaaS", "desc": "Sophie, one of Anthony's bosses, encrypts a lot of her data using RSA. We managed to recover the modulus and ciphertexts of her last three encryptions as well as an API key for a MEaaS (modular exponentiation as a service) application she uses for her RSA calculations. You can connect to the service via netcat as shown below. We've discovered that the service stores the last 16-bit exponent and modulus she used, and we know she used the same ones for all three encryptions. Additionally, the service adds an extra layer of security by encrypting the result using AES with a secret key. Lastly, something interesting about the MEaaS is that you can provide a \"slice\" of the bits of the exponent to use. For example, consider the exponent 14 which is 1110 in binary. If you provide a slice of 1, the exponent used will be the single least significant bit (0 in both binary and decimal). Similarly, a slice of 3 would make the exponent 110 (in binary, or 6 in decimal). Given this information and access to the MEaaS, can you determine what she encrypted?\nn = 1970384981\nc1 = 184323288\nc2 = 306942680\nc3 = 1791553791\nAPI Key: abadbd796f1b2ae8bd82e1195ad12373\n"}, {"name": "Old Fashioned Crypto", "desc": "Kasey recovered this encrypted flag, but it was encrypted with a custom cryptosystem. Can you find a weakness to exploit?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Old_Fashioned_Crypto/encryptor.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Old_Fashioned_Crypto/output.json"]}, {"name": "Warm Up Emails", "desc": "We've recovered some of Chase's emails from his inbox. It seems he was conspiring with someone, but the last email is encrypted. Maybe the other emails contain clues that will help us decrypt it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Warm_Up_Emails/emails.zip"]}, {"name": "Warm Up Words", "desc": "X marks the spot, but not where the Pigpen lies; there, secrets hide in plain sight.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/crypto/Warm_Up_Words/image.jpg"]}], "forensic": [{"name": "Ransom Note", "desc": "After the break-in to his lab Anthony found a suspicious new file on his desktop named README.txt. Anthony opened the file and found that it was a ransom demand from whomever stole his invention. Perhaps the contents of the ransom note contain a clue to the attacker's identity.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/forensic/Ransom_Note/README.txt"]}, {"name": "Warm Up Curiosity Helped the Cat", "desc": "In the relentless pursuit to reclaim Anthony's stolen invention, we've meticulously sifted through the digital ether, finding a PNG file adorned with whimsical felines. Suspicions now converge upon Alex, a shadowy figure lurking within the depths of cyberspace, his motives shrouded in secrecy.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/forensic/Warm_Up_Curiosity_Helped_the_Cat/cats.png"]}, {"name": "Warm Up Decrypt the Flood", "desc": "Dive into the digital currents of Decrypt the Flood! Navigate through encrypted waters, uncovering clues hidden within the network flow. Will you decrypt the mystery behind Anthony's vanished invention, or will it remain lost in the flood?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/forensic/Warm_Up_Decrypt_the_Flood/evidence.pcap.xz"]}], "misc": [{"name": "3dbox", "desc": "Kasey stumbled upon an unexpected application installed on Anthony's laptop, shaking their head and muttering, 'This is quite unexpected\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/misc/3dbox/Untitled.svg"]}, {"name": "Internationally Problematic Acrostics", "desc": "In order to determine where Anthony's invention may have been taken; we have swabbed the entire computer network for traces of foreign interference in this foolish, albeit BOLD. theft. We believe that Raina, an incredible scientist, may have encoded the location within the following translation data stream. If you manage to decode the stream, please return to us the three words that relate to the suspected location; so that we may stop our suspect, Raina, and recover the invention before it is too late.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/misc/Internationally_Problematic_Acrostics/challenge.txt"]}, {"name": "Lunar Lander", "desc": "Starman!\n\nOn our way to the Moon, another ship tried to flag us down. We were confused by what they meant. I think their flag assignments are different than ours. You should already have our flag assignments, we just need you to double check it for us.\n\nNote: this is a two part problem. Wrap flag in RS{}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/misc/Lunar_Lander/step1.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/misc/Lunar_Lander/step2.txt"]}, {"name": "Secret Door", "desc": "You have found a secret door, to unlock it you must analyze the circuit design to obtain the code.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/misc/Secret_Door/lock-diagram.png"]}, {"name": "Spooky Image", "desc": "Shortly after learning about Anthony's missing invention, the Gumpinator, Zach stumbles upon this file.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/misc/Spooky_Image/Spooky.jpeg"]}], "pwn": [{"name": "Battelle Challenge", "desc": "Can you start the car?\n\nThere is a mistake in the code where the security access check message length should be 7 but the code actually responds when length is 6. This mistake is not related to the challenge. Just send length as 6 instead of sending 7 when sending the key. The Key is still 5 bytes. Sorry :(\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/pwn/Battelle_Challenge/SDS_Manual.pdf"]}, {"name": "Gadget Database", "desc": "You've managed to get into Anthony's gadget database! However, it seems like something is a little off... See if you can figure out what's going on here.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/pwn/Gadget_Database/gadget_database"]}, {"name": "Risky Clue", "desc": "Can you guess the riddle?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/pwn/Risky_Clue/clue"]}, {"name": "The Gumponent", "desc": "Hey, Chase here. Some of us on the team think we've found a component of something Anthony was last working on. Its seen running on a server.\n\nAdditionally, someone found a prototype. Do you can you dig into this and see if there is something on the server that could tell use more?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/pwn/The_Gumponent/test_gumponent"]}], "rev": [{"name": "EtTuBrute", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/rev/EtTuBrute/EtTuBrute.php"], "desc": "It turns out someone close to Anthony had a secret website which requires a password to get the hidden webpage. We have the php file for this website (looks like the author was too lazy to host the website). Based on the name of the file, maybe they feel guilty about something?\n"}, {"name": "Fun", "desc": "Michael stumbled upon this file while delving into the depths of digital data. Looks like it's time for some investigative fun!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/rev/Fun/ctf_oby_medium_1.py"]}, {"name": "Go Go Gadget", "desc": "I remember seeing Anthony playing with one of his little gadgets before he went missing. Do you think you can reverse this one for me?\n\nHe last mentioned something about trying to recover his symbols, but I never thought he was that musically inclined.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/rev/Go_Go_Gadget/go_go_gadget"]}, {"name": "Guess", "desc": "I was rummaging around some old files and found this badly made app (not mine by the way). Do you think you can uncover any hidden information hiding in when running it? You can download it here(guess.apk).\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/rev/Guess/guess.apk"]}, {"name": "Warm Up My Favorite Flag", "desc": "In our relentless quest to reclaim Anthony's cherished invention, we find ourselves navigating the intricate pathways of cyber investigation. Our attention is drawn to a digital artifact, the a.out file, a seemingly innocuous entity yet harboring secrets within its binary code. With Anthony's invention at stake, suspicions now converge not only upon Sophie, a figure of authority with a nuanced understanding of the facility's inner workings, but also upon Alex, a shadowy presence lurking within the digital ether.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/rev/Warm_Up_My_Favorite_Flag/a.out", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RITSEC/2024/rev/Warm_Up_My_Favorite_Flag/checker.c"]}]}