{"crypto": [{"name": "Art of Predictability", "desc": "People often dream about using math to cash out with a higher probability in casinos, but to reach that level you’ve got to start with the basics so unravel the threads of predictability woven into the fabric of pseudo-randomness of mathematical discontinuous piecewise linear equations, here’s some seed files for you to grow the plant of mathematical magic :)\n\nFlag format - rvcectf{...}\n\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/crypto/Art_of_Predictability/chall.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/crypto/Art_of_Predictability/output.txt"]}, {"name": "Builder Bob and Alice", "desc": "Bob sends a message to Alice and Charlotte. Help Alice and Charlotte decrypt the message.\nAuthor - Ananya Bhat\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/crypto/Builder_Bob_and_Alice/message.txt"]}, {"name": "Secrets From The Past", "desc": "Dive into history with a dusty old journal found in an attic, packed with secret messages from a World War II spy. Your task: decode the messages using mechanical means. These cryptic notes could hold long-lost stories that might rewrite history. Can you unravel the wartime secrets concealed within the coded language? Every cracked cipher is a step closer to revealing the untold tales hidden for decades. Get ready to decode and uncover the mysteries of the past!\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/crypto/Secrets_From_The_Past/configuration.txt"]}, {"name": "XOR Enigma", "desc": "Your task is to retrieve the flag.\nAuthor - Ananya Bhat\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/crypto/XOR_Enigma/chall.txt"]}], "forensic": [{"name": "Labyrinth", "desc": "Navigate through the labyrinth, and retrieve the flag. Keep count of your steps like 4!5!4! or you may encounter a dead end.\nAuthor - Ananya Bhat\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/forensic/Labyrinth/chall.iso.xz"]}, {"name": "Noise pollution", "desc": "Makes it difficult to think in so much noise, but im sure you can manage.\n\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/forensic/Noise_pollution/haze.jpg"]}, {"name": "TheChinesePhilosopher", "desc": "Sun Tzu, a philosopher with an insatiable curiosity about the cosmos, defies convention by becoming an astronaut. His journey into space is fueled by a quest for the universe's ultimate truths. Amidst the silent expanse, he finds awe-inspiring wonders, but ultimately realizes that the true answers lie not in the stars, but within the depths of his own contemplation.\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/forensic/TheChinesePhilosopher/space.gif"]}, {"name": "The Astronauts Enigma", "desc": "Meet Captain Vikram, an intrepid astronaut from India on a mission in the cosmos. Faced with a situation crucial to national security, Vikram resorts to an unconventional method to relay a vital message back to Earth. He transmits an enigmatic audio file and accompanies it with a series of seemingly incomprehensible texts so that no one can intercept them except for the smart minds from ISRO. As the nation holds its breath, a sharp mind from ISRO takes on the challenge to decode the audio file and unravel the cryptic texts. The fate of the nation rests in your hands as you have to decipher the peculiar communication from Captain Vikram. Amidst the cosmic silence, could the solution lie hidden within the realms of the microscopic? After all, in the vast expanse of the cosmos, sometimes the Tiniest secrets hold the greatest significance.\nFlag format - rvcectf{...}\n\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/forensic/The_Astronauts_Enigma/secretmessage.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/forensic/The_Astronauts_Enigma/signal.wav.xz"]}], "misc": [{"name": "Doodle Dilemma", "desc": "In the realm of digital secrets, a tech guru's QR code has fallen victim to his daughter's artistic mischief. Your mission, should you choose to accept it, is to restore the fractured QR masterpiece and unveil its concealed information. The reward for your digital dexterity? a generous \n\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/misc/Doodle_Dilemma/chall.png"]}, {"name": "Le Cafe des Secrets", "desc": "They say a picture is worth a thousand words, but in this Parisian cafe, chaos paints a more vivid scene. A portrait of Louis Pasteur watches silently as one woman adorns herself with a flamboyant hat, its color a perfect match for the polish another desperately tries to erase with her finest chemical weapon. Across the room, a lone figure hunches over a weathered scroll, his eyes scanning a cryptic message that only the cleverest minds can decipher.\n\nWrap the decrypted message with flag{} and submit.\n\nAuthor - Ananya Bhat\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/misc/Le_Cafe_des_Secrets/crypticmessage.txt"]}], "pwn": [{"name": "Paranoid", "desc": "Mr. Paranoid is again upto no good. His reputation in the black market grows constantly. The FBI are having trouble obtaining his location as he seems to be good at hiding. Your task is to expose him and assist the FBI in capturing him. I highly doubt he will have any sort of suspicion towards you as you've done well in the past couple of years as an undercover agent to gain his valuable trust. Good Luck. We are all counting on you.\n\nNote: If you're sure your exploit is correct and its not working the first time, run it again 2 to 3 times and it'll work.\n\nAuthor - Ibrahim Saify\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/pwn/Paranoid/challenge"]}, {"name": "The Baker 1", "desc": "Anna, the baker, needs help baking a cake. You know what to do. Help her out.\n\nAuthor - Ananya Bhat\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/pwn/The_Baker_1/chall"]}, {"name": "The Baker 2", "desc": "Anna has implemented a new system to take orders and print it out. Check it out.\n\nAuthor - Ananya Bhat\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/pwn/The_Baker_2/challenge"]}], "rev": [{"name": "Nebula", "desc": "Agents, we've intercepted a binary file from our undercover operative. Dive in, analyze it, and extract the hidden intel. The clock is ticking!\n\nAuthor - Pratham Naik\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/rev/Nebula/chall"]}, {"name": "Unscramble", "desc": "Cerggl zhpu abguvat gb fnl, whfg qvir va zna\n\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/rev/Unscramble/chall.java"]}], "steg": [{"name": "Cartoon Network", "desc": "Blossom, Bubbles, and Buttercup, find themselves trapped in a maze with keys labeled A, B, and C. They're stuck until they use their keys to unlock the way out. Pwease help them out ^-^ Blossom's key - powerpuffgirls\nBubble's key - sugarspice\nButtercup's key - andeverythingnice\n\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/steg/Cartoon_Network/chall.wav.xz"]}, {"name": "Doors of death", "desc": "Annabeth and Percy fall into Tartarus. Tartarus is a nightmarish abyss filled with various horrors such as primordial Greek gods, goddesses,Titans, skeletal warriors, monsters, dragons and other supernatural threats.The Greek Gods are your key, every other being can’t be . The mist may create illusions and conceal the real door.\nAuthor - Ananya Bhat\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/steg/Doors_of_death/tartarus.jpg"]}, {"name": "Lawliet s Successor Beyond", "desc": "Beyond was Lawliet's successor and he was told one thing before L's death -\n\"Remember, in this world, nothing remains concealed forever; as the day dawns, mysteries unravel, and shadows dissipate, leaving secrets exposed to those who dare to seek.\"\nFun fact - L's unique seated posture optimizes blood flow, directing it solely to the brain, thereby enhancing cognitive faculties and intelligence.\n\nAuthor - Bipin Raj\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/RVCExIITBxYCF/2024/steg/Lawliet_s_Successor_Beyond/chall.jpg"]}]}