{"crypto": [{"name": "Almost Large Enough", "desc": "You know how we tell our club members to encrypt their files with our public key prior to uploading them? I never thought one of them would would actually do that -- and I thought wrong. Unfortunately, it seems like I have misplaced the private key that was generated along with the public key. Do you think there's any way you can recover the contents of this encrypted file?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/crypto/Almost_Large_Enough/file.enc"]}, {"name": "Crossing the Rubicon I", "desc": "Once you get into cryptography, you really can't go back! But, to learn how modern ciphers work, you have to go way back to the very fist ciphers. Hailing from Ancient Rome, this might just be the most famous code of all time, which means it isn't great for security. Take a stab (or 23) at cracking this one!\n\n    Qefp lkb'p molyxyiv ybpq ibcq ql efpqlov. Kfzb tloh! Cixd: pmxoqxkZQC{3_7r_Yor7b?37284749}\n"}, {"name": "Crossing the Rubicon II", "desc": "Welcome to the sequel! Repeating a lucky number can be dangerous when encoding, so someone thought to choose an unlucky one to encode messages. I think this challenge will be a good addition to the practice rotation!\n\n    Ubj'q lbh yvxr gur frdhry? EBG-13 vf erpvcebpny, ohg abg irel fnsr. Avpr unpx! Urer'f lbhe cevmr: fcnegnaPGS{13_12a'g_YhPX7_4sg3e_411.27453829}\n"}, {"name": "Numbers on the Orient Express", "desc": "My cousin is really obsessed with mystery novels. He just finished one by his favorite author, Caeser Eightrows the Eighth, called \"Rail Fence\" . My uncle gave me this message he wrote, but it seems to be encoded somehow...\n\n    O:94wo-I936wia{82ltxNI14-NiB60}r-zK8!w!bvILjiZ\n"}, {"name": "Whose Encoding Is It Anyway I", "desc": "You have been randomly selected to participate in a study focused on the inherent complexities of certain types of text encodings. Please attempt to translate the below text into a human readable format.\n\n    ONYGC4TUMFXEGVCGPNVHK43UL5QW4MDUNBSXEXZQMJZTA3BTOQZV6ZLOMMYGIMLOM5PTIYJYGA4WGYRZPU======\n"}, {"name": "Whose Encoding is it Anyway II", "desc": "You have been randomly selected to participate in a study focused on the inherent complexities of certain types of text encodings. Please attempt to translate the text (found within the attached image) into a human readable format.\n\nFlag should follow outline format as shown in image.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/crypto/Whose_Encoding_is_it_Anyway_II/whose.png"]}], "forensic": [{"name": "Can You Hear the Music", "desc": "We hired a freelancer off of the Internet to produce some on-hold music for our phone lines. It seems like the file we received though is partially corrupted. Could you take a look at the audio and see what's up?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/forensic/Can_You_Hear_the_Music/can_you_hear_the_music.wav"]}, {"name": "Desist", "desc": "Some punk keeps on trying to pressure us to taking down our website with these bogus cease and desist letters. Would you mind looking at one to see if you can figure out who is really sending them?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/forensic/Desist/letter.pdf"]}, {"name": "In Plain Sight", "desc": "A graphic designer sent us a simple logo that we can use for our club. They even said that they left a little easter egg in the image. I took a look already but couldn't find anything. Maybe you can?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/forensic/In_Plain_Sight/in_plain_sight.jpg"]}, {"name": "Lack of Authority", "desc": "I'm trying to get the new website up and running. The only problem is that I can't seem to get anyone to sign my SSL cert. Can you figure out why no CAs will take it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/forensic/Lack_of_Authority/cert.pem"]}, {"name": "Under Construct", "desc": "Was looking back through the archives to see what the land was being used for all those years ago. Found this ancient image of a chapel under construction. It may or may not be of interest to you.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/forensic/Under_Construct/chapel.png"]}], "misc": [{"name": "Day by Day", "desc": "I was going back through our service logs to verify that no one has been tampering with our defensive security measures. I generated a list of dates -- days that our firewall was proven to be online on. Alas, it seems like someone disabled our firewall for one day. I need your help to figure out what day that was. Also, the list is not in any particular order. Good luck.\n\nThe flag is in the format spartanCTF{DATE}, where DATE is in the form of YYYYMMDD.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/misc/Day_by_Day/dates"]}, {"name": "Down the Rabbit Hole", "desc": "I found this file on a USB drive that was left by somebody after the last club meeting. I'm not at my computer right now so I can't open the archive myself. Would you mind looking through the archive to figure out what's on it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpartanCTF/2024/misc/Down_the_Rabbit_Hole/hole.zip"]}]}