{"bin": [{"name": "Across the Hex", "desc": "bin hard\n\nWho doesn't love a good spooky time crossword?\n\nThis crossword has the following words:\n\n    spooky hacker alien ghost pumpkin nicc ctf cybersecurity\n\nThe letts can be a mix of uppercase, lowercase, basic 1337 text, raw hex, and basic 1337 text in raw hex.\n\nEasy, right?\n\nThe crossword has a width of 16 and a word will never cross the boundary of the width.\n\nThe key is the sequence of all correct letters in the crossword file based on the letter position in the file. All raw hex letters are uppercase.\n\nRemember words can be horizontal, vertical, or diagonal and can also be backwards.\n\nHow many characters can a byte represent when viewed in raw hex?\n\nThe words must be continuous, ex. 0 must not appear in between characters if there is no o in the word. Words that start with a single hex char always start as follows 0x0F for example in no case should a word use random memory before. ex if the word is Fail \"\\x0F\" + \"ail\" is a possibility while \"\\x3F\" + \"ail\" is not. This applies for reverse order aswell.\n\nEnclose what is found as follows NICC{FOUND_FLAG_HERE}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/bin/Across_the_Hex/crossword.bin"]}, {"name": "String Theory", "desc": "bin easy\n\nI recieved this very weird email that only contained a file called \"openme\", it looks like an executable.\n\nCan you see if there is anything weird in this file?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/bin/String_Theory/openme"]}], "crypto": [{"name": "I dont speak Zorglax", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/crypto/I_dont_speak_Zorglax/Greetings-from-zorglax.pdf"], "desc": "hard crypto\n\n... I have no idea what this says. You'll need to figure it out for me. I'm 100% sure that there is a secret message in there, but I don't even know what I'm looking at.\n\nflag format: NICC{whateveryoufind}\n"}, {"name": "If the key fits", "desc": "easy crypto\n\nI am trying to escape this 64-story horror house and the only way to escape is by finding the flag in this text file! Can you help me crack into the file and get the flag? The only hint I get is this random phrase: MWwwdjM1eW1tM3RyMWNrM3Q1ISEh\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/crypto/If_the_key_fits/flag.txt.aes"]}, {"name": "What have we found here", "desc": "crypto easy\n\nAs the sun dipped below the horizon, casting long shadows across the barren landscape, I stood alone at the edge of the world. The map had brought me here, to this remote and desolate place, in pursuit of a mystery that had captivated the world's greatest minds.\n\nA cryptic message had been found on the ground, a message from the cosmos itself, or so it seemed. It hinted at the existence of extraterrestrial life, hidden within the depths of space. The message, a series of seemingly random characters, held secrets that could change everything we knew about the universe.\n\nMy task was to decipher it, to unlock its hidden meaning. The characters appeared to be encoded in a complex language, something that I cannot seem to figure out. The key to understanding lay within those symbols, like a cosmic puzzle waiting to be solved.\n\nAs I gazed up at the starry night sky, seeing the Leo Minor constellation in the sky, I knew that the fate of humanity rested on my ability to decode this enigmatic message, to uncover the truth hidden within the stars.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/crypto/What_have_we_found_here/found_notes.txt"]}], "forensic": [{"name": "Dont stick me there", "desc": "forensics easy\n\nI woke up after a night out and I'm hurting uh... everywhere... I think I left my phone at one of the bars we were at last night. Thankfully, I was able to see the last photo I took through the cloud.\n\nCan you help me find my phone? I need to know the name of the bar and when the photo was taken.\n\nflagformat: NICC{Bar_Name-HH:MM:SS}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/forensic/Dont_stick_me_there/lastphoto.png"]}, {"name": "Down the Wormhole", "desc": "hard forensics\n\nAn explosive chase with a UFO led us to a wormhole!\n\nMake sure you have your bases covered before you head in and find the secrets hiding inside!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/forensic/Down_the_Wormhole/wormhole.jpg"]}, {"name": "Halloween Masks Are Overrated", "desc": "medium forensics\n\nMy friend who is into aliens, has been acting weird lately.\n\nEver since he learned about some weird technique musicians used in the 1980s, he has been losing his mind.\n\nThe last message he sent me was this image of an alien mask, it might one of the masks from his big halloween mask collection.\n\nCan see if there is anything in this image he sent me?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/forensic/Halloween_Masks_Are_Overrated/mask.jpg"]}, {"name": "I Have Become Death", "desc": "Oh boy... Things are becoming hectic and it is stressing me out.\n\nMy computer seems to be haunted as it prevents me from starting up my computer.\n\nThankfully, after multiple resets - it stopped. I checked the logs and it is in these weird folders named after COD maps. Can you discover which file, with its extension, and the time, keep as is, it was executed?\n\nFlag Format: NICC{nameOfFile.extension_00:00}\n", "attach": [null, null, null, null]}], "misc": [{"name": "Ghosts Secret", "desc": "hard misc\n\nThe ghost is hiding something that makes him way too ghostly.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Ghosts_Secret/ghost.png"]}, {"name": "Insecure Protocols", "desc": "I just spun up my first website with a login page and everything! My friend tells me my page isn't secure and I'm not sure why.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Insecure_Protocols/insecure.pcapng.xz"]}, {"name": "Needle In a Haystack", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/Abraxas.webp", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/The%20Tale%20of%20the%20Haunted%20Hollow.docx", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/dark_and_stormy.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/do-you-know-the-muffin-man.gif", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/dusclops.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/flag.txt.txt", null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/giratina.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/more_horror%20stories.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/pumpkaboo.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/pumpkin_man.jfif", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/spooky-halloween.gif", null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/Needle_In_a_Haystack/trevenant.png"], "desc": "misc baby\n\nI lost my flag and I can't seem to find it. I know I put it in this folder, but it is not showing up.\n\nCan you help me find it?\n"}, {"name": "The Wizard", "desc": "osint easy\n\nWe intercepted a photo intended to be received by a suspected agent working with the Zorglaxians - or so it seems.\n\nWe're still decompiling the data, but we think the photo was taken nearby to where the agent was supposed to meet the Zorglaxians.\n\nCan you find the location of the photo while our team works on decrypting the accompanying message?\n\nWe need the entire street address, city and abbreviated state or district of where it was taken to send our agents to investigate with the local authorities.\n\n# = Number\nXX = State abbreviation\nAll spaces are underscores\n\nflag format: NICC{#_Street_Address_City_XX}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/The_Wizard/the-wizard.png"]}, {"name": "shapeshifter", "desc": "misc easy\n\nThere's this figure in front of me, but I can't even figure out what it is! What is that thing??\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SpookyCTF/2023/misc/shapeshifter/distant-figure.png"]}], "web": [{"name": "Jasons Baking Services", "desc": "Hey intern! We were able to swipe Jasons application from Github, see if you can find anything useful in the code that will allow you to exploit the real application.\n\n(Be ready to be flash-banged, the web-app is all white!)\n\n\n# I am not a software engineer by any means. This was a project I had created for learning purposes which I flipped into a challenge. Don't pick up my potentially bad progamming habits. Good luck.\n", "attach": [null]}]}