{"pwn": [{"name": "Its a me Jumpioi", "desc": "🎵 It's-a me, Jumpio! 🎵 Help me gather shiny coins so I can surprise my lovely Princess Pomegranate with beautiful flowers! 🌸🍄\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/StackSmash/2025/pwn/Its_a_me_Jumpioi/pwn_its_a_me_jumpio.zip"]}, {"name": "Jumpios Love Letter", "desc": "Super Jumpio is preparing a secret letter for Princess Pomegranate to share his daring plan to rescue her. To ensure its confidentiality, the letter will be securely password-protected, keeping it safe from prying eyes.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/StackSmash/2025/pwn/Jumpios_Love_Letter/pwn_jumpios_love_letter.zip"]}, {"name": "Refreshments", "desc": "On a blazing summer day in the Shroom Kingdom, beat the heat with our refreshing juice – it's as bright as a Sun Flower! In our Toadstool Stand, you're not just limited to one sip. Try a mix of free samples, or channel your inner alchemist like Toadsworth by blending it with other delightful beverages. The adventure for your taste buds awaits – power up and enjoy! ✨\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/StackSmash/2025/pwn/Refreshments/pwn_refreshments.zip"]}, {"name": "Super Jumpio Kart", "desc": "🏎️ Jumpio's revving up! Help him race through the tracks, outpace the others, and zoom to the castle to rescue Princess Pomegranate! 🍄👑\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/StackSmash/2025/pwn/Super_Jumpio_Kart/pwn_super_jumpio_kart.zip"]}, {"name": "Villainous", "desc": "Jumpio has made it to the Heap Hopper's castle for their final confrontation. Unfortunately, the dastardly Hopper seems to be invulnerable! Can you help Jumpio destroy the Hopper and rescue the Princess Pomegranite?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/StackSmash/2025/pwn/Villainous/pwn_villainous.zip"]}]}