{"crypto": [{"name": "BeepBoop Cryptography", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/crypto/BeepBoop_Cryptography/BeepBoop"], "desc": "Easy Beginner Crypto\nHelp! My IOT device has gone sentient!\nAll I wanted to know was the meaning of 42!\nIt's also waving its arms up and down, and I...\noh no! It's free!\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\nAutomated Challenge Instructions\n"}], "forensic": [{"name": "Low Effort Wav", "desc": "Easy Forensics\nLow-effort Wav\nLast year we went all-out and created a JXL file that had too much data.\nThat was too much effort. Shuga had to go and create a custom file that was altered, that's too much work, and is too passé. Also an astounding 286 guesses were made against 9 correct answers. That was too many.\nThis year, we used an already existing vulnerability (edit: aaaaaaaaaand it's patched, and like a day after we made this challenge... which was months ago), for minimum effort. And the flag, dude, is like, fully there, when you find it. Not half there. No risk of guessing.\nThis year, we introduce:\nThe low-effort wave 🌊\nRide the wave man. 🏄‍♂️🏄‍♀️🌊\nThe wave is life. The waves are like, sound, and like water, and like cool and refreshing dude.\nBut waves are hard to ride\nSo listen to them instead, crashing on the seashore. Listen to the music of the sea. Like the theme this year is music or something. So I theme this challenge, like, minimum effort music. Listen to this attached .wav file. It's amazing. Or so I've heard. Or rather, haven't. Something's broken with it. I don't know dude.\nIt also doesn't work. Can you fix this for me? I think there's a flag if you can find it.\nHints\nThere will be no hints given for this challenge by judges. The flag is in standard sun{} format. If anything, we've already given you too much data.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/forensic/Low_Effort_Wav/low_effort.wav"]}], "misc": [{"name": "Knowledge Repository", "desc": "Scripting Forensics Misc Medium\nUhhhh\nLooks like we lost control of our AI. It seems to have emailed folks.\nLike all the folks. There may have been a reply-all storm. We've isolated it down to just one email, and attached it to this message. Maybe we can bargain with it, but we need to understand its motives and intents. It seems to be throwing around a flag, but I'm not certain if it's a red flag or a sunny flag. Only time will tell.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/misc/Knowledge_Repository/greetings_human.eml"]}], "pwn": [{"name": "Array of Sunshine", "desc": "Easy Pwn\nSunshine on my shoulders makes me happy...\nHaiku to Sunshine - ChatGPT\n☀️ A sunbeam kisses 🍊\nGolden warmth in every slice 🌞\nNature's sweet embrace 🌼\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/pwn/Array_of_Sunshine/sunshine"]}, {"name": "Bug Spray", "desc": "Easy Pwn\nIntroducing the \"BugShield Assembly Defender\" – your trusted companion against unwanted interruptions in your software assembly process!\n🔒 Secure Protection: BugShield Assembly Defender is your ultimate line of defense, designed to keep your assembly code clean and bug-free. It acts like a protective shield for your projects.\n💼 Seamless Integration: This bug spray seamlessly integrates with your assembly environment, making it an essential part of your toolkit. Just a few clicks, and you're ready to go!\n🕊️ Lightweight Solution: Unlike heavy-duty tools, BugShield is incredibly lightweight, ensuring it won't slow down your assembly process. It's as efficient as a finely tuned assembly code itself.\n🌐 Broad Spectrum: BugShield Assembly Defender is versatile, safeguarding your code from a wide range of bugs and glitches. Say goodbye to segmentation faults, infinite loops, and other common assembly hiccups.\n💡 User-Friendly: With an intuitive interface, BugShield is easy to use for assembly programmers of all skill levels. No need to be a debugging expert – BugShield has got you covered.\n🚀 Boost Productivity: By eliminating bugs and optimizing your code, BugShield Assembly Defender allows you to focus on what truly matters: creating efficient, high-performance assemblies.\nSay farewell to assembly woes and confidently tackle your coding projects with BugShield Assembly Defender. It's your reliable partner in ensuring that your assembly code runs smoothly, every time!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/pwn/Bug_Spray/bugspray"]}, {"name": "Flock of Seagulls", "desc": "Pwn Easy Medium\nFlock of Seagulls\nOde to Seagulls - Chat GPT\nIn cyberspace they soar, a flock of seagulls, Guardians of data, with digital goggles. Their eyes keen for threats, they scan the waves, Protecting networks from the darkest caves.\nWith wings of encryption, they shield the skies, Defenders of secrets, where danger lies. In the realm of code, they glide and dive, Ensuring our data remains alive.\nCyber sentinels, they guard the shore, Against hackers' storms and breaches galore. In unity they fly, with vigilance and grace, These seagulls of security, in cyberspace.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/pwn/Flock_of_Seagulls/flock"]}, {"name": "House of Sus", "desc": "Hey! Look at that humungi amongi!\nAre you the IMPOSTER??\nThis game was all the rave back during COVID-19 and now we're bringing it back and better than ever!\nAn intern wrote this custom implementation of the fan-favorite Among Us, hopefully it's secure 🤞\nAfter hearing Among Us Trap Remix all summer, I'm quite sick of this game (and we fired the intern), but being imposter was fun!\nOh, did I mention that the intern is a huge fan of Star Wars? What a nerdddd\nlibc.so.6: https://storage.googleapis.com/sunshine-2023/libc.so.6\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/pwn/House_of_Sus/house_of_sus", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/pwn/House_of_Sus/ld-linux-x86-64.so.2"]}, {"name": "Robot Assembly Line", "desc": "medium hard pwn\nWe found the robotic turret assembly line control station! Can you break in to corrupt all of the robot turrets that are being manufactured?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/pwn/Robot_Assembly_Line/robots-assemble"]}], "rev": [{"name": "Dill", "desc": "Reversing Easy\nOriginally this was going to be about pickles, but .pyc sounds close enough to \"pickles\" so I decided to make it about that instead.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/rev/Dill/dill.cpython-38.pyc"]}, {"name": "First Date", "desc": "I'm Excited, this is my first date in years but this time it's a Play Date!\nSadly I'm locked out of it so if you could help me get in that would be great!\nNote\nYour .pdx.zip file should have this SHA256 hash: 27628909e164ac4c61eaf3bc2583282e9bebbb6d23871b6043614703492d6cf0. If it doesn't you're not on the correct build and should redownload the .pdx.zip file\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/rev/First_Date/main.pdz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/SunshineCTF/2023/rev/First_Date/pdxinfo"]}]}