{"crypto": [{"name": "CodeConundrum", "desc": "Mystery Awaits: Two riddles beckon, each a piece of the puzzle, each a step closer to the truth. The first whispers of ancient strategies; the second, locked away, demands your deciphering prowess. March FOURTH!\n\nRiddle 1:\n\n\"Veiled beneath the march of history, I stand. A silent whisper among the grand. In my realm, a shadow's breath can alter fate's demand. Where echoes of power shift the land. Not by sword, nor by gold, but by a simple sleight of hand. My empire expands, unseen, yet grand. What am I?\"\n\nRiddle 2: \"235508081b1045430e0b53151a0f55070c0c00001408111b0e071e550d49060745135a453a41011a100d02551a4e430d0c1d04014a0104060014484328451b00040f5502065511520600111b4f52231b4c101a06524309041d050146552549161c4d0641041f08040f594c101007002a4106120f1c05014c1a1016001408111b411f13551f00121b540f041600411713101f47552448021545120c52234a\"\n\nSecret Message: 170a1c160b02173e1a247f3a55102c332d2202251f031b5114\n"}, {"name": "Crypto Trail", "desc": "Uh oh, looks like my friend thought using multiple crypto algorithms meant he'd be safer! Show him it's quality over quantity!\n\nCyphertext:\n"}, {"name": "Freaky Flags", "desc": "Password manager? I store all of mine in image form.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/crypto/Freaky_Flags/freakyFlags.png"]}, {"name": "Ironcrypt", "desc": "Commander, we managed to gain access to the Ironblood's encryption servers, but we only know the key. If we get the IV, we will be able to decrypt all of their messages, locate their submarines, and win the war!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/crypto/Ironcrypt/encrypt.py"]}, {"name": "Too Many Numbers", "desc": "Oh no! Somebody turned my flag into a bunch of numbers. Can you help me recover the flag?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/crypto/Too_Many_Numbers/cipher.txt"]}], "forensic": [{"name": "Lightning", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/forensic/Lightning/Lightning.zip"], "desc": "McQueen got into a crazy crash and seemed to forget some of the places he has visited. See if you can jog his memory. Flag will be the names of all places, all lowercase, with no spaces or underscores, wrapped between the brackets of texsaw{}.\n"}, {"name": "MFMFT", "desc": "I stole my boss' flash drive. Rumor has it that he keeps the password to the payroll database fragmented across the filenames of the contents of his USB drive. I have a segment of the Master File Table here - can you help me figure out the password? I would like to give myself a 200% raise.\n\nOh, this might help: [0, 10, 17, 18, 5, 6, 15, 13, 9, 16, 12, 5, 11, 1, 14, 5, 7, 6, 7, 3, 2, 2, 10, 8, 4, 7]\n\nWrap what you find with texsaw{}! If the password is password, enter texsaw{password}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/forensic/MFMFT/TheMFT"]}, {"name": "MalWhere", "desc": "You are a malware analyst and your manager has tasked you to conduct an investigation on malware that penetrated your organization’s network. Figure out what the file is doing by using your skills in static analysis (examining the malware sample without running or executing the code) or dynamic analysis (studying the behavior of the malware sample) in a closed, isolated virtual environment.\n\n(Note: The exe file is password protected via zip. Please use the password \"infected\" to read the contents)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/forensic/MalWhere/hwvidmigplugin.zip"]}, {"name": "Malicious Threat", "desc": "In the wake of recent security breaches, it has become paramount to ensure the integrity and safety of our systems. A routine audit of our admin activity logs has revealed several anomalies that could suggest a breach or an attempted breach. These logs are critical to understanding the actions taken by users with administrative privileges and identifying any that could have jeopardized our network's security. Your task is to analyze the provided admin activity logs to identify any suspicious activities.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/forensic/Malicious_Threat/logs.txt"]}, {"name": "The Forked Cave", "desc": "A party of adventurers ventured into a dangerous cave, but forgot to bring in their handy partyflag.txt that gives them buffs.\n\nIn the end all but one died, as she was rescued by a strange knight. The party's flag was torn to shreds outside the cave.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/forensic/The_Forked_Cave/the-forked-cave.zip"]}], "misc": [{"name": "Lost CVV", "desc": "This challenge uses the same db file as \"PS2 Games\"\n\nFind the cvv of Karney Winward. I accidentally set it to 111 in the database and I can't revert the transaction. By the way I forgot how I made the hashes! All I can remember is that I used SHA256 64 rounds, included commas but not the spaces between entries (but keep spaces in things like addresses), and for the data I combined some info from clients and paymentInfo in that order, and definitely persisted the order of the columns. I honestly just don’t remember which columns I chose to use! Can you help me recover that cvv?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/Lost_CVV/db.sql"]}, {"name": "Market Data", "desc": "This challenge uses the same db file as the challenge \"PS2 games\"\n\nI’m curious about the recent market in action games. Find the total revenue generated by the 5th most revenue generating game in the Action genre in the last year (2023). Revenue is equal to the subtotal times quantity for a given order details. Some games have the same name because they're reboots of older games, make sure to group them up by id instead of by title!\n\nDo not pay attention to discounts, the order's total_amount (that includes services), or the price of the game itself (I haggle on them anyway).\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/Market_Data/db.sql"]}, {"name": "One Bit Error", "desc": "A friend sent me this image of a famous mathematician, but apparently one of the pixels was corrupted on its way to me. Luckily, my friend thought ahead and used some kind of error-correcting code to guard against this, but I don't really understand it. Can you find me which pixel was changed?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/One_Bit_Error/message.bmp"]}, {"name": "PS2 games", "desc": "As a 90’s kid I still remember when the PS2 came out! See below my database for the games company I run. Find for me the number of games on the database released for the playstation in the 2000’s (2000-2009 inclusive).\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/PS2_games/db.sql"]}, {"name": "TauTest", "desc": "A friend of mine encouraged me to visit someone he met last year, and the visit didn’t go as expected. He gave me a thumb drive and left mumbling about drip, flying monkeys, Nords, and other incomprehensible ramblings. Quite a strange man, if you ask me. After taking precautions, I opened the drive and all I found was a small binary and what I can only assume is a quiz of some kind. Maybe you can make sense of it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/TauTest/Self_Referential_Quiz.pdf", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/TauTest/testBinary"]}, {"name": "The Inference Problem", "desc": "A private investigator is looking for information that will help them track down a cybercriminal nicknamed Kannon, who leaked sensitive data from many large websites back in March 2023. While this led to the immediate suspension of Kannon’s account, the authorities were unable to track down and arrest Kannon in-person to this day. Rumor has it that Kannon recently started putting their skills to use at a new job at Shady Corp. Anyways, because you are a data privacy specialist, the private investigator has asked you to examine a set of tables containing “anonymized” data and see if you can determine any personally identifying information about Kannon. Find the following information about Kannon: social media username, date of birth, gender, race/ethnicity, height, weight, city, state, zipcode, job title, salary, phone number, and medical diagnosis.\n\nNote: All data values to be put in the flag should copied directly from the data tables without modifying the text of any data entry\n\nDisclaimer: The above scenario and data sets are completely fictional\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/The_Inference_Problem/data.zip"]}, {"name": "add 0 r", "desc": "These proof questions aim to introduce you to the Coq Proof System, an ecosystem of tools used to formally verify mathematical propositions, and specifically the correctness of programs.\n\nWrite a formal proof in the Coq system stating that for all natural numbers n, n + 0 = n.\n\nIn Coq, this is stated as:\n\nTheorem add_0_r :\n    forall n, n + 0 = n.\n\nYou will submit the text of your proof as a payload to 3.23.56.243 9014 where it will be checked for correctness. If your proof does indeed prove add_0_r, you will be provided the flag. Make sure to start with Proof. and end with Qed. followed by EOF on its own line.\n\nFormat: texsaw{flag}\n"}, {"name": "le interleave", "desc": "This is an encoding of a non-empty list - that is, a list that has at least one element:\n\nInductive nonempty_list (X : Type) : Type :=\n    | single : X -> nonempty_list X\n    | ncons : X -> nonempty_list X -> nonempty_list X.\nArguments nonempty_list X : assert.\nArguments single {X}.\nArguments ncons {X}.\n\nNotation \"[ x ]\" := (single x).\nNotation \"x :: y\" := (ncons x y).\nNotation \"[ x ; .. ; y ; z ]\" := (ncons x (.. (ncons y (single z)) ..)).\n\nThis is a recursive function that interleaves two non-empty lists. That is, interleave [1;3;5;7;9] [2;4;6;8;10] = [1;2;3;4;5;6;7;8;9;10]. If the lists do not have matching lengths, the matching sections are interleaved, and the remainder of the longer list is appended to the result.\n\nFixpoint interleave {X : Type} (a b : nonempty_list X) : nonempty_list X :=\n    match a, b with\n    | [ha], [hb] => [ha; hb]\n    | [ha], hb :: tb => ha :: hb :: tb\n    | ha :: ta, [hb] => ha :: hb :: ta\n    | ha :: ta, hb :: tb => ha :: (hb :: (interleave ta tb))\n    end.\n\nThis is an inductive proposition that characterizes a nonempty list such that each of its elements is less than or equal to the next element. For example, nl_le [1;3;100;9999] is provable, but nl_le [1;2;3;4;5;4] is not provable.\n\nInductive nl_le : nonempty_list nat -> Prop :=\n| le_single : forall x, nl_le (single x)\n| le_two : forall x y, x <= y -> nl_le (x :: [y])\n| le_pair : forall a b tl,\n    a <= b -> nl_le (b :: tl) -> nl_le (a :: b :: tl).\n\nWrite a formal proof in the Coq system stating that for two non-empty lists a and b, if nl_le (interleave a b) is True, then both nl_le a and nl_le b are True.\n\nTheorem le_interleave :\n    forall (a b : nonempty_list nat),\n    nl_le (interleave a b) ->\n    nl_le a /\\ nl_le b.\n\nThis is a big proof, so I've provided some very useful helper lemmas for you, and I've written most of the proof as well. Download them here. Make sure to use these resources! You will submit the text of your proof as a payload to 3.23.56.243 9015 where it will be checked for correctness. If your proof does indeed prove le_interleave, you will be provided the flag. Be sure to submit everything between the last Proof. and Qed., inclusive, followed by EOF on its own line.\n\nFormat: texsaw{flag}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/misc/le_interleave/le_interleave.v"]}], "osint": [{"name": "Cursed Images Toast Edition", "desc": "Look at all that bread; I kind of want to toast some. You know what would go well with the toast? Bacon. Lots of bacon. Oh, now I am starting to think about Kevin Bacon. Wouldn’t it be funny if this random kid had some connection to Kevin Bacon? I bet he knows him through some sort of mutual connection. I am pretty sure that the middleman between these two would be an actor from a movie of some sort, one that has starred in a movie with the kid and has starred in another movie with Kevin Bacon. Hmm I’m hungry. If you do find a middleman, can you find me a title of one of their movies/shows that sounds like it would taste good with my toast to make this a truly British breakfast?\n\nExample: If the middleman was actor John Smith, and the food item that made the toast a British breakfast was eggs, and John starred in a movie called \"Investing in a Nest Egg\", then the flag would be texsaw{Investing in a Nest Egg}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/osint/Cursed_Images_Toast_Edition/cursed_bread.png"]}, {"name": "Geo Location", "desc": "Find what street this picture was taken from.\n\nFormat the flag as the following: The street name in all caps with the spaces replaced by underscores. Write the full word for any abbreviated parts of the name.\n\nExample: If the street was Bourbon St the flag would be: texsaw{BOURBON_STREET}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/osint/Geo_Location/picture.jpg"]}], "pwn": [{"name": "Buffet Overflow", "desc": "The grand opening of the all-new, revolutionary \"webstraunt\" has finally arrived!!! To celebrate, the webstraunt is holding several kinds of all-you-can-eat buffets for just $200, accessible right from your desktop! Give us a visit at nc 3.23.56.243 9009 to place your reservation NOW!!!!!!\n\nCookies might not be on the menu - but PIE is!\n\n    Disclaimer: There may be security flaws in our ordering platform. Please remember that we are a small indie startup, and do not abuse the bugs.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Buffet_Overflow/webstraunt"]}, {"name": "Catch The White Rabbit", "desc": "Your task is to catch the white rabbit.\n\nControls: movement: WASD sprint: shift\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Catch_The_White_Rabbit/linux_build.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Catch_The_White_Rabbit/windows_build.zip"]}, {"name": "Collatz eral Damage", "desc": "Can you find the correct flag? It's hidden somewhere in this binary.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Collatz_eral_Damage/collatz_eral_dmg"]}, {"name": "Heaps of Garbage", "desc": "You’ve decided to look for treasure in various piles of garbage in a junkyard at nc 3.23.56.243 9010. However, you must be careful: Some treasures contain lead, asbestos, or other poisonous materials, so make sure to avoid these treasures! Can you dive through all the garbage heaps and collect all the salvageable treasure while avoiding the toxic treasures?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Heaps_of_Garbage/the_junkyard"]}, {"name": "Please Go Away", "desc": "Can you find the flag fair and square? Ready set go!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Please_Go_Away/go_away_pls"]}, {"name": "Psychological Warfare", "desc": "Did you know that the mov instruction in x86 is Turing complete :D?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Psychological_Warfare/iliketomovitmovit.zip"]}, {"name": "Ultron Encodes", "desc": "Strings can be hidden if you do not know how to look for them.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TexSAW/2024/pwn/Ultron_Encodes/ul7r0n3nc0desStrings"]}]}