{"crypto": [{"name": "Mammoths Personnal Slot Machine", "desc": "easy-medium\n\nLooks like Mammoth and Zypherion (two gambling addicts in the XSS gang) have a hard time remembering their access code for the gang weaponry system. Rather than using a password manager they opted for a Slot Machine that returns their password based on luck.\n\nWe managed to find the source code for this machine and now need you to get their codes.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/crypto/Mammoths_Personnal_Slot_Machine/server_REDACTED.py"]}, {"name": "OTPas ouf", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/crypto/OTPas_ouf/OTP_encryption.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/crypto/OTPas_ouf/picture.jpg.encrypted"], "desc": "It seems like Zypherion and Mammoth, two XSS gang members neither known for their cleverness nor prudence just exchanged a message for a \"vewy top secret much important\" occasion.\n\nKnowing the IQ level this may be of much interest or not, but we cannot afford to take any chances so we need you to help us decrypt this message.\n"}], "forensic": [{"name": "One Click 1", "desc": "voydstack\n\nS.N.A.F.U's leader, Axel Vaughn, has recently noticed slowdowns and unusual behavior on his personal computer. He fears that his computer may have been compromised. He is, however, careful about his internet browsing and claims not to have downloaded anything suspicious.\n\nAxel provided us with a network capture that was made in his local network. Your mission is to investigate this potential attack and assess the extent of the damage.\n\nIf you identify something, retrieve the IPv4 address and port of the server used to deliver the attack, as well as the CVE number of the vulnerability exploited.\n\nFlag format example: THC{1.2.3.4:5678-CVE-XXXX-YYYYY}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/forensic/One_Click_1/capture.pcapng.xz"]}, {"name": "Operation Shadow Leak pt. 1", "desc": "During their digital assault, a S.N.A.F.U agent managed to infiltrate an XSS member’s computer long enough to extract valuable RAM data and steal a critical disk image.\n\nThis intelligence may hold the key to decrypting vital documents that could expose the XSS's strategies and counter their plans for a devastating raid on the city's infrastructure.\n\nYou need to find both a flag and the bitlocker password, this one will be useful later.\nhttps://filesender.renater.fr/?s=download&token=ce51db62-6fe7-4e94-b608-60c7671e9a4e\n"}], "pwn": [{"name": "Black Market 1", "desc": "voydstack\n\nFollowing an investigation, we were able to identify a platform for the resale of exploits and cyber weapons operated by the Xtreme Scavenger Squad. Find a way to compromise this platform in order to paralyze their activities, and recover the exploits they sell.\n\nNote : this challenge has several flags, when you submit one flag, the instance will be stopped\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/pwn/Black_Market_1/black-market-dist.zip"]}, {"name": "GoPwn", "desc": "easy-medium\n\nRecently, rumors emerged on the Dark Web, whispering about a secret flaw in THCity's government systems. A vulnerability that would allow access to sensitive information, threatening to reveal secrets that could tip the balance of the city.\n\nJhonny Jhon Jhonson, a dynamic young executive with the Aurora Initiative has entrusted you with the task of testing the security of the systems. His insistence on the extent of the damage such a vulnerability could cause resonates deeply with you. The idea that a breach in their systems could compromise critical infrastructure, or worse, allow outside forces to take control, sends a chill down your spine. You're determined to find the breach, whatever the cost. The future of the city may well depend on it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/pwn/GoPwn/gopwn.zip"]}, {"name": "PAC diversifier zero", "desc": "By the way, what is PAC?\n\nPAC? What's that? PAC is a unique hardware security feature for aarch64 platform that enables you to sign pointers, among other things. This challenge is an introduction to PAC.\n\nUsage\n\n./qemu-pac -L /usr/aarch64-linux-gnu -cpu max -R 1G -p 16K ./challenge\n\nAuthors patate(@patateqbool) et zadig (@zadig1337)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/pwn/PAC_diversifier_zero/public.zip"]}, {"name": "Scavenchat", "desc": "We suspect an imminent new wave of attacks from the Xtreme Scavenger Squad on our infrastructure.\n\nWe need your help to recover sensitive information. The S.N.A.F.U has mandated you to compromise a private and offline chat server used by the criminals. The S.N.A.F.U investigation teams have managed to recover the sources of their chat server via a repository exposed on their Intranet. Recover this information at all costs.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/pwn/Scavenchat/scavenchat-dist.zip"]}, {"name": "XSStorage 1", "desc": "voydstack\n\nWe have learned about the existence of a file storage server, used by the Xtreme Scavenger Squad to store important files. It seems to use a homemade communication protocol. Your mission is to study its operation and exploit any potential vulnerabilities to compromise this server.\n\nFirst, you need to find a way to authenticate on this server.\n\nNote : this challenge has several flags, when you submit one flag, the instance will be stopped\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/pwn/XSStorage_1/xsstorage-dist.zip"]}], "rev": [{"name": "10 -9 mites", "desc": "medium-hard\n\nIn our cyberpunk world, technology has crossed unimaginable boundaries, and one of the Aurora Initiative's most secret innovations is nanomites. These tiny devices are microscopic machines capable of infiltrating complex systems at a level as deep as the processors themselves and can be used to create ultra-advanced protection mechanisms.\n\nThese nanomites can apparently detect any attempt at analysis. It would then be impossible to debug them. This level of security would be unbreakable. The SNAFU is planning on adding those to the remainging system in order to protect them from further XSS attacks, but we are not 100% sure about their efficiency. Prove that these nanomites are not infallible, by neutralizing their protection system and recovering the information hidden inside.\n\nThe sha256 of the downloaded binary is: sha256(nano_mites) = 9f02f6f15eca52f07e481a6f6f2c6b83ecb2cf42e6bc98aa45cb48a0dfbc2931\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/rev/10_-9_mites/nano_mites"]}, {"name": "ZigZAuthg", "desc": "easy-medium\n\nViktor \"Crypt\" (his real name is unknown) is a master of digital camouflage. Known for his ability to manipulate hidden networks and communicate in the shadows, he has set up an ultra-secure authentication portal to protect his most sensitive information. This portal is the key to access his private networks, where he plans sabotage actions against the TH City authorities. The S.N.A.F.U. needs you to infiltrate this portal and retrieve the information needed to locate his next targets and foil his plans.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/rev/ZigZAuthg/zigzauthg"]}], "steg": [{"name": "Foreign Interference Are they hidding something", "desc": "easy-medium\n\n    Note this challenge uses the same file as the other Foreign Interference ? challenge\n\nS.N.A.F.U. is concerned that foreign adversaries may be behind the sudden gang attacks. Your colleagues at SNAFU have found some files on the computer of a gang member that goes by the name of Viktor (aka \"Crypt\") including a copy of the NUSA (New United States of America) anthem. Try to find out what this file contains: foreign agent codes, passwords, or maybe it's just a (very) poor-quality audio file? Flag format THC{...}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/steg/Foreign_Interference_Are_they_hidding_something/national_anthem.wav.xz"]}, {"name": "Foreign Interference The qualitys so bad I cant hear anything", "desc": "medium-hard\n\n    Note this challenge uses the same file as the other Foreign Interference ? challenge\n\nS.N.A.F.U. is concerned that foreign adversaries may be behind the sudden gang attack. Your colleagues at SNAFU have found some files on the computer of a gang member that goes by the name of Viktor including a copy of the NUSA (New United States of America) anthem. Try to find out what this file contains: foreign agent codes, passwords, or maybe it's just a (very) poor-quality audio file?\n\nflag format : A famous sentence in lower case with only spaces between words. Add the THC{} around Examples :\n\n    Cogito, ergo sum : THC{cogito ergo sum}\n    Fiat lux : THC{fiat lux}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/steg/Foreign_Interference_The_qualitys_so_bad_I_cant_hear_anything/national_anthem.wav.xz"]}, {"name": "Silent Transmission", "desc": "medium-hard\n\nOur field agents have intercepted communications between rival gang members. No one at the base seems able to determine the transmitted information—you are our last hope on this issue !\n\nFlag format : THC(...)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/steg/Silent_Transmission/capture.pcap.xz"]}], "web": [{"name": "CodeBreakers 1", "desc": "Kato Reyes, known as \"The Razor\", a notorious hacker from The Xtreme Scavenger Squad, has hidden his malicious cyberattack plans on his secret website. Intelligence suggests he is planning to leverage this take over government infrastructure, targeting food production, energy grids, and medical centers. Your mission: Hack into Kato Reyes' website, and extract his plans before it's too late!\n\nNote : this challenge has several flags, when you submit one flag, the instance will be stopped\n\nAlso Note : this challenge may be blocked by the wifi if you are on site. If so, use your 4g hotspot for instance.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/THCon/2025/web/CodeBreakers_1/docker_without_sources.zip"]}]}