{"crypto": [{"name": "CiphersAreFun", "desc": "\n\nI love ciphers, they are amazing way to encode messages try it out you might learn something new :) File\n\n    Author: MrGrep Pastebin password is cscodershub\n\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/crypto/CiphersAreFun/lol.png"]}, {"name": "DealBreaking", "desc": "Salva is the secretary of the CEO of a ROTech Pvt Ltd. Today is an important day because the CEO is going to a meeting to sign a $13 Million Deal with another company. When Salva went to the office, she finds that the CEO is lying unconscious on his chair. It seems like Salva gave some wrong medicines to the CEO today. But now for the deal to happen, Salva needs to access the CEO's laptop and send the details of the Deal to the Vice President. The laptop was secured with the most modern security service. One has to decrypt a random text to gain access to the laptop.\n\ncnenprgnzbysbeurnqnpur\n\n"}, {"name": "GiveMeKeys", "desc": "Advanced Encryption Standard is a really nice way to encrypt your data but hey shhhhhh!!!! Don't share its secret key. Key is somewhere on the website.\n\nText to decrypt:  03692ED75F808357B70CA30683951582900485863FF53D8535EAE38F7068E2E2\n\n"}, {"name": "HashCat", "desc": "\n\nA Poor CAT was trying to learn hashes she encypted a file and zipped it...........but forgot password after sometime. can you help the poor cat to get her file back? Download File Initial password: trollcat PS: No bruteforce required. Flag Format: Trollcat{} Author: MrGrep\n\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/crypto/HashCat/Welcome_To_The_Game.rar"]}, {"name": "LostInForest", "desc": "\n\nRohit one day went on a solo trip on an adventure to Amazon Forest in Brazil. But unfortunately, on his adventure, he got lost in the vast Amazonian forest. His cellphone had no reception and even his compass was not working. After travelling for 6 hours without food and water, he met a tribal man. He was the 64th Tribal Chief of Yanomano tribe of native Amazon. Rohit was delighted to see him and ran straight to him for seeking help. The tribal man agreed to help him but only on ONE condition. That condition was to help the tribal man understand some random text which was etched on a stone tablet for the last 1000 years!!! The text etched on the stone tablet is given below :-\n\nTWVyY3VyeVZlbnVzRWFydGhNYXJzSnVwaXRlclNhdHVyblVyYW51c05lcHR1bmU=\n\nHelp Rohit to decode this text. Who knows? It might also help you to find your flag ;) Flag Format: Trollcat{} Author: AlPH4_CH4RLIE\n\n"}, {"name": "RadioStationApocalypse", "desc": "Bob is trying to stop a Apocalypse can u help him decode his output\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/crypto/RadioStationApocalypse/ciphertext.txt"]}, {"name": "ShowYourDedication", "desc": "For the last 11 months, James has been practicing for 5000m Marathon World Championship which is to be organised in Virginia, USA. James has running in his GENES and he has already won many laurels in National Events, but this time he wants to win an international competition. But the day of the race was totally unexpected for him. Unlike normal races, in this race, all the participants were told to run separately and their indvidual time will be recorded. Yet, to his surprise again, there was another rule. The participants were not told about where the finishing line was. The judges handed out a paper to everyone which was encoded in some way and apparantly this text had the destination of the race encoded in it. James is not very good in solving cryptics but he knew that the KEY to this race is RACE itself.\n\nThe content of the paper is given below :-\n\n powv wlck zs JICLQaFRNH\n\nHelp James to decode the text and win the race. \n"}], "pwn": [{"name": "Thoughts", "desc": "Good Thoughts Bad Thoughts !\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/pwn/Thoughts/libc.so.6", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/pwn/Thoughts/vuln"]}, {"name": "msgbox", "desc": "More secure than \"Whatsapp\"\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/pwn/msgbox/libc.so.6", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/pwn/msgbox/vuln", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/pwn/msgbox/vuln.c"]}], "rev": [{"name": "no-debug", "desc": "Exterminators stay away !\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/rev/no-debug/crackme"]}, {"name": "solver", "desc": "I love soluchan\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TrollCAT/2021/rev/solver/crackme"]}]}