{"crypto": [{"name": "Baby DLP", "desc": "With every failed scheme, Emperor Numerius Augustus grew angrier.\n\n\"Enough of these overcomplicated encryptions!\" he roared. \"Decimus, you shall create one final system—simple, elegant, and unbreakable!\"\n\nDecimus, now a broken man, nodded.\n\n\"Yes, My Lord. I shall craft the finest digital signature system in all of Rome.\"\n\nAnd so, he designed the Imperial Signature Service.\n\n\"No one shall forge the Emperor’s words!\" he declared. \"For I have created an unpredictable nonce system—one so random, so chaotic, that no enemy shall ever recover the key!\"\n\nHis secret?\n\nCRC32.\n\n\"My Lord, I shall use CRC32 as a randomness generator!\"\n\nThe court was silent.\n\n\"And then… I shall use it TWICE! A double nonce!\"\n\nThe Emperor, growing tired of mathematics, nodded.\n\n\"Good, good. Make it so.\"\n\nBut across the empire, the Numerii laughed once more...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/Baby_DLP/babydlp.sage"]}, {"name": "Brainrot", "desc": "With the failure of his composite modulus scheme and the Leaking Oracle, Decimus Cryptonicus grew desperate.\n\n\"They mock my work,\" he muttered in his study, staring at the burning city of Carthage. \"They say my encryptions are flawed. Fine. I shall create something so cursed, so incomprehensible, that even the gods will weep!\"\n\nThus, he devised his final creation:\n\n\"I shall take the Emperor’s message… and shift each letter by 8000 places in the grand library of Unicode!\"\n\nHis assistants recoiled in horror.\n\n\"But, Master… that will transform the message into pure gibberish! No one will be able to read it!\"\n\n\"Exactly,\" Decimus cackled. \"The best encryption is the one even I cannot decrypt!\"\n\nAnd so, the Curse of Rot8000 was unleashed. The flag was shattered into unreadable abominations, encoded with UTF-16 sorcery so vile that even the gods of Olympus refused to interpret it.\n\nBut among the Numerii, whispers spread.\n\n\"This is madness,\" one muttered. \"But madness… can be reversed.\"\n\nWith knowledge of character distributions, they began the ritual of reversing Rot8000, peeling away its cursed transformation, letter by letter.\n\nDecimus had tried to outsmart the world, but in his arrogance, he had created something that could still be undone.\n\nHis final mistake had yet to be exploited…\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/Brainrot/chall.sage"]}, {"name": "Lepton", "desc": "In the final days of Rome’s intellectual golden age, the philosopher Lucius Isogenius arrived before the Senate, disheveled, eyes burning with madness.\n\n\"I have seen beyond numbers,\" he proclaimed. \"Primes are shackles. Modular arithmetic is a crude tool for simple minds. But I— I have forged a cipher that bends the very fabric of reality!\"\n\nThe Senate groaned.\n\n\"The key exchange is weightless,\" Isogenius continued. \"The transformation exists in a space unseen. There are no inverses, no reductions—only a sequence of isogenies guiding the message through dimensions unknown.\"\n\nOne senator raised a hand. \"Lucius, will this work?\"\n\nIsogenius laughed. \"Work? This system is beyond working. It is untouchable. It is the final encryption.\"\n\nThey let him build it. They let him encrypt the most delicate secrets of Rome. They let him construct his temple of mathematical absurdity. And then, as always, the Numerii began their work.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/Lepton/chall.sage"]}, {"name": "Magic Curves", "desc": "Two curves, sqrt(2^3 + 2 + 4751) times the fun!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/Magic_Curves/chall.sage"]}, {"name": "Vectorial RSA", "desc": "In the final days of the Roman civil war, two rival generals, Alicius and Bobius, sought to end the bloodshed. Each commanded legions, loyal to none but themselves, yet both knew that if they continued to fight, Rome itself would fall.\n\nOne evening, under the dim glow of torches in a secret chamber beneath the Senate, they made a pact.\n\n\"We shall forge an agreement so intricate,\" Alicius declared, \"that neither of us can betray the other without dooming ourselves!\"\n\nBobius nodded. \"A contract not written in ink, but in mathematics. A key split between us, each holding only half, bound by powers so great no single man could claim the full prize.\"\n\nThe plan was set.\n\nEach general secretly constructed their own half of the key, twisting numbers with their private parameters, raising their secrets to powers unfathomable, and encrypting their half with the other's public strength. Neither would possess the full key until the pact was honored.\n\nThe final message was sealed. A shared key was formed. A cipher was drawn over the most precious secret of Rome.\n\n\"With this,\" Alicius whispered, \"we ensure balance. No betrayal, no treachery. Only unity.\"\n\nBut as the torches flickered, unseen figures moved in the shadows. The Numerii watched. The pact was clever, but cleverness alone would not save it. The scheme had flaws—subtle, imperceptible, yet fatal.\n\nAnd when the time came, the twin generals would learn:\n\nA pact sealed in numbers can be undone in numbers.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/Vectorial_RSA/challenge.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/Vectorial_RSA/out.txt"]}, {"name": "What the hecc", "desc": "Every good ctf needs its semi-unknown group challenge\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/What_the_hecc/chall.sage", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/What_the_hecc/out.txt"]}, {"name": "factor.com", "desc": "The great Emperor Numerius Augustus of Rome feared betrayal. His enemies, both within the Senate and beyond the empire’s borders, sought to intercept his messages. If his war plans fell into the wrong hands, Rome itself would crumble.\n\nTo protect his secrets, he summoned Decimus Cryptonicus, the empire’s finest mathematician.\n\n\"I want an encryption system so strong that no barbarian, no senator, not even the gods themselves could break it!\"\n\nDecimus, known for his eccentric genius, devised an ingenious plan.\n\n\"We shall not use two prime numbers for security… but MANY! We will multiply small primes together until we reach an enormous, unbreakable number!\"\n\nThe Emperor was impressed.\n\n\"And what of the exponent?\"\n\n\"It shall be vast, My Lord. A prime so large that even the Greek scholars will tremble before its might!\"\n\nThus, the Emperor’s messages were encrypted using countless prime numbers, forming a colossal composite modulus—an encryption so absurdly large that no one could hope to factor it. Or so they thought.\n\nMeanwhile, in the shadows of the empire, the Numerii, an elite order of cryptanalysts, watched and laughed.\n\n\"This fool has created the most composite modulus in history,\" one whispered. \"It is only a matter of time before we tear it apart.\"\n\nAnd so, the empire’s greatest cryptographic mistake was set into motion.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/factor.com/server.py"]}, {"name": "factordb.com", "desc": "The Emperor, still oblivious to the weakness of his previous encryption, demanded a new, improved method—one that would withstand even the cunning scholars of Greece.\n\n\"Decimus Cryptonicus, my most trusted mathematician!\" the Emperor bellowed. \"Give me an encryption that is both strong and efficient!\"\n\nDecimus, though exhausted, was still determined to prove his worth.\n\n\"My Lord, instead of many small primes, I shall return to the old ways—a solid foundation of two strong primes, $p$ and $q$, forming an impenetrable modulus $N$!\"\n\nThe Senate applauded. The Emperor was pleased. Rome would be secure at last.\n\nBut Decimus was notorious for overcomplication.\n\n\"To ensure the security of $p$ and $q$,\" he muttered to himself, \"I shall add an extra layer of obfuscation. A leak, but not just any leak—one so convoluted that no enemy shall understand it!\"\n\nTo the Emperor, it was incomprehensible.\n\nTo the Senate, it was genius.\n\n\"If no one understands it,\" Decimus reasoned, \"surely no one can break it!\"\n\nFor months, the encryption held. The Emperor sent his messages with unshakable confidence.\n\nBut in the dark corners of the empire, the Numerii, Rome’s secret order of cryptanalysts, examined the leak closely.\n\n\"This is not a safeguard,\" one Numerius whispered. \"It is a gift.\"\n\n\"He has unknowingly encoded information about $p$ and $q$ within the leak itself,\" another said. \"With effort, we can extract them!\"\n\nAnd so, the Numerii began their work, peeling back the layers of Decimus’s overcomplicated madness.\n\nThe walls of Roman cryptography were crumbling once more.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/factordb.com/chall.py"]}, {"name": "lepton2", "desc": "There was surely not an unintended before...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/crypto/lepton2/chall.sage"]}], "misc": [{"name": "Er Titus", "desc": "Will you find where Titto was in one of his adventures?\n\nthe flag is the name of the location, with the spaces replaced by '_', the letters should be only lower ascii ones (in case of letters like 'è', put 'e') then all wrapped by TRX{} (example: \"Naples International Airport\" is \"TRX{naples_international_airport}\")\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/misc/Er_Titus/er_titus.jpg"]}, {"name": "Golf", "desc": "\"Let's go golfin'\"\n\n    DJ Khaled\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/misc/Golf/challenge-misc-golf.zip"]}, {"name": "Lost", "desc": "I once had a license for this script, but now all I have left is myself; just me and only me. I won’t get lost..\n\nBack in high school, I had some free time to work on a few personal projects. Now, it's time to bring one back to life—and for you to shine, prove me who you are\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/misc/Lost/lost.lua"]}, {"name": "Perfect Bird", "desc": "As a bird soaring through the sky, you seek the perfect language, and then... you find this\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/misc/Perfect_Bird/chall.db3"]}], "pwn": [{"name": "Canon Event", "desc": "I heard about this weird syscall long time ago, I wonder what it does...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/pwn/Canon_Event/dist.zip"]}, {"name": "Free the monsters", "desc": "While I was waiting for monster hunter wilds to come out, I bumped into this one. But I haven't been able to finish it yet... It seems impossible! A friend of mine said he keeps the solvecript in his garage, but his older brother told him not to show anyone...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/pwn/Free_the_monsters/dist.zip"]}, {"name": "TRX Bank", "desc": "To all our Valued Customers, at TRX Bank we aim to provide only the top-notch banking and customer experience; all reports about so-called \"data leaks\" are baseless slander from our competitors.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/pwn/TRX_Bank/dist.zip"]}, {"name": "Virtual Insanity", "desc": "Dancing, Walking, Rearranging Furniture\n\nDISCLAIMER: This challenge doesn't require brute-forcing\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/pwn/Virtual_Insanity/dist.zip"]}, {"name": "dev mem", "desc": "I have no idea what to put here\n\nDISCLAIMER: Please test your solve locally before spawning a remote instance of the challenge!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/pwn/dev_mem/dist.zip"]}, {"name": "small baby", "desc": "im a baby and im small\n\nDISCLAIMER: This challenge was rated \"insane\" from the pwners of the team, please reconsider approaching the challenge DISCLAIMER: Please test your solve locally before spawning a remote instance of the challenge!\n\nNOTE: In order to make the intended exploit more reliable CONFIG_HZ is set to 100\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/pwn/small_baby/dist.zip"]}], "rev": [{"name": "Indianess", "desc": "Like a timeless classic in literature, this challenge embodies the essence of its genre. A true staple of CTFs, it tests fundamental skills with a familiar yet ever-engaging twist. Seasoned players will recognize its form\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/rev/Indianess/bytecode.bin", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/rev/Indianess/vm"]}, {"name": "LLL", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/rev/LLL/LLL.sml"], "desc": "LLL is my favourite programming lan... Cryptographic algorithm\n"}, {"name": "Molly Revenge", "desc": "let me play my lego games in peace\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/rev/Molly_Revenge/molly_revenge.zip"]}, {"name": "RuleMaster", "desc": "I am tired of hackers evading my signatures, why don't you try triggering it for a change?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/rev/RuleMaster/chall.cbc"]}, {"name": "molly", "desc": "yes, I play lego games while listening to music in my free time\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/rev/molly/molly.zip"]}, {"name": "sudo kurl spacewar", "desc": "The year is 3000 AD. The Pax Romana extends to the stars, but peace has been shattered. Xenomorph invaders challenge the might of the New Roman Empire. A letter arrives from the Senate, sealed with the golden eagle of Rome. It reads:\n\n\"Darius Caesar, the stars burn with conflict. The alien invaders are unlike anything we’ve faced before—ruthless, cunning, and relentless. They strike at our borders, threatening to unravel the Pax Galactica and reduce the New Roman Empire to ashes. Our legions are strong, but strength alone will not win this war. You must outthink, outmaneuver, and outlast them. The fate of humanity hangs by a thread, and only your brilliance can secure our future. Will you rise to the challenge and lead us to victory, or shall Rome fall to the void?\"\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/rev/sudo_kurl_spacewar/chall"]}], "web": [{"name": "Baby Sandbox", "desc": "can I put my code in yo dom\n\nPlease start an instance only if you have a working exploit 🙏 Test it locally first.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/web/Baby_Sandbox/baby-sandbox.zip"]}, {"name": "Keeper", "desc": "A simple client-side challenge for you. Enjoy 🎣\n\nPlease start an instance only if you have a working exploit 🙏 Test it locally first.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/web/Keeper/keeper.zip"]}, {"name": "Online Python Editor", "desc": "If you're tired of fast and good-looking editors, try this.\n\nNow with extra crispiness!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/web/Online_Python_Editor/online-python-editor.zip"]}, {"name": "zStego", "desc": "Modern day script kiddies like to encrypt their conversations using this weird \"zlib\" thing. I had literally never heard of it.\n\nDoesn't look safe, you say? Well, no one expects it so it works!\n\nI created this majestic tool to look for zlib-encrypted messages in Word documents, because I'm fascinated by this zlib-encryption everyone uses.\n\n(TRX script kiddies left a flag in /flag.txt)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/TRX/2025/web/zStego/chall.zip"]}]}