{"crypto": [{"name": "Karaball", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Karaball/ECC.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Karaball/challenge.py"], "desc": "Legend whispers of cryptic secrets hidden deep within the ancient Tabriz Saat Tower clock. The messages have eluded seekers for centuries. Will you be the one to finally uncover them? Begin your journey by exploring karaball.uctf.ir on port 15623. The tower awaits.\n"}, {"name": "Modal 1", "desc": "Mathematical operations can hide more than they reveal. Can you decrypt the secret hidden within these numbers? Pay attention to the sequence, and you may find that the answer lies in simplicity.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Modal_1/challenge.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Modal_1/output.txt"]}, {"name": "Modal 2", "desc": "The path to uncovering the secret is tangled in numbers—only the sharpest minds will find clarity.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Modal_2/challenge.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Modal_2/output.txt"]}, {"name": "Rasa", "desc": "Whispers linger in an ancient, forgotten cemetery. Can you unearth the secrets buried within?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Rasa/challenge.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Rasa/output.txt"]}, {"name": "Sergio", "desc": "In the heart of Tehran, a cunning spy organization has been using a flawed implementation of RSA to secure its secret communications. Sergio, an ace cryptographer, has intercepted an encrypted message, but only has the public key to work with. Can you assist Sergio in decrypting the message and uncovering the hidden secrets?\n\nReminder: Remember to submit the flag in this format: UCTF{flag}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Sergio/encrypted_message.txt", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/crypto/Sergio/public_key.txt"]}], "forensic": [{"name": "Catch Me If You Can", "desc": "In the bustling bazaars of ancient Persia, where merchants traded silk and spices, a secret message has been intercepted. Legend has it that this message holds the key to discovering the whereabouts of a hidden treasure deep within the ancient emperor of Persia. However, the message has been cunningly encrypted and is hidden within a sea of network traffic. Can you decode it before the secret slips through your fingers?\n\nReminder: Remember to submit the flag in this format: UCTF{flag}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/forensic/Catch_Me_If_You_Can/capture.zip"]}, {"name": "Hidden Coordinates", "desc": "Jack Sparrow may be searching for treasure, but he’ll never find the map if he can't decipher the signals. Buried within a seemingly ordinary pcap file are hidden details encoded in ICMP packets. Unearth the secrets concealed in these packets to reveal the flag.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/forensic/Hidden_Coordinates/plan.pcapng.xz"]}, {"name": "Lost Voyage", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/forensic/Lost_Voyage/Alice.pcapng.xz"], "desc": "Curse those pirates! I should've taken better precautions to hide my travel plans. The secret is now out there, but it's still within reach—if you know where to look. Remember, the answer lies within uctf{}...\n"}, {"name": "The Road of Redemption", "desc": "The key to redemption lies in the hands of those who know the deep secrets of the church. Do you have the courage to uncover them and find your way to the light?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/forensic/The_Road_of_Redemption/The-Road-of-Redemption.pcap.xz"]}], "misc": [{"name": "Strange Vacuum Cleaner", "desc": "In the heart of Iran, where the intricate patterns of Persian carpets tell tales of ancient empires, I stumbled upon a masterpiece from the bustling bazaars of Isfahan. This carpet, with its mesmerizing designs, seems to have a mind of its own—or perhaps it’s just the new robotic vacuums I’ve set loose on it. After testing a few state-of-the-art cleaning robots on this prized Persian beauty, I noticed something odd. One of these robots seems to be doing more than just cleaning—it’s almost as if it’s decoding secrets woven into the carpet by master artisans centuries ago! To unravel this mystery, I attached sensors to the robots, hoping to decode their strange behavior. But the data streaming in is as cryptic as the ancient symbols on the carpet. I need your help to sift through this digital tapestry and identify the rogue robot before it uncovers secrets best left hidden!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/misc/Strange_Vacuum_Cleaner/uctf_data.csv"]}], "net": [{"name": "Paho Puzzle", "desc": "A mysterious message has surfaced—\"Can you hear me?\" Your mission is to trace its origin and uncover the truth behind it.\n\nThe answer lies within the provided executable file. Are you ready to solve the puzzle and reveal the source? Download the file to begin your investigation!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/net/Paho_Puzzle/linux-amd-64.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/net/Paho_Puzzle/macOS-amd-64.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/net/Paho_Puzzle/macOS-arm-64.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/net/Paho_Puzzle/windows-amd-64.zip"]}], "pwn": [{"name": "Look up", "desc": "Unravel the hidden messages buried in the echoes of code.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/pwn/Look_up/look-up"]}, {"name": "Orange", "desc": "Dive into the juicy depths of this challenge and see if you can squeeze out a surprise.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/pwn/Orange/orange"]}], "rev": [{"name": "Drag n Zip", "desc": "Finding the Key in \"Drag n Zip\"\n\nWelcome to the \"Drag n Zip\" CTF challenge! In this challenge, your task is to dive into an Android game named Drag n Zip and retrieve a hidden flag. The flag is encrypted using the AES protocol, and your mission is to decrypt it and find hidden treasure of Hamandan.\nGame Details:\n\n    Game Name: Drag n Zip\n    Link to Game: Drag n Zip on Google Play\n\nSteps to Solve:\n\n    Download and Install the Game:\n    Start by downloading the \"Drag n Zip\" game from the provided link.\n\n    Analyze the Game Files:\n    Dig into the game's APK to locate the key used for encryption. You may need to decompile the APK and inspect the code to find where the key is stored or generated.\n\n    Identify the Encrypted Flag:\n    Find the encryption key within the game files or the game's runtime data. This key will be key to decrypt flag that has been encrypted using the AES protocol.\n\n    Decrypt the Flag:\n    Once you have both the key and the encrypted text, use AES decryption to reveal the flag.\n\nEncrypted Flag:\n\nJ8A+5LQD1tyqWUE4X4BmMaJWMxM1XLHxQ9eCbWpafJk=\n\nSubmit the decrypted flag to complete the challenge. Good luck!\nhttps://play.google.com/store/apps/details?id=com.cluckeyetea.dragnzip\n"}, {"name": "Execution", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/rev/Execution/Execution.exe.xz"], "desc": "Can you unlock the secrets hidden in the echoes of ancient code?\n"}, {"name": "REVNG", "desc": "Numbers hide what words cannot reveal. Can you uncover the secret encoded within them? Investigate carefully; the answer lies deep within the sequence.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/rev/REVNG/REVNG", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/rev/REVNG/flag.enc"]}, {"name": "Travel Guide", "desc": "Embark on a digital journey to a hidden destination in Iran. Uncover the secrets within the app and find your way to the true path. Will you navigate the unknown, or remain lost forever?(Min android version : 9)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/rev/Travel_Guide/TravelManager.apk"]}], "steg": [{"name": "Graphical Giggles", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/UCTF/2024/steg/Graphical_Giggles/Graph.gml"], "desc": "Welcome to the wacky world of graph mysteries! 🕵️‍♂️ In this challenge, you’ll be diving into a graph created with Gephi version 0.10.1. Some nodes in this graph are a bit different that makes them stand out. Your mission, should you choose to accept it, is to use a certain layout algorithm with the following parameters:\n\nseed: -6166447964882867254\niterations: 200.\n\nIf you do everything right, you’ll uncover a hidden 3-character text that will make you go “Aha!”. The Flag is format is UCTF{HASH} where HASH is the MD5 hash of the revealed 3-character text. Good luck, and may the graph be with you!\n"}]}