{"crypto": [{"name": "A messenger", "desc": "crypto 150\n\n— Next!\n\nThe iron door creaked open, letting the noise of the queue into the cubicle for a second, only to slam shut again with a metallic rumble.\n\n— Pap…\n\nI stammered. He was standing in front of me, wearing a hood with his nose just barely visible, and an emblem on his forehead that seemed to glow in the dim light of the lamp. That emblem looked familiar to me.\n\nFaster than I could think of anything, he handed me a strange piece of paper with the same emblem on it, and sprang out of the door like a scalded man.\n\nOn the paper, there was a cipher.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/crypto/A_messenger/your-note.png"]}, {"name": "Eat the rich", "desc": "crypto 350\n\nThe shadow government has been unable to extract valuable information from the rebels against the Big Bad with a wrench, and now they're asking you for help. They want you to solve the discrete logarithm problem. Unfortunately for them, you actually support the rebels in secret, so you came up with a plan:\n\n    You ask the shadow government for a monetary reward\n    You persuade the shadow government to perform a zero-knowledge proof at first, alluding to your paranoid tendencies\n    You prove that you know the key\n    You ask for a monetary reward immediately afterwards\n    You submit the key You procure lots of popcorn and rocket propellant and get away before anyone catches on to what you're doing\n\nYou've sort of worked out all the bullets, save for the third one. The third one turned to be problematic, though—instead of finding the key, you've managed to prove that is impossible. But does that imply you have to abolish the plan?..\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/crypto/Eat_the_rich/prover.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/crypto/Eat_the_rich/verifier.py"]}, {"name": "Pedersen", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/crypto/Pedersen/Cargo.lock", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/crypto/Pedersen/Cargo.toml", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/crypto/Pedersen/rust-toolchain.toml", null, null], "desc": "crypto 300\n\nNow you can just buy flag in a shop — put 1 337 ₽ to your cyberwallet and flag is yours.\n"}], "misc": [{"name": "Google Dyslexia", "desc": "misc 50\n\nSome bad guy did something to my laptop and broke my keyboard, it’s all mojibake now. Help me out.\n\n    gipa{c{aemcy{ydco{co{jgpo.e{i6mkhp,g5k6h\n"}, {"name": "Looking suspicious", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/misc/Looking_suspicious/IMG_5354.jpg"], "desc": "recon 200\n\nAfter a few nervous minutes, the lock gives in. You open the door and notice that it’s on the alarm. A slight chill rolls through your body from top to bottom; somewhere around the ankles it has turned into a full-scale avalanche of dread. Because if anyone sees you here, it’s literally game over. There’s no way you can stay here for more than a minute.\n\nYou run around the apartment looking for any clues, and in desperation, you go into the last room and find a piece of paper on the table.\n"}, {"name": "One two grab", "desc": "misc 100\n\nGrab the flag! Here it is, ready, just call the function that returns it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/misc/One_two_grab/flag"]}, {"name": "Uzh", "desc": "misc 50\n\n3 Billion Devices Run Java, now you can too!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/misc/Uzh/Uzh.jar"]}], "ppc": [{"name": "If a tree falls in a forest", "desc": "ppc 400\n\n“Can you hear the sound of a falling tree in the forest if there’s no one around?” asked Vovan, the visibly tipsy sysadmin. Oddly enough, despite the beer, such ideas could still cross his mind. Looks like the Ballmer peak really exists…\n\n“So can you hear it or not?” Tolik couldn’t let it go.\n\nWhat is Tolik even doing at the corporate party? Who’s monitoring Grafana? Interns? Vovan’s reasoning briefly cleared for a moment, but alcohol promptly reclaimed its rightful control over his mind.\n\n“No, of course not…\" the poor programmer tried to gather his thoughts once again.\n\n“Swear by all you hold dear? Are you sure?\"\n\nFor heaven’s sake, just drop it already… Vovan almost shouted. He had loathed Tolik ever since he wouldn’t let him install Nix on the laptop. But that could be forgiven: security concerns and all, plus it’s inconvenient to administrator… But intruding on vacation? That’s too much. But a comfortable workplace is still more valuable…\n\n“Even by prod- *hiccups* -uction…\" Vovan went all in.\n\n“Aren’t you a Nixer, though?\" Tolik squinted, “You don’t like side effects, you advocate for reproducible builds. So tell me, what does launching a pure function affect?\"\n\nWell, seemingly nothing… Tolik was a strange character. Always like this with him: seems like he’s just babbling nonsense, but then he says something smart. Why is he looking at me like that… And why isn’t he keeping an eye on the servers? Hoping there won’t be any issues and he won’t get pinned down? Or is he not hoping, but being certain? So, are there juniors sitting there or just scripts?..\n\n“Yeah, I’ve played with Nix, I did… F-function? Well, it doesn’t affect anything…\"\n\n“Uh-huh, so if you expose a function interpreter in the API without side effects and feed it an argument like your account key, nothing bad will happen?\"\n\nVovan took another sip. Strange, strange. A dangerous type.\n\n“It’ll be fine, why are you rambling… Bring your laptop here, let me commit your nonsense.\"\n\nTolik handed over his old Lenovo. Not getting far with that hardware… And his head was throbbing… But no worries, you can code a Lisp interpreter in your sleep. No need for a parser, yaml will do here… No need for JIT, what’s the difference, it’ll be fine anyway…\n\n“Satisfied?” Vovan asked Tolik, but he was already gone.\n\nStrange, strange character…\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/ppc/If_a_tree_falls_in_a_forest/lisp.py"]}], "pwn": [{"name": "Decode it", "desc": "pwn 200\n\n— Looks like our task set is rather disbalanced. We’ve got a hard pwn, but nothing simpler… That’s a bummer.\n\n— Nevermind, I’ll fix that in a sec.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/pwn/Decode_it/urldecode"]}], "rev": [{"name": "Uzh 2", "desc": "reverse 200\n\nNow try to win the game for real!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/rev/Uzh_2/Uzh.jar"]}], "stego": [{"name": "GGWP", "desc": "stegano 100\n\nWe’ve generated a world.\n", "attach": [null, null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/stego/GGWP/level.dat", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/stego/GGWP/level.dat_old", null, null, "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/stego/GGWP/session.lock", null]}], "web": [{"name": "Alarm clock", "desc": "web 350\n\nOur partners from Great Britain are about to start selling their Smart Alarm. We care about people's health and believe this device will cause great harm to humanity. We wish to stop the product from being released.\n\nWe have managed to get a hold on someone from smartAlarm, and they managed to steal a test access key to the web interface of Smart Alarm. They have also made a photo of the internals of the device.\n\nWe believe that the founder of smartAlarm might store some discrediting information on their laptop. Help us figure out if that's the case.\n\nThe server of this task is running in a container per team.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/web/Alarm_clock/board.png", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Ugra/2024/Quals/web/Alarm_clock/code.png"]}]}