{"forensic": [{"name": "Raring", "desc": "Thumbnail\n\nEn uppsnappad kommunikation mellan Kung Harald och hans frilla Brunhild Bedräglig verkar peka på att hon spelar någon form av dubbelspel. Är det till och så att hon försöker ta sig in i Haralds system? Är hon kanske till och med en möjlig allierad?\n\nGräv ut allt du kan ur den uppsnappade kommunkationen!\n\nVarning: du bör öppna filerna i en VM, trafiken innehåller en simulerad attackkedja.\n\nLösenordet till filen är infected\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/forensic/Raring/raring.zip"]}], "misc": [{"name": "Slogs i bitar", "desc": "Medium/Svår\nThumbnail\n\nKettil \"Krukan\" Halfdanson, motståndsrörelsens främste keramiker är försvunnen och hans verkstad en enda röra. Harriet misstänker att en av de sönderslagna krukorna kan utgöra en ledtråd, men för att veta säkert måste hon samla ihop alla bitarna. Hjälp henne! Bitarna kan vara svåra att hitta, men de flesta finns nog mitt framför dina ögon.\n\nHint: Vissa bytes behöver kanske vändas på, men vilka?\n\nAnvänd den bifogade bilden result.png, inte temabilden ovanför.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/misc/Slogs_i_bitar/result.png"]}, {"name": "Wireless", "desc": "Enkel\nThumbnail\n\nMotståndsrörelsens signalunderrättelsetjänst, MRA, har lyckats fånga upp en okänd signal. Den franske utbytesstudenten Foudroyant Fourier har en idé om att signalen utgör det kodord som måste användas för att öppna en dokumentportfölj man kommit över under Operation Kaninöra.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/misc/Wireless/chall_4000hz.complex64.out"]}], "pwn": [{"name": "Raknegolf", "desc": "Thumbnail\n\nHaralds assistent, Torsten Tvehågsen, har hoppat av till motståndsrörelsen. För att bli bättre mottagen har han stulit med sig en konstig manick från Haralds lab, men han vet inte vad den gör. Harriet har undersökt den och tycker att det verkar vara en väldigt simpel spelkonsol för programmeringsövningar. Kanske kan du få konsolen att köra andra program än bara övningar? Det skulle kanske kunna ge Harriet nya uppslag på hur hon ska kunna hacka sig tillbaka till framtiden.\n\nSe information om snicat.\n\nDu kan behöva vänta upp till 30 sekunder efter att länken har visats.\n\nNotera att flaggan submittas i challengen \"Räknegolf\" (utan *).\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/pwn/Raknegolf/raeknegolf"]}], "rev": [{"name": "Energisk", "desc": "Svår\nThumbnail\n\nHarriet vill ta sig hem till sin egen tid igen, men den ena skärm-modulen på hennes PowerGloveTM gick sönder när hon spillde vaniljkrämen över den.\n\nDet gör det väldigt svårt att klara det CAPTCHA som krävs för att använda handsken... Lyckligtvis är hennes man, Harald, väldigt miljömedveten och har installerat en energimätare i handsken. Kanske går det att se, i loggarna från energimätaren, vilken CAPTCHA-fras som har räknats fram?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/rev/Energisk/energikonsumtion.csv"]}, {"name": "Goldenbinary", "desc": "Thumbnail\n\nUr det delvis korrupta minnet på Haralds PowerGloveTM har Harriet lyckats läsa ut lite data, som verkar vara förvrängd på något sätt, samt ett program som verkar vara till för att obfuskera data av olika slag. Tyvärr ligger manualen till handsken kvar hemma i 2024. Hon behöver hjälp, om hon någonsin ska lyckas få igång den igen och ta sig tillbaka till framtiden.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/rev/Goldenbinary/flag", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/rev/Goldenbinary/golden"]}, {"name": "Nyckelsk p", "desc": "Enkel\nThumbnail\n\nDen ondskefulla Harald Blåtand har plundrat och länsat en oskyldig by på dess skatter, och håller dem gömda i sin hemliga skattkammare. Därför har Blåtand nyligen köp ett nytt säkerhetsskåp, gjort av ett unikt material av okänt ursprung, smidd av dvärgar från storberget. Blåtand använder detta skåp för att förvara och skydda alla hans nycklar. Det Blåtand inte vet, är att skåpet inte inspekterats ordentligt vid produktion, och tillverkningsspår av skåpet har lämnats kvar i konstruktionen. Hjälp Harriet att bryta sig in i Blåtands nyckelskåp och hämta nyckeln till hans hemliga skattkammare och återge byn dess förlorade skatter.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/rev/Nyckelsk_p/key_cabinet.wasm"]}, {"name": "Runstenshemlis", "desc": "Enkel/Medium\nThumbnail\n\nHarriet och Ted Trubadur har uppfunnit en mojäng som förvandlar deras runskrifter till rena rappakaljan. På så vis kan de skicka hemlisar till varandra när Ted är iväg på viktingatåg. Nu har Harriet fått ett hemligt meddelande men inser att de tyvärr har glömt implementera någon funktion i mojängen som återställer texten! Kan du hjälpa Harriet att lista ut vad meddelandet innehåller?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/rev/Runstenshemlis/runstenshemlis.exe.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/rev/Runstenshemlis/secret.txt"]}, {"name": "Vikingaskepp", "desc": "Enkel\nThumbnail\n\nÄven på havet rasar kampen om framtiden. Motståndsrörelsens tappra lilla flotta kämpar mot överheten, men det går motigt. Harriets främsta amiral Fyodor Fuktig har känslan av att Haralds stryrkor på något oförklarligt sätt hela tiden ligger ett steg före.\n\nHjälp flottan att besegra Haralds armada!\n\nAnslut med binären nedan till din instans som skapas. Kräver en windows-maskin för att köra.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/rev/Vikingaskepp/Vikingaskepp_self_contained.zip"]}], "web": [{"name": "Runelogo", "desc": "Thumbnail\n\nNutida vikingar vill såklart ha sköna run-loggor. Med denna tjänst kan du skapa din egen, animerade run-logga! I vektorformat!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Undutmaning/2024/web/Runelogo/runelogo.tar.gz"]}]}