{"cloud": [{"name": "My Buddy Erik", "desc": "My buddy Erik wants to play Minecraft so I set up a server for us to play on. I've commited my configuration to GitHub because it's so convenient! Can you make sure that everything is secure?\nhttps://github.com/VikeSec/vikeCTF-2024-minecraft-server\n"}], "crypto": [{"name": "Deep Cover", "desc": "As the Viking ship sailed across the vast North Sea, its crew encountered unexpected turbulence in the form of a message. Amidst the rugged expanse of the waters, a messenger bird descended, bearing a weather report inscribed in Cyrillic script. With furrowed brows, the Norsemen deciphered the ominous tidings, seeking the hidden meaning within.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/crypto/Deep_Cover/ciphertext.txt"]}, {"name": "Norse Cryptogram", "desc": "Delve into the realm of Norse mythology and unlock the secrets of the runic script in this cryptic challenge. Armed with your wits and keen eye, decrypt the ancient messages hidden within the runes. Will you prove yourself worthy of Odin's wisdom or fall prey to the tricks of Loki? Prepare to embark on a journey through Viking lore as you unravel the Runebound Riddles!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/crypto/Norse_Cryptogram/runicTranscript.txt"]}, {"name": "Quantum Keygen Quest", "desc": "Gather 'round, ye stout-hearted souls, for within these sacred gates lie the keys to unlock the mysteries of the cosmos. Let not the symbols deceive thee, for they hold the power to unravel the very fabric of reality itself.\n\nWith nimble fingers and minds sharp as Mjölnir's edge, apply the ancient enchantments to thy ciphered scrolls. Dance with the shadows of uncertainty, for it is within the darkness that the true light of knowledge shall be revealed.\n\nAs the stars guide our course through the endless expanse, let us embark on this odyssey with courage in our hearts and the spirit of adventure blazing in our souls. For today, we embark on a voyage beyond the realms of mortal comprehension. Today, we harness the power of the quantum seas and emerge victorious, as legends of old. Skál!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/crypto/Quantum_Keygen_Quest/patternsAndEnchantments.txt"]}], "misc": [{"name": "Hidden Treasure", "desc": "As the dense fog shrouded the rocky coastline, a group of fearless Vikings set sail in their sturdy longship, their eyes gleaming with anticipation. Guided by ancient maps and whispered legends, they embarked on a perilous quest in search of a fabled treasure hidden deep within uncharted lands. With the wind at their backs and the crashing waves echoing their determined hearts, they ventured forth into the unknown, ready to conquer any obstacle that stood in their way in pursuit of untold riches and glory.\n\nWe received an image of the target's computer, and we have reason to believe they know the credentials to the website.\n\nDownload the image from here and find out how to access the flag: https://pub-2145e7fa138e484eb3462e0474545de9.r2.dev/vikectf2024%2Fvikebox.img.gz\n"}, {"name": "Hidden Valor", "desc": "Decode the secrets of our Viking legacy hidden within the depths of our emblem. Unveil the hidden message to reveal the path to glory!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/misc/Hidden_Valor/vikeCTF-logo.jpeg.xz"]}, {"name": "Robo Erik", "desc": "Uh oh! It looks like there's a robot viking in our midst, what power does it have?\n\n    You'll have to join the vikeCTF Discord for this challenge, I trust that you can find the link :)\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/misc/Robo_Erik/bot.py"]}, {"name": "The Usual", "desc": "In the heart of a bustling medieval market, a burly Viking with a formidable beard and weathered armor stumbles upon a peculiar sight—a vibrant flag shop adorned with banners of every hue. Intrigued by the fluttering colors, he enters the shop, his towering frame contrasting with the delicate textiles. With a mix of curiosity and confusion, he marvels at the array of flags, pondering which one might best represent his warrior clan amidst the sea of symbols and sigils.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/misc/The_Usual/the-usual"]}], "rev": [{"name": "Blackjack", "desc": "As I stepped into the bustling casino, the air was thick with anticipation. My eyes scanned the room until they landed on the blackjack table. Sitting across from me was the dealer, their movements precise and mechanical. With each shuffle and deal, there was something eerily robotic about them, sending a chill down my spine. Yet, I couldn't resist the allure of the cards spread out before me, beckoning me to take a chance.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/rev/Blackjack/blackjack"]}, {"name": "Cursed", "desc": "Good luck\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/rev/Cursed/challenge"]}, {"name": "Program With Jokes", "desc": "Unravel the enigma behind this funny program and showcase your tactical prowess like never before.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/rev/Program_With_Jokes/encrypted.lol"]}], "web": [{"name": "vikeMERCH", "desc": "Welcome to vikeMERCH, your one stop shop for Viking-themed merchandise! We're still working on our website, but don't let that stop you from browsing our high-quality items. We just know you'll love the Viking sweater vest.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/vikeCTF/2024/web/vikeMERCH/vikemerch.zip"]}]}