{"challenges": [{"name": "Binary Breakout", "desc": "reverse engineering @W1LDQU4K3\n\nIn the realm of cybersecurity challenges, the renowned organization VULNCON is currently hosting an engaging Capture The Flag (CTF). As part of their preparations, the developers are diligently crafting a state-of-the-art dashboard to facilitate the CTF experience. However, during the testing phase, an intriguing test challenge was introduced to the dashboard, only to encounter unexpected errors.\n\nAs a developer in VULNCON, Your task is to fix the error and solve the test challenge to verify the working of the dashboard.\nNote: flag format vulncon{md5_hash_of_found_value}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Binary_Breakout/ctfdashboard"]}, {"name": "C07P0Nx", "desc": "network @ransc0rp1on\n\nIn this challenge, participants delve into intercepted VOIP traffic to uncover a hidden coupon for conference attendees. Decrypting the coupon from the encrypted voice packets tests their prowess in VOIP analysis.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/C07P0Nx/chall.pcapng.xz"]}, {"name": "Deal", "desc": "crypto @r3yc0n1c\n\nAbhinandan is planning to launch a community discussion page for VULNCON. Rumors began to circulate about the malfunctioning of the original site after beta testing this new feature. A member of the dev team confirmed that he was stuck with an issue and posted about it in a dev forum. A random user named v1g1l4nt3 suggested the use of a new NSA standard cryptographic protocol to secure sensitive data. This new protocol was very fast and reliable, but suddenly, they got to know that their internal plans had been made public.\n\nCould you help them find out what's going wrong?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Deal/deal.tar.xz"]}, {"name": "Mojis", "desc": "crypto @r3yc0n1c\n\nA security breach at VULNCON has resulted in the theft of sensitive data.\n\nThe attackers have left behind a message containing encrypted information.\n\nAs a Crypto-Analyst of VULNCON, your task is to decipher the message and recover the original data.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Mojis/mojis.tar.xz"]}, {"name": "RSA Labs", "desc": "crypto @r3yc0n1c\n\nAt VULNCON, a prestigious cybersecurity conference, a sinister breach occurs. As expert crypto-analysts gather to discuss the latest in digital defense, a shadowy hacker named Aiden Pearce also known as The Vigilant or The Vigilante, infiltrates the event's systems.\n\nWith chaos unfolding, could you race against time to unravel the mystery and protect our own secrets, all while maintaining the illusion of control onstage?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/RSA_Labs/rsa_labs.tar.xz"]}, {"name": "Reverse Image Search", "desc": "OSINT RCP\n\nAttention, hackers!\n\nUse your reverse image search skills to pinpoint the city and country where this ship is currently docked. But that's not all—track down the name of the talented photographer who captured this image.\n\nSharpen your eyes, follow the clues, and uncover the details.\nFlag Format - vulncon{city_country_photographer_name}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Reverse_Image_Search/Ship.PNG"]}, {"name": "Traceless Traceback", "desc": "reverse engineeering @W1LDQU4K3\n\nA devastating ransomware attack left VULNCON, a prominent cybersecurity organization, reeling from significant losses, urgent measures were required for their incident response capabilities. The organization's budget constraints, however, meant they couldn't afford a critical tool essential for their recovery. Harnessing the skills of their talented team of reverse engineers, VULNCON devised a daring plan.\n\nThey turned to you, their trusted specialist in the realm of reversing, with a singular mission: reverse-engineer the elusive software and find the license key that would unlock their path to recovery.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Traceless_Traceback/recover"]}, {"name": "Unravel the ransom", "desc": "reverse engineering @W1LDQU4K3\n\nThere was a devastating ransomware attack on VULNCON, a renowned cybersecurity organization, a critical file containing vital information has been encrypted beyond reach. As part of the response team, you, a skilled reverse engineering specialist, have been entrusted with the task of unraveling this puzzle. The organization has procured a decryptor tool that promises to unlock the encrypted file, but there's a significant hurdle: no one knows the password needed to initiate the decryption process.\n\nWith time ticking and stakes high, your mission is clear—to unearth the elusive password and restore access to the invaluable data.\nNOTE: flag format - vulncon{md5_hash_of_found_value}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Unravel_the_ransom/decryptor.zip", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Unravel_the_ransom/secret.txt.ENC"]}, {"name": "Unreadable", "desc": "forensics @warl0ck_wraith\n\nDuring a recon on a hacker forum, we found that some people were interacting with unreadble files, can you figure out whats going on and try to find a way to read into the conversations?\n\nPS: Change Flag format to vulncon{} while submitting\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/VulnX/2024/Unreadable/conversations.zip"]}]}