{"crypto": [{"name": "alice and bob", "desc": "Alice and Bob are sending letters to each other. These letters are suspected to contain information that may compromise NATIONAL SECURITY. We need to deal with them. You, being the best agent at G.O.O.S.E., are naturally the best-suited for this critical role. We've managed to sneak you into a courier job: you're now the one carrying the letters back and forth. The only problem? They're encrypted. Military-grade encryption. Completely uncrackable. But maybe there's something you can do about it.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/crypto/alice_and_bob/communicate.py"]}], "misc": [{"name": "finders keepers", "desc": "Here's a haystack, find the needle.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/misc/finders_keepers/haystack"]}], "osint": [{"name": "0n3 hundr3d 87", "desc": "crypto out-of-the-box\n\nAt precisely 01:87 AM (yes, Euler swears that’s what the clock said, maybe he's been staying up too late doing math), encrypted enemy chatter was intercepted. An undercover agent embedded in their ranks managed to relay key intel: the villains—rumored to be UofT grads—are plotting to ruin Pi Day. Their plan? Use RSA 2048 encryption secured with \"smooth primes\" to lock away festivities and disrupt Waterloo’s celebrations.\n\nThe agent overheard them boasting, \"Waterloo will never crack this! They don’t even remember that old quadratic trick from some forgotten Italian mathematician. Let them stick to calculating 187 digits of Pi—they’ll never get through our encryption!\"\n\nIt’s time to prove them wrong. Sharpen your pencils, fire up your calculators, and crack their encryption before Pi Day becomes irrational chaos!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/osint/0n3_hundr3d_87/output.txt"]}], "pwn": [{"name": "intro pwn", "desc": "A classic pwn question, with a twist if you get unlucky.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/pwn/intro_pwn/vuln"]}, {"name": "precise equality", "desc": "Here at Goose Inc., we don't think standard equality is good enough. The current genre of equality, \"byte-for-byte comparisons\", is horribly imprecise, and doesn't consider the latest and greatest in philosophical research! To rectify this, we've implemented a demo of our NEW, truly Wittgensteinian, equality system. Go and check it out!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/pwn/precise_equality/src.zip"]}], "rev": [{"name": "RHR", "desc": "What does RHR stand for? No one knows.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/rev/RHR/main-small"]}, {"name": "a shell casino", "desc": "Don't gamble. Unless you can beat the house.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/rev/a_shell_casino/server.sh"]}, {"name": "those who rev", "desc": "Can you rev and pwn a language you've never seen before? This program solves Advent of Code 2023 Day 2 Part 2, in ngn/k.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/rev/those_who_rev/chall.k", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/rev/those_who_rev/run.py"]}], "web": [{"name": "goose intern portal", "desc": "Welcome to your internship at Goose Inc.! Here's our intern portal. It kindaaa doesn't work though, soooo... just wait for someone to fix it I guess?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/web/goose_intern_portal/prob.zip"]}, {"name": "server side rendering", "desc": "Cats love flags. You should give your cat some flags.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/web/server_side_rendering/ssr.zip"]}, {"name": "works modulo security", "desc": "Our intern at Goose Inc. has come up with a revolutionary new anonymization scheme! Using the power of MATH, our innovative new scheme allows every person to have an anonymous account that can be RE-ANONYMIZED to drop ALL history at will, even WITH a central authority! \"How!?\" I hear you ask. Well, just take a look at our demo website to find out!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WATCTF/2025/web/works_modulo_security/app.zip"]}]}