{"rev": [{"name": "PinValidate", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Winja/2025/rev/PinValidate/CurtinPinValidate"], "desc": "Android\n\nThe wizards have built an app. Send the key to find their slogan for 2025.\n\nFlag format: flag{[SLOGAN]}\n"}, {"name": "Sleep2", "desc": "Every young witch or wizard knows that the journey to Hogwarts begins at King's Cross Station, but only those who believe can find their way to Platform 9 ¾. Hidden from Muggle's eyes, the enchanted barrier separates the magical world from the ordinary.\n\nYour task is to decode a mysterious message transformed through an unknown enchantment. Can you unveil the true content and prove that you belong aboard the Hogwarts Express?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Winja/2025/rev/Sleep2/sl"]}, {"name": "The Chamber of Secrets", "desc": "Malware Analysis PWN\n\nHidden deep within an ancient fortress lies a secret chamber, sealed with powerful magic and protected by intricate traps. Legend speaks of a hidden word within, a word of immense power lost to time. However, the chamber's defenses are formidable, its magic woven into the very structure itself, obscuring even the most basic elements of its spells.\n\nOnly a skilled codebreaker, capable of deciphering arcane symbols and navigating treacherous code, can hope to unlock the chamber and uncover the hidden word. Are you up to the challenge?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Winja/2025/rev/The_Chamber_of_Secrets/TheChamberofSecrets"]}, {"name": "The Lost Prophecy", "desc": "An ancient scroll has been discovered, containing what seems to be a prophecy of great importance. However, the text is shrouded in a magical cipher, making it impossible to read. Scholars believe that the key to deciphering the prophecy can be found. Can you unravel the secrets of the scroll and reveal the hidden message?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Winja/2025/rev/The_Lost_Prophecy/TheLostProphecy", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Winja/2025/rev/The_Lost_Prophecy/flag.enc"]}, {"name": "harrysekr3t", "desc": "Harry has a secret he does not want everyone to know. He secured it with a key with 3 parts. Find the first two keys and this will help you to the final piece - the flag.\n\nMake sure to replace env with the environment variable and the KEY with the PAT token(binary - input).\n\nFlag Format: flag{testflagcontents_[env:KEY]}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/Winja/2025/rev/harrysekr3t/h4rrys3cr37"]}]}