{"crypto": [{"name": "3 5 business days", "desc": "My friend gave me this cipher for the crypto in this new cool app we're building together, but I suspect there are some flaws in it. He told me he'd get back to me in 3-5 business days but it's been 3 weeks....\n\nCan you figure out what's wrong?\n\nEdit: A small change was made to the problem, make sure you're using the most up to date version of the chal.py.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/crypto/3_5_business_days/chal_Z0ks27x.py"]}, {"name": "Common Faults", "desc": "lostcactus has a gold vault, but is faulty, so to protect his gold, he encrypted the password with RSA. lostcactus, a fond fan of Euler, generated a list of public keys, until it contained 271828, the first 6 digits of Euler's number. Unfortunatly for lostcactus, just like his vault, his key generator is also faulty, having a COMMON issue with his vault. Help him find his password again.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/crypto/Common_Faults/ciphertext", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/crypto/Common_Faults/past_keys"]}, {"name": "Detective Pikachu", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/crypto/Detective_Pikachu/I_love_pokemon.txt"], "desc": "Botman was playing his favourite Pokemon game when it got wiped (womp womp)! With all his hard work gone, Botman has turned to the only thing left in his game, a suspicious, seemingly useless text document. Can you help him get to the bottom of this mystery?\n"}, {"name": "Espionagey Crafty Clues", "desc": "Electron has joined a secret spy agency who sends messsages with coordinates through one of the most common key exchange systems. Unfortunately, Electron sucks at his job and was knocked unconscious by an enemy spy. Seeing how bad Electron was, the enemy spy trolled him and jumbled Electron's special coordinates.\n\nFortunately, Electron remembers that the spy agency communicates using the coordinate with the highest order. Unfortunately, Electron has a horrible memory, and forgot which coordinate it was and how to encrypt it. Can you help him find the coordinate and encrypt it with the secret exchange system?\n\nThe flag is the sum of the x and y coordinates of the shared coordinates wrapped in wxmctf{} (E.g. if the coordinates were (12, 34), the flag would be wxmctf{46})\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/crypto/Espionagey_Crafty_Clues/jumbler_QWGaWww.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/crypto/Espionagey_Crafty_Clues/note.txt"]}, {"name": "racing", "desc": "It wouldn't be a Toady crypto ctf if there wasn't an LCG!\n\nCan you beat this incredibly disadvantaged game against the cpu? Good luck!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/crypto/racing/chal.py"]}], "forensic": [{"name": "2 3", "desc": "The number eight might be the perfect number. Check out this cool octagonal fractal!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/forensic/2_3/fractal.png"]}, {"name": "Covert Chinchillas", "desc": "Everyone knows that eatingfood loves his chinchilla. In fact, all he ever does is send pictures of his chinchilla! However, something doesn't seem right. These adorable photos could have a secret waiting to be revealed...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/forensic/Covert_Chinchillas/chinchilla.jpeg"]}, {"name": "NDN", "desc": "Shane is working on making NDNs (Nerdy Dinosaur Names). It seems the data in the files have been stored weirdly. Can you help?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/forensic/NDN/ndn.zip"]}, {"name": "Zhuge Liang", "desc": "I stole a passage from wikipedia and turned it into binary. What was Du Fu's poem called?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/forensic/Zhuge_Liang/answer.txt"]}], "misc": [{"name": "Arrgh", "desc": "Eogito wanted to download a new video game on his phone, but he is not sure if the file he downloaded was a virus. Could you help him check through the app?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/misc/Arrgh/app.apk"]}, {"name": "My Preciourse", "desc": "Hint: - .... . .-. . .----. ... / .- -. / --- -.. -.. / -.-. .... .- .-. .- -.-. - . .-. / .. -. / - .... . / ..-. .. .-.. . / ..-. --- -.-. ..- ... / --- -. / - .... .- -\n\nWhere is Bagginses, hmm? Nasty Bagginses, we hates their beeps, yes we do! They hides from us, they do! Hid my precious, they did! We will finds it, yess!\n\nRemember to replace all spaces with underscores and wrap it around with wxmctf{}\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/misc/My_Preciourse/riddleses.txt"]}, {"name": "Where did Botman Bury the Bodies", "desc": "I don't know can you find out?\n\nhttps://drive.google.com/file/d/1IdqMMF8MVC4rk0Yn9fynQ8rXYhdAqm2A/view?usp=sharing\n\nTo submit the flag, go to what3words.com, get the correct period separated 3 word phrase and wrap it in wxmctf{}.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/misc/Where_did_Botman_Bury_the_Bodies/stegosaurus.png.xz"]}, {"name": "firstgrep", "desc": "You can manually read 10 files, but how about 1000?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/misc/firstgrep/firstgrep.zip"]}], "pwn": [{"name": "Moodle Madness", "desc": "It recently came to light from an anonymous source that \"Moodle,\" the math assignment program made famous by Ms. Gugoiu, has an exploit to see the answers to questions. Buddhathe18th, always reluctant to do homework, decided to investigate this exploit himself for the notorious 3.2 STACK Part 2 Challenge. He vaguely recalls that it involves inputting a string into the answer box, but with 1 hour left, he needs some help. Could you help him find the exploit?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/Moodle_Madness/moodle"]}, {"name": "TEJ3M", "desc": "This problem has now been FIXED and the provided files have been updated. Thank you for your patience.\n\nHere's my TEJ3M assignment! We're learning how to use C, and I think it's pretty easy! My teacher tells us gets is unsafe, but I think he doesn't know how to error trap!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/TEJ3M/assgn1_2o3BvZ6", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/TEJ3M/assgn1_ScZuUx0.c"]}, {"name": "lain writes in lisp", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/lain_writes_in_lisp/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/lain_writes_in_lisp/lain_ZlR5EIV", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/lain_writes_in_lisp/lisp.c"], "desc": "Have you read your SICP today?\n\nHINT: After you get the leaks there's an almost arbitrarily long overflow on the heap in the \"add_token\" function. Use it to corrupt the heap's metadata.\n"}, {"name": "leakleakleak", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/leakleakleak/Dockerfile", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/leakleakleak/leakleakleak", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/leakleakleak/leakleakleak.c"], "desc": "Leak, leak, leak, leak, I want you in my leak!\n"}, {"name": "nah id win", "desc": "As the strongest problem in history faced off against the strongest pwner of today, they asked it: \"Are you the shell because you are /bin/sh? Or are you /bin/sh because you are the shell?\"\n\nThe pwner laughed. \"Stand proud. You are strong.\" said the pwner. At this moment, the pwner used their domain expansion.\n\n\"DOMAIN EXPANSION. ret2libc.\"\n\nThe problem began using reverse pwn technique, but it wasn't enough. The domain was simply too strong. However, the problem had not yet used its domain expansion.\n\n\"DOMAIN EXPANSION: Return restrictions.\" The problem said, and the domain was instantly shattered.\n\n\"Nah, I'd win.\" The problem said, and the pwner was dealt with.\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/nah_id_win/libc.so.6", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/nah_id_win/vuln", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/pwn/nah_id_win/vuln.c"]}], "rev": [{"name": "Binary Conspicuous Digits", "desc": "This program outputs some conspicuous binary digits. See if you can find out what they mean...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/rev/Binary_Conspicuous_Digits/encrypt.py", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/rev/Binary_Conspicuous_Digits/output.txt"]}, {"name": "Notepad++ Development", "desc": "Timmy is a little insane. He prefers to write his flag checkers in Notepad++. Unfortunately for the rest of us, he forgot to translate it back into a normal binary. Can you figure out how his flag checker works?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/rev/Notepad++_Development/checker.txt"]}, {"name": "Recursive Combinatorics", "desc": "After effortlessly beating Ansh in multiple math contests, Jerry went on a well-deserved three-week vacation. However, Ansh, salty about Jerry's triumph, decided to create an even harder challenge for Jerry — one that has Jerry's least favorite topics: recursion and combinatorics.\n\nNot wanting to use up all of Jerry's vacation time, Ansh generously provided Jerry with the following instructions:\nThe Challenge\n\nContained within the file rev4.py, you'll find a Python function called go(). This function is your target.\n\nYour mission is straightforward: Determine the output of the go function when it's given the input of 1 trillion. Lets say this value is a\n\nOnce you've successfully calculated the value a, your next step is to use it to access a unique URL for accessing the rentry page. To do this, follow these steps:\n\n    Calculate the SHA-512 hash of the result of a XOR b, where b is the first Mersenne prime with 157 digits.\n    After obtaining the complete SHA hash, take the last 8 characters of this hash.\n    Construct the rentry URL by appending these 8 characters to the base URL. For example, if the last 8 characters of the SHA hash are 28559d4f, the rentry URL will be formed as: https://rentry.co/28559d4f.\n    It's important to note that the specific rentry link provided (https://rentry.co/28559d4f) does not exist. Your calculated 8 characters will access a unique rentry page where the flag can be found.\n\nJerry really didn't want to do this question, as he was on vacation. Can you help him do it?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/rev/Recursive_Combinatorics/rev4_5s33Foa.py"]}, {"name": "Songsilk", "desc": "Silksong is taking forever to come out. To cope I made a Silksong fishing minigame!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/rev/Songsilk/songsilk.exe.xz", "https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/rev/Songsilk/songsilk.pck"]}, {"name": "Womp Womp", "desc": "A minor fix has been added to stage 1\n\nOnly certain BrainF interpreters work correctly for the provided BrainF code. Modifications have been added to Stage 2.\n\n**A site that can run the bf provided: ** https://rextester.com/l/brainfuck_online_compiler\n\n\"In the unfathomable abyss of the ethereal labyrinth, cloaked in the velvet shroud of enigma, a riddle lies in wait, craving the kiss of revelation. Step boldly into the tangled web of shadows, where whispers of yesteryears echo like ghostly reverberations, divulging secrets buried in the annals of antiquity. Untwine the intricate strands of fate, woven into the very tapestry of time's fabric, as you navigate the labyrinthine corridors and hidden alcoves concealing the essence of transcendence. In this fifth iteration, the elusive key to unlock the depths of mystery lies veiled beneath layers of cryptic symbols and enigmatic puzzles, a treasure obscured yet yearning to be unearthed.\n\nYet, take heed, for within this realm of enlightenment, a dark gauntlet awaits, its path fraught with thorns of trial and tribulation. Here, the journey to enlightenment is akin to navigating a tempestuous sea, where only the most resolute voyagers emerge unscathed, their souls tempered by the crucible of adversity. So, brave the storm, O seeker of truth, for within the shadows lies not just obscurity, but also the promise of rebirth, where the Phoenix of enlightenment awaits those who dare to soar through the abyss of uncertainty.\"\n\n-ChatGPT, 2024\n\nGood luck and have fun in this last rev challenge of WxMCTF 2024!\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/rev/Womp_Womp/starting_info.bin"]}], "web": [{"name": "Brawl The Heist", "desc": "After getting all of his brawlers to 500 trophies, Eatingfood has found himself in a pickle - there is a Fang on the opposing team every other match and he can no longer play the game! Luckily, he has a plan - to get enough gems to buy every brawler and hypercharge so he can get back to mindlessly mashing buttons and winning. Not wanting to wait and earn gems slowly by normal methods, he has resorted to some slightly more unethical means - uploading a virus into the Brawl Stars servers which would allow him to siphon gems from other players. However, the virus has an unexpected effect: it only allows him to transfer gems to other players. Can you find a way to get him enough gems so he can get back to mindlessly button mashing?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/web/Brawl_The_Heist/src.zip"]}, {"name": "Compiler", "desc": "Come check out this python compiler I made! Just don't look too far into it...\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/web/Compiler/src_LLqLZC9.zip"]}, {"name": "Nuclear Launch Codes", "desc": "MGCI's cybersecurity club has hired you to test their site security for nuclear launch codes. Unfortunately, they forgot to give you any log-in credentials, and they haven't implemented registration features yet! Can you find the nuclear launch codes?\n", "attach": ["https://raw.githubusercontent.com/sajjadium/ctf-archives/main/ctfs/WxMCTF/2024/web/Nuclear_Launch_Codes/dist.zip"]}]}